{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-at-a-alpha-bio-3641782556?refId=YAQs290OqujQKG4UEyD8eQ%3D%3D&trackingId=hHfCO0fJgbpS83o%2BAJWxTw%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        A-Alpha Bio is an early-stage and rapidly-growing drug discovery company headquartered in Seattle, WA. We are enabling the next generation of high-impact therapeutics by combining high-throughput synthetic biology with state-of-the-art machine learning. We partner with leading pharma and biotech companies to enable the discovery of antibodies, molecular glues, and other protein interaction-related drugs. In parallel, we use our AlphaSeq technology internally to build a Biologics Pipeline for clinical development and/or asset licensing opportunities.Candidates local to Seattle are preferred, but remote applicants are welcome to apply. Candidates must reside in the US.Starting Salary Range: $145,000 - $176,000 per yearExemption Status: ExemptLocation Expectations: Remote-Eligible (travel to Seattle required once quarterly, on average)Role DescriptionWe are seeking an exceptional Senior Data Scientist to help us transform the huge amount of AlphaSeq data we're generating into compelling stories and high-impact therapeutics.ResponsibilitiesWork with wet-lab scientists to design experimental frameworks and analysis plans. Design, develop and apply effective and innovative methods for analysis and visualization of AlphaSeq data in a variety of scientific contexts. Lead the preparation and presentation of data analysis results to support external partnerships. Engage with global research, industry, and standards development communities to keep abreast of new technologies and best practices. Mentor other members of the team, enabling them to develop their skills and understanding in data science, statistics, and data visualization. QualificationsRequiredBachelor's degree in Data Science, Statistics, Biostatistics, Genomics, or a related field. 5+ years of industry experience with analysis and visualization of large biological datasets including next-generation sequencing data. Familiarity with the state of the art in antibody engineering, protein engineering, synthetic biology, or other high-throughput biology environments. Highly self-motivated, intellectually curious, and excited to thrive in a fast-paced, multidisciplinary, and team-oriented start-up environment. PreferredGraduate degree (PhD preferred) in Data Science, Statistics, Biostatistics, Genomics, or a related field. Experience with Python Data Science tools (Keras, NumPy, SciPy, Pandas, Scikit-Learn, Matplotlib, etc.) and Deep Learning frameworks (TensorFlow, PyTorch, etc.). We offer competitive compensation, including benefits and equity in a fast-growing start-up. Applicants must have legal authorization to work in the United States.About A-Alpha BioA-Alpha Bio is an early-stage biotechnology company combining synthetic biology and machine learning to dramatically improve the discovery of high-impact therapeutics. We believe that abundant high-quality data is critical for understanding biology and curing disease – and synthetic biology is our catalyst. Our proprietary AlphaSeq platform uses genetically engineered cells to quantitatively measure millions of protein interactions – from which we generate high-resolution models of biology.In 2018, we spun out of the University of Washington's Institute for Protein Design and Center for Synthetic Biology – both fantastic communities of brilliant and highly entrepreneurial scientists. Since the company's inception, we have focused on partnering with pharmaceutical companies to discover and optimize drugs for therapeutic areas ranging from infectious disease to cancer. We are growing rapidly, and new members of the team should expect a fast-paced and highly dynamic work environment. We are building a diverse, meritocratic, and supportive team that shares our values of speaking the truth, shooting for the moon, taking the reins, playing for the team, and improving the world.A-Alpha Bio is headquartered in a brand-new combined office/lab space in downtown Seattle's Belltown neighborhood. While the startup lifestyle occasionally requires grueling hours, we strongly value the need for a work-life balance and time out of the lab/office. We are fortunate to be situated in a region that is renowned for its premier outdoor activities, including hiking, biking, climbing, skiing, kayaking, and sailing. At A-Alpha, you'll find many who love the outdoors, but also gamers, amateur chefs, explorers, sports fans, bakers, crafters, photographers, brewers, jetsetters, animal lovers, and artists. Whatever your passions, you belong at A-Alpha Bio.\n      "
}