{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-staff-sr-staff-power-markets-at-equilibrium-energy-3641790423?refId=UxKEuQyLSdMNzHLEI7EiKg%3D%3D&trackingId=tzyKXCKwjMm9t%2F4U08nAhA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Our CompanyEquilibrium Energy is a well-funded, Series A clean energy startup backed by some of the most prominent institutional investors in climate. We are building a digital native power company operating at the intersection of grid variability, market volatility, economic optimization, commercial structuring, and risk management, across the end-to-end power value chain. Our mission is to accelerate our collective path to climate, energy, and societal equilibriums. Our goal is to become one of the next-generation, digital-native, end-to-end global clean power companies that reshapes the energy industry.New colleagues will share our vision that a next-generation energy company must be built from the ground up on deep industry expertise combined with an unwavering commitment to modern digital approaches. We design our commercial strategies, operational approaches, and product suites so as to best leverage data-driven insights, automated workflows, ML-infused pipelines, and fully automated decision engines. These capabilities are enabled by our progressively modern software stack and engineering best practices, which in turn provide the scalable platform we need to put a serious dent in carbon emissions. We're looking for collaborative, talented, passionate and resourceful folks to join our team and help us lay the foundation for our important mission and ambitious plan.What We Are Looking ForEquilibrium was founded with a vision for building a company where innovation, collaboration, machine learning, and data science power all aspects of our algorithmic decision-making. We are looking for staff / sr staff machine learning scientists to accelerate the design and delivery of our machine learning models, probabilistic forecasts, and insights dashboards, while helping to shape the science-driven products & processes that will drive the future success of our company.As a key member of our computational sciences group, you will play an active role in a) cultivating our culture of experimentation, insights discovery, and incremental delivery, b) facilitating research into state of the art machine learning techniques, c) helping to identify, recruit, train, and mentor members of our growing team of exceptional scientists, and d) partnering with our engineers, product managers, analysts, and commercial team to influence the near to medium term product roadmap.What You Will DoUse research insights to shape product direction: Influence product and engineering roadmaps through presentation of research insights, experimental results, and model performance metrics, in order to evolve organizational direction. Initiate and lead cross-functional engagements to surface, prioritize, formulate, and structure complex and ambiguous challenges where advanced novel deep learning research can have outsized company impact.Formulate and apply novel machine learning solutions to the energy domain: Tackle complex deep learning & machine learning problems by researching published academic literature, surveying industry techniques & intuition, and executing hands-on experimental testing & modeling. Drive the design, specification, development, and production deployment of our suite of novel deep learning & machine learning solutions. Lead short to medium term research projects that advance the state-of-the-art in deep learning as applied to energy asset management and financial trading.Performance evaluation: Define and evaluate a suite of success metrics across our portfolio of candidate and deployed machine learning models in order to understand operational characteristics, diagnose sources of under-performance, and identify opportunities for further research & improvement.The Minimum Qualifications You'll NeedPassion for clean energy and fighting climate changeAn advanced degree in computer science, data science, machine learning, artificial intelligence, operations research, engineering, or related quantitative discipline4+ years experience in data science, research science, machine learning, or similar role, applying and adapting deep learning, graph neural networks, or reinforcement learning techniques to time series regression & forecasting problems2+ years experience in the electricity & energy domain (e.g. electricity price forecasting, congestion prediction etc)3+ years experience with python and the supporting computational science tool suite (e.g. numpy, scipy, pandas, scikit-learn, tensorflow, etc.)Experience developing, releasing, and tracking performance of ML models in productionExperience communicating mathematical concepts, analytical results, and data-driven insights to both technical and non-technical audiencesA collaboration-first mentality, with a willingness to teach as well as learn from othersNice To Have Additional SkillsExperience designing and building novel statistical models on time series data, including characterizing probabilistic outcome uncertaintyExperience with dimensionality reduction, component decomposition, or embedding space analysis & visualization techniques (e.g. UMAP, T-SNE, Autoencoder)Experience with model explainability methods (e.g. SHAP)Experience with database technologies and sqlExperience with probability, hypothesis testing, and uncertainty quantificationExperience with optimization techniques (e.g. stochastic optimization, robust optimization)Experience with data visualization and dashboarding technologies (e.g. plot.ly Dash, Streamlit)Experience leading and mentoring a team of scientistsDemonstrated track record of academic paper or social media publicationNot sure this is the right role for you?We are a high growth company with accelerating hiring needs so there's a great chance we'll be able to create a custom role for you, now or in the future. All roles, titles and compensation packages are tailored to the applicant, so apply anyways and tell us in your cover letter about your dream role.What We OfferEquilibrium is composed of deeply knowledgeable industry experts across all our functions, with decades of experience in energy-specific commercial structuring, power systems engineering, machine learning, computational research, operations research, distributed and compute-intensive infrastructure, and modern software & ML engineering. Our experience in the space means we've previously built versions of nearly every technical component of our platform. We are now designing them better, and combining them in a holistic and novel way, to achieve global scale and climate impact. We pride ourselves on our deeply empathetic & collaborative culture, honest and direct but respectful communication, and our balanced, flexible, and remote-first work environment.Employee benefits include:Competitive base salary and a comprehensive medical, dental, vision, and 401k packageOpportunity to own a significant piece of the company via a meaningful equity grantUnlimited vacation and flexible work scheduleAbility to work remotely from anywhere in the United States & Europe, or join one of our regional hubs in Boston, SF Bay Area, or LondonAccelerated professional growth and development opportunities through direct collaboration and mentorship from leading industry expert colleagues across energy and techEquilibrium Energy is a diverse and inclusive, equal opportunity employer that does not discriminate on the basis of race, gender, nationality, sexual orientation, veteran status, disability, age, or other legally protected status.\n"
}