{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-power-bi-and-data-text-mining-expert-at-enexus-global-inc-3629775553?refId=S%2BAFHO4eD54QXqXRPutdZQ%3D%3D&trackingId=j4M6KghSTUJvOPxNYVSJnQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob Title: Senior Data Scientist - Power BI and Data/Text Mining ExpertRemoteW2 / C2C / 1099Duration 12+ monthsJob DescriptionWe are seeking a highly skilled and experienced Senior Data Scientist with expertise in Power BI, data mining, and Oracle Text Mining. As a key member of our data science team, you will be responsible for leveraging your deep understanding of data analysis, visualization, and mining techniques to uncover valuable insights from complex datasets. You will play a crucial role in driving data-driven decision-making across our organization and contribute to the development of cutting-edge solutions.Responsibilities Develop and implement advanced data mining techniques to extract meaningful patterns, trends, and insights from large-scale datasets. Utilize Power BI to create visually compelling and interactive dashboards and reports that effectively communicate complex data analysis results to stakeholders. Collaborate with cross-functional teams to identify business problems and develop data-driven solutions that optimize operational processes, improve decision-making, and drive business growth. Design and implement machine learning models and algorithms to solve predictive and prescriptive analytics problems. Apply natural language processing techniques and Oracle Text Mining to analyse unstructured textual data and extract relevant information. Conduct in-depth data exploration, feature engineering, and statistical analysis to identify patterns, correlations, and anomalies in datasets. Collaborate with data engineers and IT teams to ensure seamless integration of data sources and maintain data integrity throughout the analysis process. Stay up-to-date with the latest advancements in data science, Power BI, data mining, and text mining techniques, and propose innovative solutions to enhance our analytics capabilities. Mentor and provide guidance to junior data scientists, sharing best practices, and promoting a culture of continuous learning and improvement.Qualifications Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field. A Ph.D. is a plus. Proven experience as a Data Scientist, working extensively with Power BI, data mining, and Oracle Text Mining. Strong proficiency in data analysis, statistical modeling, and predictive analytics techniques. Expertise in using Power BI to create interactive dashboards and reports for data visualization. Solid understanding of machine learning algorithms, natural language processing, and text mining methodologies. Proficiency in programming languages such as Python or R, along with experience in SQL for data extraction and manipulation. Excellent problem-solving skills and the ability to translate business requirements into data-driven solutions. Strong communication and presentation skills, with the ability to effectively convey complex concepts and analysis results to non-technical stakeholders. Experience working with large-scale datasets and distributed computing frameworks (e.g., Hadoop, Spark) is a plus. Familiarity with Oracle databases and SQL queries for data retrieval and analysis.Join our dynamic team and contribute your expertise in Power BI, data mining, and oracle text mining to drive actionable insights and empower data-driven decision-making across our organization.\n      "
}