{
    "https://www.linkedin.com/jobs/view/research-scientist-at-deepgram-3575089289?refId=oI3PYBms2qtEddrLKuY8EQ%3D%3D&trackingId=aI%2FkY7IUuWnfHl336LfRQg%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        At Deepgram, we spend every day tackling big, real-world challenges in speech. Our customers hire us to solve their hardest problems in speech, taking real, complex audio and transforming it into novel insights. And to raise the bar, everything we build needs scale in its DNA; we aren’t content with simple horizontal scaling: we intend to replace entire data centers dedicated to speech analytics with a single rack of servers. These challenges provide opportunities for creativity and innovative problem-solving every day. Deepgram’s Research Scientists tackle some of the most exciting and difficult problems on the forefront of ASR and NLU technologies.In this role, you will become a leading expert in our model training techniques and a valued resource for the team on issues related to model creation and refinement. You will design, train, and deploy state-of-the-art ASR models on the latest GPU hardware, as well as explore new learning techniques, data analytics methods, and software architectures to improve Deepgram’s product. You will also lead the identification and investigation of opportunities to improve our existing solutions as well as developing new capabilities, including research on the design and deployment of CNNs and RNNs, the development of new ASR and NLU training algorithms, and more.You’ll have the freedom to innovate and uncover breakthroughs — and influence our product roadmap in turn. We look forward to you bringing your whole self to work, sharing learnings from your latest experiments, and collaborating with us to advance the state of speech technology.What You’ll DoUnderstand the latest advances in deep learning and speech analytics, with a particular eye towards their implications and applications within our productsDevelop new, or maturing existing, models for speech analyticsAnalyze new datasets for untapped potentialDeploy new models to productionConfigure systems (software, hardware, network, etc.) for optimal machine learning performance, and deploy massively scaled, multi-node training jobsBrainstorm and collaborate with other members of the research team to define new research initiativesYou’ll Love This Role If YouEnjoy developing state-of-the-art tools for correcting, improving, and enhancing ASR performance and NLU features using a variety of deep learning techniquesWant to see your curiosity and enthusiasm for your research cascade into the work of your peers. Respond to new challenges by taking initiative, making a plan, following the data, and communicating your results to the team for feedbackRemain steadfastly results-driven in the face of ambiguous problems and uncertain outcomesIt’s Important To Us That You Have5+ years of experience in Machine Learning research, particularly deep learning, with a solid understanding toward the applications and implications of different neural network types, architectures, and loss mechanismsFamiliarity with one or more of the popular deep learning frameworks: PyTorch, TensorFlow, Keras, etcExperience coding in PythonFamiliarity navigating UNIX-style systemsAbility to make data-driven decisions (including plots/visualizations) in order to rapidly iterate on model prototypesIt Would Be Great if You HadKnowledge of C, C++, and/or RustPublished papers in Deep Learning Research, particularly with neural networks Salary range of USD $150,000 to $250,000 base plus variable and equity regardless of locationDeepgram’s end-to-end deep neural network is revolutionizing the speech-to-text (STT) market and taking on the big guys. We’re redefining what companies can do with voice technology by offering a platform with AI architectural advantage, not legacy tech retrofitted with AI. We’ve raised over $86 million and have been recognized as an Inc. Best Workplace (2021 and 2022), a Forbes Top 50 AI Company to Watch (2021), and a CB Insights Top 100 AI Startup (2021), among others.Our tech advantage is end-to-end deep learning, but our strength lies in our diversity of people, ideas, and experiences that allow our company to create amazing STT products for people who are true innovators in the field. We believe every voice should be heard—and understood—from our transcriptions to our customers to our employees. Come join our revolution to unlock the power of voice technology for everyone. We want to hear what you’ve got to say!\n      "
}