{
    "https://www.linkedin.com/jobs/view/sr-data-scientist-at-hp-3624763789?refId=Fd86nNt66Ogi3nHeY6tCBQ%3D%3D&trackingId=m8pJ1TJ1StF7lvJkOyMvgw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Per the New York state statute, the estimated range of compensation for this job at the time of this posting, is $146,500-$225,650. This position may be eligible for incentive pay, for openings where this is applicable.At HP, we believe in the power of ideas. Our vision is to create technology that makes life better for everyone, everywhere — every person, every organization, and every community around the globe. This motivates us — inspires us — to do what we do. To make what we make. To invent, and to reinvent. To engineer experiences that amaze.The Sr. Data Scientist possesses unique mastery and recognized authority on relevant subject matter knowledge including machine learning technologies, theories and techniques. They will contribute to the development of innovative principles and ideas. They will successfully operate in HP’s most complex disciplines and provide highly innovative solutions.Leads large, cross-division functional teams or projects that affect the organization's long-term goals and objectives. May participate in cross-division, multi-function teams. Provides mentoring and guidance to lower level employees. Routinely exercises independent judgment in developing methods, techniques and criteria for achieving objectives. Develops strategy and sets functional policy and direction. Acts as a functional manager within area of expertise but does not manage other employees as a primary job function.ResponsibilitiesLeads organization wide team or teams of other data science professionals in complex projects to mine data using modern tools and programming languages.Defines and implements models to uncover patterns and predictions creating business value and innovation.Manages and creates relationships with business partners to evaluate and foster data driven innovation, provide domain-specific expertise in cross-organization projects/initiatives.Communicating business value and innovation potential through effective insights/visualizations.Represents the business at data science events, forums, boards.Prepares and presents literature, presentations, invention disclosures for peer review & publication in industry data science domain initiatives and conferences.Assures insights are communicated regularly and effectively, reviewing designs, models and accuracy and data compliance.Defines, communicates and drives data insights/innovation into the business.Leverages recognized domain expertise, business acumen, and overall data systems leadership to influence decisions of executive business leadership, development partners, and industry standards groups.Provides guidance, training and mentoring to less experienced staff members.Knowledge & SkillsExtensive experience using statistics, mathematics, algorithms and programming languages to solve big data challenges.Demonstrated innovation in the domains of generative pre-trained transformers, large language models, etc.Fluent in structured and unstructured data, its management, and modern data transformation methodologies.Ability to define and create complex models to pull valuable insights, predictions and innovation from data.Effectively and creatively tell stories and create visualizations to describe and communicate data insights.Strong analytical and problem-solving skills.Excellent written and verbal communication skills; mastery in English and local language.Ability to effectively communicate data product architectures and/or algorithm design proposals and negotiate options at senior management levels, BU and executive levels.Scope & ImpactCollaborates with peers, junior engineers, data scientists and project team.Typically interacts with high- level Individual Contributors, Managers, Directors and Program Core Teams.Leads multiple projects requiring data engineering solutions development.Drives design innovation.Education & ExperienceBachelor's, Master's or PHD degree in Mathematics, Physics, Computational Linguistics, Computer Vision, Natural Language Understanding and Generation OR Neuro Physics. Typically, 10+ years’ experience including graduate or postgraduate research.HP is an equal opportunity employer: https://www8.hp.com/h20195/v2/GetDocument.aspx?docname=c08129225About HPYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.Our history: HP’s commitment to diversity, equity and inclusion – it's just who we are.From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!\n      "
}