{
    "https://www.linkedin.com/jobs/view/sr-data-scientist-at-buzzer-3641782638?refId=sab0uXzKSWHCy093qSubNw%3D%3D&trackingId=IUeuv2ogoM5NY05dk5tiog%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout BuzzerSince 2020, Buzzer has built technology, infrastructure and insights alongside the best partners in sports, including NBA, WNBA, ATP, NHL & PGAT, for its US-based consumer platform. Buzzer is launching Powered By Buzzer, an extension of its technology globally as licensable B2B products and services to power partner platforms. This SaaS and services model broadens Buzzer's magic to the sports industry during a critical time as more entities move to D2C and seek new innovation within their products.Our mission is to simplify the discovery and consumption of live sports moments. We celebrate our community of fans who are fueled by their passion for sports. Founded in a hub of sports, our growing remote team respects tradition while valuing innovation. Our belief is that as a leading unifier of the sports ecosystem, we can foster togetherness through meaningful touchpoints & across generations.Position OverviewBuzzer is seeking an experienced Senior Data Scientist to join the engineering team in support of the development and improvement of our proprietary algorithms toward our B2B service offering, Powered by Buzzer. This is a critical role on our existing data science team to build a scalable and accurate solution to serve personalized communication and content to drive live sports look-ins, betting, purchasing, and other fan-centric behaviors.This person will be focused on developing and scaling Buzzer's personalized recommendation system. This system will be used to enhance Buzzer's notification system by utilizing explicit and implicit user preferences to notify fans of buzzworthy moments across a variety of sports and leagues. The goal of these models is to trigger high-value, personalized communications to users based on their preferences and usage data. This role reports into our Engineering Manager of Data and will build upon the existing infrastructure created to develop and refine existing and new models.This person should be highly self-motivated, able to effectively manage one's own time, collaborative, and communicative especially given our distributed team.Buzzer is presently a fully distributed company. The Senior Data Scientist role reports directly to the Engineering Manager (Data) and sits on the Data team composed of Data Science, Data Engineering, and Data Analytics. The role works directly with the Engineering and Product teams of Engineers, Product Managers, and UX Designers, and collaborates with the broader Operations and Partnerships teams.In this role, you will perform:Research & Development: Research and develop scalable, personalized recommendation systems spanning different sports and leagues. You will also conduct research and development related to sport-specific modeling to better predict and identify noteworthy sports moments to spur next-gen fan engagement. Data Scoping & Needs Assessments: Define key user data needed to build an effective recommendation and notification engine. In preparation for partnership discussions, identify league-specific data needs to effectively detect exciting moments that have some degree of predictability. Represent the Buzzer team on partner calls and articulate data requests and requirements for a successful customer experience. Model Enhancement: Contribute as a thought partner to the existing Data science team in further enhancing the model development process and existing league models. Evaluate existing models and processes to find possible improvements or potential bottlenecks. Onboarding and Personalization: Scope and identify what data Buzzer needs to best cluster/categorize its users for efficient recommendations and play an active role in discussions on how Buzzer should use onboarding data to send best–in–class personalized notifications. Coach and Mentor: As a technical competence leader, you will be responsible for coaching and mentoring across data modeling, machine learning, and other areas of professional development in order to grow and level up the Data team, as well as help strengthen a Culture of Data company-wide. Required Qualifications5+ years working with traditional data modeling and comfortable preparing and transforming (un)structured datasets for use in ML models and algorithms. Strong experience with Python, SQL, NoSQL, REST APIs, and parsing of various data formats. Experience building data flow for time series and categorical data in machine learning pipelines and evaluating both supervised and unsupervised algorithms. Experience with statistics and or data modeling tools and analysis. Experience working within a cloud environment like AWS and tools such as Redshift, EMR, ECS, Sagemaker, Lambda, S3, and DynamoDB. Strong analytic skills related to working with unstructured datasets and determining root-cause. Experience in stakeholder management and proven communication skills with both business and technical teams. Working knowledge of source control systems, including Git. Preferred QualificationsExperience with recommendation systems, real-time estimation/prediction algorithms, and natural language processing. Previous experience working in an agile environment with 2-week sprints. Experience or familiarity with Containerization, Workflow Orchestration, Infrastructure as Code, DataOps and MLOps methodologies and frameworks. Experience with sports media applications and or design. Experience working with external partners and/or in a client-facing capacity to achieve mutually desired results. Ability to self-motivate and manage up to report on progress and blockers. Empathetic, values-driven individual who is eager to contribute to a broader team culture. Master's Degree in Engineering, Data Science, Mathematics, Computational Statistics, Operations Research, Machine Learning or related technical fields. Compensation And BenefitsCompetitive salary between $145,000- $170,000 (exact compensation may vary based on skills, experience, and location.)Equity in the companyHealth benefits401KUnlimited PTOFlexible work scheduleBuzzer is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.About Strive: Buzzer's Commitment to Social ImpactStrive is Buzzer's 'why'. Strive is the intentional and impactful initiative that utilizes Buzzer's unifying platform, teammates, investors and partners to create more equitable social and economic outcomes for underserved communities.For the past three years, Strive has facilitated a global summer mentorship program connecting 800+ industry professionals with 500+ students of color from Historically Black Colleges and Universities (HBCUs) and other universities. This mentorship program ultimately inspired the Strive initiative and represents our ambitions to lead by doing the right thing for our potential customers, partners, and employees. Visit www.buzzer.com/strive to learn more.Join our community:Website: www.buzzer.comTwitter and Instagram: @buzzer\n      "
}