{
    "https://www.linkedin.com/jobs/view/scientist-early-preclinical-development-at-akouos-3641764699?refId=hFSj3C6goTrYa4R%2FmDHVcA%3D%3D&trackingId=YWQbVLDBPs330waa%2B9cJTA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nOur Mission: Healthy hearing available to all.Akouos, a wholly owned subsidiary of Eli Lilly and Company, is building a leading gene therapy company focused on hearing disorders. We are a precision genetic medicine company dedicated to developing gene therapies with the potential to restore, improve, and preserve high-acuity physiologic hearing for individuals living with disabling hearing loss worldwide. Leveraging its precision genetic medicine platform that incorporates a proprietary adeno-associated viral (AAV) vector library and a novel delivery approach, Akouos is focused on developing precision therapies for inner ear conditions, including forms of sensorineural hearing loss. Headquartered in Boston, Akouos was founded in 2016 by leaders in the fields of neurotology, genetics, inner ear drug delivery, and gene therapy. Job Summary:The Early Preclinical Development (EPD) team is seeking a highly motivated Scientist to conduct in vivo experiments supporting the development of product candidates from early discovery through IND-enabling stages. The successful candidate has in-depth knowledge in hearing or related scientific field, with solid experience in physiology / electrophysiology, surgery, data analysis, and data interpretation. The successful candidate will be a reliable, flexible team player who enjoys working in a fast-paced environment and is able to multi-task.Job Responsibilities:Conduct electrophysiology experiments to test auditory and cochlear function in mouse and large animal modelsPerform intracochlear administration of AAV vectors and/or support surgery personnelSummarize integrated nonclinical study datasets for internal and external communications, including for scientific conferences, internal functional team and cross-functional meetings, and for regulatory agency submissionsParticipate in weekly scientific meetings and cross-functional meetings to communicate procedures and results and data interpretation. Anticipate and resolve key technical or operational issues with potential to impact study execution and/or integritySupport cross-functional efforts to increase throughput of data collection and/or data analysisMaintain accurate documentation of experiments and projects. A flexible work schedule is expected with the potential for weekend work at timesJob Qualifications:PhD in life/health sciences required. 2 to 3 years related experience (e.g., preclinical / translational sciences, auditory science); experience in auditory function testing preferred. Prior experience performing in vivo experimentsExperience in solving scientific problems using programming languages, programming skills in at least one language such as Python, MATLAB, or IgorHigh attention to detailDemonstrated problem solving abilityStrong written and oral communicationAbility to integrate complex datasets to support conclusions for nonclinical studiesDemonstrated ability to work well in a collaborative and dynamic team environmentMust be willing to submit to criminal background checkAkouos is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, sex, gender identity or expression, age, religion, national origin, ancestry, ethnicity, disability, veteran status, genetic information, sexual orientation, marital status, or any characteristic protected under applicable law.\n"
}