{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-at-cambia-health-solutions-3635033808?refId=skfEMMVmKHNKu5QdLlO2Cw%3D%3D&trackingId=kwe1FtVds9OUoqk4dkqu9g%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nRemote or Hybrid or On-site within OR, WA, ID or UTCambia Health Solutions is working to create a seamless and frictionless health care experience for consumers nationwide. This presents a unique challenge and opportunity for innovative solutions that serve patients and providers and influence the healthcare system. Cambia’s AI team builds, prototypes, and deploys data-driven models and algorithms to production systems, delivering more equitable, effective, and affordable health care to our members.We Contribute Broadly Across Cambia, Working On a Wide Range Of Challenging Problems, For InstanceWe are seeking a talented and skilled Machine Learning Scientist to join us and help advance our current and future work applying machine learning, deep learning, and NLP to deliver better health care.Reducing our members’ claim costs using both supervised and unsupervised approaches.Speeding up prior authorizations and appeals using NLP to understand clinical notes.Personalizing member engagement to promote the health and well-being of our members.Driving health equity across Cambia initiatives.And much more!As a Machine Learning Scientist, you will play a vital role in understanding requirements, prototyping and building models, conducting experiments, and driving innovative solutions. Your passion for machine learning, deep learning, and NLP, coupled with your eagerness to learn and grow, will be instrumental in advancing Cambia’s data-driven initiatives.Qualifications & RequirementsAcademic degree (master's or PhD preferred) in Data Science, Computer Science, Statistics, or a related field.Machine learning: Strong mathematical foundation and understanding of the concepts underlying machine learning, deep learning, NLP, statistical modeling, and data analysis. Familiarity with common machine learning frameworks and libraries such as TensorFlow, PyTorch, scikit-learn, XGBoost, etc. Understanding of standard algorithms (e.g., search & sort) and data structures, and their analysis.NLP: Expertise in NLP and experience using LLM and NLP libraries like NLTK, spaCy, or Hugging Face transformers is a plus.Model development and evaluation: Experience applying a variety of ML techniques and approaches to solve problems. Strong foundation in model evaluation, including metric development and selection.Familiarity with production systems: Basic understanding of software engineering principles and considerations for deploying ML models in production systems. Exposure to containerization technologies (e.g., Docker, Kubernetes) and cloud platforms (e.g., AWS, Azure, GCP) is helpful. Understanding of model monitoring and MLOps.Data preprocessing and analysis: Understanding of how to structure machine learning pipelines. Familiarity with data preprocessing techniques and tools. Experience with SQL and/or python data processing libraries (e.g., Pandas, NumPy).Analytical mindset: Strong analytical thinking and problem-solving abilities to contribute to data analysis and experimental evaluations. Attention to detail and an eagerness to learn from experimental results.Communication and teamwork: Good communication skills to collaborate effectively with cross-functional teams. Willingness to collaborate and learn with team members.Healthcare knowledge: Previous experience is beneficial but not required.ResponsibilitiesModel prototyping and development: Use machine learning, deep learning, and NLP to prototype, develop, and refine models on top of our ML platform, leveraging best practices and established frameworks. Implement algorithms and techniques to meet requirements and objectives of specific business problems.Experimentation and evaluation: Conduct experiments and evaluations to assess the performance and effectiveness of different models and techniques. Develop metrics that reflect the needs of the business for their use cases. Analyze experimental results, interpret findings, and provide actionable recommendations.Model deployment and productionization: Work with ML Engineers to optimize and adapt models for real-time, scalable, and efficient performance. Collaborate with engineering and infrastructure teams to ensure seamless integration and deployment of models into production systems.Requirement analysis and solution design: Collaborate with cross-functional teams to understand business requirements, define clear objectives, and develop technical plans. Work with stakeholders to identify opportunities where machine learning techniques can provide valuable insights and solutions.Data preprocessing and feature engineering: Implement robust and reusable data preprocessing and feature engineering pipelines to extract meaningful insights from raw data. Clean, transform, and prepare datasets to facilitate effective model training and evaluation.Continuous learning and innovation: Stay updated with the latest advancements in machine learning, deep learning, and NLP, particularly as applied in healthcare. Explore and evaluate new algorithms, frameworks, and tools to enhance model performance and efficiency.Work EnvironmentWork primarily performed in a hybrid environment consisting of in-office and working from home. Travel may be required, locally or out of state. The base pay annual salary range for this job is $110,500 - $180,500.Some HighlightsBase pay is just part of the compensation package at Cambia that is supplemented with an exceptional 401(k) match, bonus opportunity and other benefits. In keeping with our Cause and vision, we offer comprehensive well-being programs and benefits, which we periodically update to stay current.medical, dental, and vision coverage for employees and their eligible family membersannual employer contribution to a health savings account ($1,200 or $2,500 depending on medical coverage, prorated based on hire date)paid time off varying by role and tenure in addition to 10 company holidaysup to a 6% company match on employee 401k contributions, with a potential discretionary contribution based on company performance (no vesting period)up to 12 weeks of paid parental time off (eligible day one of employment if within first 12 months following birth or adoption)one-time furniture and equipment allowance for employees working from homeup to $225 in Amazon gift cards for participating in various well-being activities. for a complete list see our External Total Rewards page.We are an Equal Opportunity and Affirmative Action employer dedicated to workforce diversity and a drug and tobacco-free workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, age, sex, sexual orientation, gender identity, disability, protected veteran status or any other status protected by law. A background check is required.If you need accommodation for any part of the application process because of a medical condition or disability, please email CambiaCareers@cambiahealth.com. Information about how Cambia Health Solutions collects, uses, and discloses information is available in our Privacy Policy. As a health care company, we are committed to the health of our communities and employees during the COVID-19 pandemic. Please review the policy on our Careers site.\n      "
}