{
    "https://www.linkedin.com/jobs/view/data-scientist-ii-at-state-of-colorado-3640273646?refId=dcIG%2BqWTvOfqEPIJyPCmRA%3D%3D&trackingId=3gGAp4QJwCyvGZZk6rap5A%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Department InformationTogether, we innovate for a stronger ColoradoThe work of employees at the Governor's Office of Information Technology (OIT) is challenging and diverse because the needs of agencies, customers and Coloradans constantly evolve. But our focus never changes: improve the lives of all Coloradans through innovation and collaboration. We're building one of the nation's leading government IT organizations by reimagining how we support agencies, building first-of-their-kind applications, and creating an inclusive, collaborative culture, together. Join us in the important work of providing equitable access to services.We believe equity, diversity, and inclusion drive our success, and encourage candidates from all identities, backgrounds, and abilities to apply. We know it's important to support each other, and that means having a healthy balance of work and personal time, and benefits that allow us all to have fulfilling lives.Watch this video to learn about how OIT is thinking differently!Description of JobDo you want to make our beautiful state even better? At OIT, we provide secure digital services that put Coloradans first. The Data Scientist supports that mission by implementing the myColorado Platform Metrics program and driving the day-today execution of the technology metric management process. If analyzing data, developing, and monitoring performance and risk is what you love, apply today for the chance to put your passion into the state you love.Some Of Your Important Responsibilities Will BeCreation of descriptive and diagnostic analytical modelsDesign, maintain and optimize metric visualization dashboard.Combining data from multiple sources to produce meaningful metrics.Drive automation of metric collection and reporting.Identify trends and provide key insights based on the metric data. Minimum Qualifications, Substitutions, Conditions of Employment & Appeal RightsA wide salary range is posted for this position and any job offer is based upon a salary analysis to comply with the Colorado Equal Pay for Equal Work Act. The salary analysis considers relevant experience, education, certifications, and state seniority as compared to others doing substantially similar work. While all offers are compliant with the Colorado Equal Pay for Equal Work Act, there is no guarantee an offer will be at the top of the posted range based on the salary analysis.Minimum QualificationsMinimum of 3 years in a field related to the duties of the role, to include metrics management experience, data modeling, reporting, and dashboards.SubstitutionsAdditional appropriate education will substitute for the required experience on a year-for-year basis, but cannot completely substitute for these qualifications.Training or Certification related to the work assigned to the position will be assigned credit towards substitution for experience and/or education, but cannot completely substitute for these qualifications.If the minimum qualifications include a degree requirement, additional appropriate paid or unpaid experience will substitute for the required education on a year-for-year basis.Preferred QualificationsProficient with tools such as SQL, AWS Quicksight, Tableau, R-serv and PythonAbility to create meaningful reports, data visualizations, and powerpoint presentationsDemonstrated ability to work with diverse datasets and data sources; query data, restructure databases, and understand data integrations.Conditions of Employment:OIT employees must comply with any screening procedures in place at state entity locations where they might be required to perform work.A pre-employment background check will be conducted as part of the selection process.Positions supporting some agencies such as the Department of Corrections and the Department of Public Safety will also require a pre-employment drug test.This position may require travel within the specified geographic area, and to locations across the state as needed.This position may require on-call duties as needed by the position.\n      "
}