{
    "https://www.linkedin.com/jobs/view/research-scientist-center-for-advanced-microscopy-at-the-university-of-texas-health-science-center-at-houston-uthealth-houston-3576422474?refId=Yc9oKMggjifhMXQ5o9i34Q%3D%3D&trackingId=BY1HXGdXG5vZu3zcvshbXA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nResearch Scientist I – Center for Advanced MicroscopyWhat we do here changes the world. UTHealth Houston is Texas’ resource for healthcare education, innovation, scientific discovery, and excellence in patient care. That’s where you come in.We are hiring immediately. This is a full time/exempt position with our Center for Advanced Microscopy team located in the Texas Medical Center!Position SummaryResearch Scientist will participate in a dynamic environment at the Center for Advanced Microscopy, a Nikon Center of Excellence, to assist in daily operations of the University core facility and conduct directed imaging related research. The Center for Advanced Microscopy contains seven state-of-the-art imaging systems, including two dedicated super-resolution microscopes. The successful candidate will work with a wide range of researchers from across the Texas Medical Center and associated medical schools and universities. The applicant should be motivated, have excellent organizational skills, exceptional experimental problem-solving skills, the ability to work well with people and be interested in carrying out independent research and learn new technologies while supporting imaging core operations.Position Key AccountabilitiesImaging Core Responsibilities (50%): Work closely with the Core Director and Staff to manage core imaging systems. Train new users on the use of the microscope systems. Assist users with the execution of their experimental goals, images acquisition and analysis. Consult with users on experimental/protocol design and sample preparation. Perform maintenance and weekly QC testing of microscope systems. Maintain microscope systems and coordinate repairs with vendors. Write and maintain Standard Operating Procedures for all Core imaging systems. Performs other duties as assigned.Independent Research (50%): Develop new microscopy and image analysis techniques in coordination with the Core Director. Generate and develop imaging platforms for super-resolution and live-cell imaging. Plan and perform quantitative and qualitative research. Coordinate with wet lab research team to generate biological samples and conditions. Generate and analyze high quality data for publications, grants, and presentations. Maintain daily work schedule to ensure that all tasks are completed in a timely manner.), PlusOnce you join us you won't want to leave. It’s because we reward our team for the excellent service they provide. Our total rewards package includes the benefits you’d expect from a top healthcare organization (benefits, insurance, etc.100% paid medical premiums for our full-time employees Generous time off (holidays, preventative leave day, both vacation and sick time).The longer you stay, the more vacation you’ll accrue! Longevity Pay (monthly payments after two years of service)Build your future with our awesome retirement/pension plan! We take care of our employees! As a world-renowned institution, our employees’ wellbeing is important to us. We offer work/life services such as...Free financial and legal counselingFree mental health counseling servicesGym membership discounts and access to wellness programsOther employee discounts including entertainment, car rentals, cell phones, etc. Resources for child and elder carePlus many more Certifications/SkillsApplicants are expected to have expertise with advanced optical microscopy and image analysis techniques and be familiar with principles of confocal, multispectral, STORM, and SIM microscopy methods. They will independently operate the microscopes and should understand optics and spectral properties of laser excitation, principles of fluorescent dye conjugation, and be able to design optimal laser/dye and excitation and emission filter combinations.Minimum EducationA Ph.D. degree in biomedical sciences, biophysics, bioengineering, physics, computer science or a related discipline is required.Minimum ExperienceExperience in quantitative microscopy, cell biology and MATLAB programing. Ability to carry out independent research and prepare manuscripts for publication with a demonstrated research productivity through publications. Super-resolution microscopy experience is highly preferred. Two (2) years of experience in a related research environment and have verifiable publications within the field of the research project.Physical RequirementsExerts up to 20 pounds of force occasionally and/or up to 10 pounds constantly and/or a negligible amount constantly to move objects. This position may include work involving potentially hazardous chemical or biological agents.Security SensitiveThis job class may contain positions that are security sensitive and thereby subject to the provisions of Texas Education Code51.215\n"
}