{
    "https://www.linkedin.com/jobs/view/research-scientist-radiative-transfer-secret-clearance-at-devine-consulting-inc-3605921429?refId=V%2B0Jt0k1YbOIObQgTjWTwg%3D%3D&trackingId=qys3CS7FNnF71csqD9VjrQ%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        DeVine provides technical and scientific support to government clients in Oceanography & Atmospheric Science among other technical disciplines.Our company is looking for a Research Scientist to join DeVine in a full time capacity. This position will be supporting a government customer, hence only US Citizens may be considered.DeVine contributes to projects in remote sensing, modeling, and scientific analysis of the Earth’s atmosphere and ocean and land surfaces, as well as astronomy and astrometry. We help our clients test and operate space-based, air-based, subsurface, and land and ocean surface-based sensors. We also collaborate to projects that develop new remote sensing capabilities and new ways of analyzing data.If your experience is relevant to the requirements below, and you'd enjoy working in Washington DC, then please apply!Requirements and preferred experience: M.S. or above in a Physical Science, Engineering, Mathematics, or equivalent degree in related fieldExperience with some combination of the FORTRAN, C, C++, IDL, Matlab, Julia, Python programming languagesExperience in radiative transfer, electromagnetic scattering, transmission, absorption and emission, especially experience in modeling or characterizing the interactions of electromagnetic radiation with atmospheric, geophysical, and man-made features such as smoke plumes, buildings, vegetation, water, and weatherExpertise in modeling or measuring the atmospheric, marine, or astronomical processesExperience with the conceptual design, hardware design, modeling, testing, and operation of systems and components for remote sensingCurrent Secret clearance or higher preferredAbout the position: Position Type: Full-time, Must be U.S. CitizenLocation: Washington, D.C.Benefits: Medical, Dental, Vision, 401k, Life Insurance, Paid Holidays, Paid Sick Leave and Paid VacationCompensation: $120K to $135K per year salary rangeEqual Opportunity Employer We are committed to a policy of assuring that all applicants for employment are recruited, hired and assigned on the basis of qualifications and merit without discrimination based on any protected classification, including, but not limited to, race, color, religion, sex, sexual orientation, national origin, veteran status, age, disability, handicap, marital status, or any other characteristic protected by applicable laws.Powered by JazzHRU1jjvy66wC\n      "
}