{
    "https://www.linkedin.com/jobs/view/data-scientist-ai-ml-drug-discovery-at-peak-technical-staffing-usa-3630907746?refId=wmAmDFeIyij%2F9BKhDRjI8g%3D%3D&trackingId=%2BAzpWVLiz22byHjCwJNiyA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Position: Data Scientist, AI/Client drug discoveryReporting To: Senior Scientist ICore CompetenciesStrong ability to apply scientific principles and critical thinking towards recognizing and solving pertinent problems is essential.Effective communication skills (oral, written, presentation, and data communication skills including but not limited to plotting using python or R).Able to plan and coordinate daily activities to align with department priorities/timelines and efficiently deliver on expectations.Proficient in Python and capable of implementing the common Client algorithms.Proficient in R is a plus.Proficient in Linux bash scripting.Familiar with web-deployment of model is a plus.Hands-on experience on data analysis projects, academic or industrial.End-to-end data science project experience is a plus.ResponsibilitiesPerforms routine data collection, sanity check and data wrangling in the AI/Client drug discovery department to support informatics projects on chemical, formulation, and biological R&D activities.Ensures data integrity, including proper documentation of methods, results, and conclusions in record.Implement, compare, and validate common Client models under supervision within time and budget for multiple cross-functional departments.Develop new method and/or algorithm to delivery informatic solutions to meet the dynamic data structure including but not limited to bioinformatics, cheminformatics, functional genomics, pharmacogenomics.Accurately follows SOPs related to safety, documentation, analytical methods, and corporate policies.Other work as assigned based on the project and company needs.Education and/or Experience:M.S. in data science, machine learning, bioinformatics or cheminformatics or highly related fields.Experience working with pharmaceutical research is a plus.Physical and Other Job Requirements:Office/Lab environment. Lifting up to 50 pounds may be required. While performing the duties of this job, the employee is regularly required to use their hands and fingers to operate a computer keyboard, mouse, and telephone keypad or to write, as well as talk and hear. They are required to stand, walk or sit, reach with hands and arms, stoop, kneel, crouch or crawl. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to focus.This position splits its time between an office and laboratory environment. Lab work may include the use of centrifuges, microscopes, spectrometers and other laboratory tools. Will be required to wear personal protective equipment and comply with all safety regulations in the lab.Software used will include most typical office applications such as word processing and spreadsheets and may include project management and analytical or scientific technology.Disclaimer: The duties and responsibilities of position may change as need arises. The employee will be notified of the change. Relevant work experience may also be substituted for education or certification, at company's discretion.Employment TypeFull-TimeBenefits Offered401K, Dental, Life, Medical, VisionCompensation$50,000 to $130,000 per yearP-OCE-3 \n      "
}