{
    "https://www.linkedin.com/jobs/view/ai-scientist-content-generation-at-jasper-3641788481?refId=Bg0XTo2%2FFkE6hWDWbaTWow%3D%3D&trackingId=DJCjkn6A3NHaasMxfq74fw%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Want to revolutionize Content Creation with AI?Launched in February 2021, Jasper is an AI content platform that helps creators and companies of all types expand their creative potential. Over 105,000 active customers are using Jasper to break through writer's block, repackage their content, create original art, and adjust writing for language and tone. The interest in AI continues to grow and we are at the forefront of teaching the world how to leverage artificial intelligence as a creative partner. We are building teams that will pioneer the content generations space even further.About The RoleAs an AI Scientist at Jasper, you will join a product team (a \"pod\") and adapt the best of global AI breakthroughs into our UI or API products, using you LLM modeling and experimentation skills. You can speak to deep research as well as customer aspirations.Our target market is composed of content creators and marketing leaders at growing companies. We help companies leverage artificial intelligence to accelerate content production and unlock their best ideas. We see AI as a partner to content marketers that can help them break through writer's block, create fine-tuned imagery, and repackage content for different formats, languages and tones.The role is open to candidates located in the US and can be remote within the United States. We have offices in Austin, TX and Salt Lake City, UT with employees based across the US and Australia. We've built a strong foundation to support remote employee engagement with other teams. We have a mix of experience levels and backgrounds, and we're building an environment that celebrates knowledge sharing, mentoring and career growth.What you will do at Jasper:Train, fine-tune, retrieve, adapt, feature engineer with your modeling skills to get the best of NLG AI into our product and to our customers. Integrate new R&D into our production AI engine in interoperable, scaling pieces. Lead as a player-coach, spending time building, coding, testing, but also coaching junior data scientists, research partners, and product managers. You can nerd out with hardcore PhD-holding researchers and then talk design feedback with a product manager or customer. Test hypotheses about how to improve user experience with the models that power our product. Findings may also be used to advise our research partners or product managers on new directions. What you will bring to Jasper:Experience getting AI/ML to value, including NLG and feature engineering. Experience with text, image, and other R&D communities is a plus. (2 years per level)A willingness to be technique, method, and tool agnostic and systematically turn any knob that might improve customer outcomesCommitment to rigorous A/B testing and causal inference, as well as an interest in user experience and behavior, and trust and safetyStrong knowledge of frameworks such as TensorFlow, PyTorch, Keras. Compensation RangeAt Jasper, we believe in pay transparency and are committed to providing our employees and candidates with access to information about our compensation practices. The expected base salary range at offer for this role is $185,000- $220,000. Compensation may vary based on relevant experience, skills, competencies and certifications.Benefits & PerksComprehensive Health, Dental and Vision coverage beginning on first day for our employees and families (Jasper.ai covers 100% of the premium for employees). Unlimited PTO401(k) program with company matching,Monthly wellness reimbursement and flexible time-off to encourage a healthy work-life balanceGenerous budget for home office set up Learning and development opportunities Paid parental leaveTravel perk program Our goal is to be a diverse workforce that is representative at all job levels as we know the more inclusive we are, the better our product will be. We are committed to celebrating and supporting our differences and that diversity is essential to innovation and makes us better able to serve our customers. We hire people of all levels and backgrounds who are excited to learn and develop their skills.We are an equal opportunity employer. Applicants will not be discriminated against because of race, color, creed, sex, sexual orientation, gender identity or expression, age, religion, national origin, citizenship status, disability, ancestry, marital status, veteran status, medical condition or any protected category prohibited by local, state or federal laws.\n      "
}