{
    "https://www.linkedin.com/jobs/view/senior-research-scientist-early-stage-projects-at-x-the-moonshot-factory-3515997555?refId=8xCz52fqjqXynjhu1zxK5g%3D%3D&trackingId=yADq7wtqF10BGWShdkR0HQ%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.About The TeamYou'll join a team at X that provides world-class computational support to the many different projects, ideas and experiments at the Moonshot Factory. You'll work directly with teams across X to share expert machine learning expertise, advice and hands-on implementation -- from early concept through launch and supporting prototyping, experimentation, technical development and more.About The RoleOur engineers help projects run better experiments faster. They co-found projects, provide technical leadership, execute experiments and provide advisory support. As a member of the team, you have a deep passion for problem solving and experimentation. Our engineers often also have a deep domain expertise in fields like physics, computer science, biology, cognitive science. You’ll be expected to: Design and execute experiments that are laser-focused on testable hypotheses and yield real-world impact  Propose and expertly use the right tools for the job from machine learning, optimization, and statistical tools  Balance trade-offs between precision of real-world learnings, robustness, simplicity, and scale.  Master and deploy large-scale Alphabet systems, frameworks for distributed computing, serving, and model training  Engage cross-functionally with leadership, strategy, product, etc.  Be a thoughtful engineer on the key decisions on software architecture, technology roadmap, and execution of the project.  See through projects from conception to finished product, and meet both technical and product needs.  Mentor team members and vendor members. Minimum Qualifications Master's degree in Computer Science, Engineering, Math, Cognitive Science, Linguistics or related field, or equivalent practical experience  8 years of experience in machine learning and data science  Track record of scientific contributions Preferred Qualifications PhD in Computer Science, Engineering, Math, Cognitive Science, Linguistics or related field  Strong publication record with work published in competitive venues (NeurIPS, ICLR, ICML, CogSci)  High level of expertise in machine learning  High level of expertise in data science, Bayesian and frequentist statistics, and experimental design  Domain expertise in language modeling, (self)(un)supervised learning  Deployment expertise with LLMs, Reinforcement Learning, Sequence Learning and Transformers  Willing to work in a fast-paced, start-up-like environment; Fast learner who can think through and adapt to new problems quickly  Strong team player with excellent verbal and written communication skills The US base salary range for this full-time position is $157,000 - $243,000 bonus + equity + benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your location during the hiring process.Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.\n      "
}