{
    "https://www.linkedin.com/jobs/view/data-scientist-senior-at-masego-inc-3638588977?refId=v2ZBzmyIHklGa62gb7v1Kg%3D%3D&trackingId=hBNprXkSOcwfGodGQX5QkQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Masego is looking for a senior-level Data Scientist to join our team.We are an award-winning small business that specializes in GEOINT services. As a Service-Disabled Veteran-Owned Small Business (SDVOSB), we recognize and award your hard work.Title: Data ScientistLocation: NCE or NCWLevel: SeniorJob ID: 20220512221413Clearance: TS/SCI w/ CI PolySchedule (FT/PT): FTDescription Minimum Required Qualifications :7+ years of experience. (bachelor’s degree in a field related to support services may count for up to four years of this experience).Experience with using scripting languages to conduct common data analysis tasks for exploration, conditioning, and advanced analyticsKnowledge of visual programming or object-oriented modeling workflows to automate data acquisitionAbility to manipulate data from multiple structured and unstructured data sourcesAbility to identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems while recognizing the capabilities and limitations of each method.Demonstrated strong writing and oral communication skills. Candidates meeting ALL these requirements and possessing one or more of the following will rank higher for consideration: Experience with Apache Hadoop, HUE, Hive, Pig, Spark, Elasticsearch, Kibana, or TableauKnowledge of programming languages, including Java, Python, R, or SQLExperience with using JEMAExperience with the GEOINT domain including geospatial intelligence or remote sensing, GEOINT databases, including GIMS, BVI, or CRATE, and ABI and multi-INT fusionBachelor’s or Master’s degree in a field relevant to data science, data analytics, and/or data visualization. Security Clearance Requirement :TS/SCI w/ CI PolyAbout MasegoMasego Inc. provides expert Geospatial Intelligence Solutions in addition to Activity Based Intelligence (ABI) and GEOINT instructional services. Masego provides expert-level Geospatial Collection Management, Full Motion Video; Human Geography; Information Technology and Cyber; Technical Writing; and ABI, Agile, and other professional training.Masego is a Service-Disabled Veteran-Owned Small Business headquartered in Fredericksburg, Virginia. With high-level expertise and decades of experience, coupled with proven project management systems and top-notch client support, Masego enhances the performance capabilities of the Department of Defense and the intelligence community. Pay and Benefits We seek to provide and take care of our team members. We currently offer Medical, Dental, Vision, 401k, Generous PTO, and more! Diversity Masego, Inc. is an equal opportunity/equal access/affirmative action employer fully committed to achieving a diverse workforce and complies with all applicable Federal and Virginia State laws, regulations, and executive orders regarding nondiscrimination and affirmative action in its programs and activities. Masego, Inc. does not discriminate on the basis of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran's status.Powered by JazzHRGlaQH3CEex\n      "
}