{
    "https://www.linkedin.com/jobs/view/applied-research-scientist-computer-vision-at-ambient-ai-3630631938?refId=LFYDOOs021L8mHWw1h8ZGQ%3D%3D&trackingId=%2F7a5%2F5aCqVhnCqCOgkkcBw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Ambient.ai is a computer vision intelligence company transforming security operations for large enterprises by preventing security incidents before they happen. Ambient.ai has a globally deployed footprint with several F500 companies. The Ambient.ai platform applies AI and computer vision intelligence to existing sensor and camera infrastructure to deliver physical security monitoring and detect threats in real-time. Ambient.ai does this while simultaneously decreasing false alarms by over 95%, allowing security teams to focus on legitimate threats and on rapid response. The future of enterprise physical security is data-driven, intelligent, and proactive. With Ambient.ai, companies can do more with less, while also improving their security posture.We were founded in 2017 by Shikhar Shrestha and Vikesh Khanna. They are experts in artificial intelligence from Stanford University who previously built iconic products at Apple, Google, Microsoft, and Dropbox. We are a Series-B company backed by Andreessen Horowitz (a16z), SV Angel, YCombinator, and investment angels like Jyoti Bansal, Mark Leslie, and Elad Gil.Named on the YC Top Companies List 2021 and 2022, and the Forbes Cloud 100 Rising Stars 2020, we are turning the impossible into the inevitable. We are always looking for passionate people, who enjoy solving the toughest problems with cutting-edge AI/ML.The impact you'll make:Implement and train deep neural networks to solve a variety of computer vision problems, such as object detection, semantic scene segmentation, human pose estimation, activity recognitionPush the state-of-the-art on standard computer vision tasks with massive proprietary video dataDevelop the infrastructure for training and deploying models, including massive data pipelines, experiment management platforms, visualization toolsImprove runtime efficiency of models for deploymentOwn data assets and annotation effortsThe amazing skills you'll bring to Ambient.ai:BS / MS / PhD in Computer Science / Mathematics or related fieldIdeal experience shipping state-of-the-art deep learning models in production or novel research in computer visionExperience with deep learning concepts, state-of-the-art in computer vision research, and the mathematics of machine learningExperience training a variety of popular deep learning architectures, such as Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs)Proficiency in at least one of the popular computational and deep learning frameworks, such as TensorFlow, Caffe, TheanoProficiency in C/C++ and PythonExperience with high-quality engineering output (side projects, internships, research projects, full-time jobsThe ability and the desire to work in the exciting environment of an early-stage companyWhy join us:We are creating an entirely new category within a 180+ billion-dollar physical security industry and looking for team members who are also passionate about our mission to prevent every security incident possible We have an impressive customer roster of F500 companies, including Adobe, VMware, and LinkedinRegular Full-time employees receive stock options for the opportunity to share ownership in the success of our company Comprehensive health + welfare package (Medical, Dental, Vision, Life, EAP, Legal Services, 401k plan)We offer flexible time off to rest and recharge, including Winter Break (time off between Christmas and New Year’s for most roles depending on customer demand)The latest tech and awesome swag will be delivered to your doorEnjoy a full range of opportunities to connect with your awesome co-workersWe love to hike, are foodies, and love music! Check out our most recent Ambient Spotify Playlist:::::::::::::::We take a market-based approach to pay here at Ambient.ai, and pay may vary depending on multiple factors. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, level, market conditions, and internal parity.Base salary is just one component of our total rewards package. As a fast-growing start-up, our regular employees are also granted stock options, and an opportunity to succeed when Ambient.ai succeeds. As a young start-up with product market fit, our stock upside is substantial, and a large part of our total rewards strategy.The pay scale below represents the starting base salary range we expect to pay for this position, and is subject to change*:SF Bay Area: $116,000 - $155,000From time to time, we may decide to make an offer to a candidate that is either leveled below or above this role based on skills, experience, and interview performance. Ambient.ai is proud to be an Equal Opportunity Employer. Ambient does not unlawfully discriminate on the basis of race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity, gender expression, national origin, ancestry citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, registered domestic partner status, sexual orientation, genetic information, or any other basis protected by local, state, or federal laws. Ambient is an E-Verify participant.\n      "
}