{
    "https://www.linkedin.com/jobs/view/research-scientist-or-senior-research-scientist-speech-audio-at-mitsubishi-electric-research-laboratories-3590311375?refId=QgdxQoEqUE7f3G42%2Fzf2dA%3D%3D&trackingId=xUHETpZpbszsFMM69jj6Qg%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        MERL's Speech & Audio Group is seeking an exceptional researcher in the area of artificial intelligence, with particular focus on and interest in audio, speech, and/or language processing. We are looking for candidates with a strong background and experience in deep learning and other advanced machine learning techniques.Our research focuses on cutting-edge projects for robust acquisition, recognition, and understanding of speech and audio, such as end-to-end speech recognition, speech and sound separation, deep-learning-based microphone array processing, general sound scene understanding, audio-visually grounded NLP, and other forms of multi-modal processing .As a member of our group, you will conduct original research aiming to advance the state-of-the-art in the field , proposing new projects with long-term research goals and taking on a leadership role on some of the group's projects.MERL is one of the most academically-oriented industrial research labs in the world, and the ideal environment to thrive as a leader in the speech and audio field. MERL strongly supports and encourages publishing and presenting research results in top international conferences and peer-reviewed journals, collaborating with university professors and students, and maintaining an influential presence in the academic community, for example by participating in technical committees or organizing workshops and challenges.Qualifications:A Ph.D. from an internationally recognized institution in electrical engineering, applied mathematics, computer science or equivalent. (Current Ph.D. candidates who will soon graduate may apply)Thorough knowledge and expertise in modern speech technologies as well as relevant machine learning and optimization techniques.Strong publication record demonstrating innovative research achievements.Excellent programming skills, particularly in Python and deep learning toolkits.Strong teamwork, communication, listening, writing, and presentation skills.Research Area: Speech & AudioContact: Jonathan Le RouxMitsubishi Electric Research Labs, Inc. \"MERL\" provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, MERL complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.MERL expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of MERL’s employees to perform their job duties may result in discipline up to and including discharge.\n      "
}