{
    "https://www.linkedin.com/jobs/view/open-application-for-scientists-and-research-associates-at-rezo-therapeutics-3575819531?refId=4%2BaNWwGeMOye4MIW1Nxhhw%3D%3D&trackingId=T%2FHKuTTjPesfkj6tezCbaQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Rezo TherapeuticsRezo is a different kind of biopharma company. Our mission is to dramatically increase the success rate of drug development by building a disease-agnostic, fully-integrated, network biology platform that will redefine our understanding of human disease and ability to treat it. Our Founders and members of the Board are a group of esteemed, world-class scientists from the University of California, San Francisco: Nevan Krogan, Kevan Shokat, Sourav Bandyopadhyay, Natalia Jura, as well as renowned biotech executives George Scangos and Norbert Bischofberger. These leaders bring with them a strong track record of amazing discoveries and scientific breakthroughs, leading to very successful companies and many FDA approved drugs.Capitalizing on our Series A of $78M from top-tier investors, we are leveraging a unique integrated approach, combining capabilities in genetics, proteomics, structural biology and AI to generate deep biological insights and novel therapeutic approaches. A list of seminal studies leading to our company's formation, published in the journal Science, can be found here.Located in San Francisco’s vibrant Mission Bay neighborhood, Rezo is in close proximity to UCSF, numerous urban amenities, and outdoor recreational opportunities. We recognize that realizing our mission depends as much on our people as it does on our science and are building a workplace that fosters collaboration, respect, and diversity where contributing to your team’s success is valued as highly as individual achievements. If you’re passionate about team science and breaking down barriers to progress in drug development, please consider joining us!If you do not see a job listing that matches your specific background, please apply to this posting as we will be looking for exceptional individuals in the following areas:ProteomicsDevelop industry scale assays using in-house mass spectrometersExecute platform projects centered on PPI mapping, proximity labeling, post-translational modification and abundance proteomicsSupport drug discovery campaigns and develop target-based screensGeneticsDevelop multimodal single and combinatorial genetic screens using CRISPR technologiesCollaborate with target discovery teams to provide genetic support for targets and drug MOAChemical Biology and Protein SciencesDevelop HTS small molecule screening campaigns and create robust target assays for drug developmentDrive enzymology, biophysics and protein binding analysis effortsHelp build out the structural biology platform (including crystallography & Cryo-EM)Develop chemical biology tools to map ligandable pockets and aid in drug developmentCancer BiologyImplement cutting edge molecular and cellular techniques to determine target functions in cell-based solid tumor modelsDevelop data packages to prioritize targets and nominate candidates to the drug discovery stage Individuals with expertise in oncogene/tumor suppressor pathways and/or drug resistance are especially encouraged to applyComputational Biology, Data ScienceDevelop novel algorithms and apply deep learning-based approaches to network and proteomics datasets Implement cloud infrastructure, pipelines, and UI/UX for data analyticsConduct bioinformatic and statistical analyses of large, multimodal datasetsCompensation at RezoActual starting salary will be determined based on multiple job-related factors including a candidate’s skills, education, and experience, the level at which they are hired, market demand, business needs, and internal parity. All full-time roles are eligible for participation in our Annual Discretionary Bonus Plan (based on individual and company performance) and our Equity Incentive Plan, subject to the terms of those plans and associated policies. All full-time positions are also eligible for the benefits detailed below.Benefits at RezoMedical (HMO or PPO), dental, and vision insuranceDiscretionary time off policyCompany holidays (including summer and winter shutdown)401(k) retirement savings programCommuter / Mass Transit Benefit ProgramHealthcare Flexible Spending Account (FSA)Dependent care Flexible Spending Account (FSA)Parental leaveCompetitive compensationFlexible work scheduleEEOCAt Rezo we value a diverse, equitable, inclusive workplace and provide equal employment opportunity to all persons without regard to race, color, sex, gender identity, gender expression, religion, age, national origin, ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. This statement covers all facets of employment and is especially important when it comes to growing our team.If you are wondering if you’ll belong at Rezo, or are worried that you don’t meet 100% of the qualifications for this role, take a chance on us and yourself — please apply!SF Fair Chance OrdinancePursuant to the San Francisco Fair Chance Ordinance, Rezo considers qualified applicants with arrest and conviction records for employment.COVID-19All Rezo employees are required to be fully vaccinated against COVID-19 and to provide proof of vaccination prior to their first day, with limited exceptions. This policy is grounded in scientific and clinical evidence and has been established with the health and safety of our workplace and community in mind.\n      "
}