{
    "https://www.linkedin.com/jobs/view/ml-ai-specialist-intern-at-stealth-fintech-company-3642021477?refId=1IvN%2B3gwMtVoLlGKu5M6aQ%3D%3D&trackingId=O2WMNo8UobTYeSGb7xdSLA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nOverviewAre you passionate about leveraging the power of machine learning and artificial intelligence to revolutionize the world of venture capital investing? Join our dynamic and ambitious early stage fintech company as a Machine Learning/Artificial Intelligence Specialist. In this role, you will have the opportunity to build and deploy cutting-edge predictive models that will shape investment decisions, optimize portfolio management strategies, and drive our overall performance. Be at the forefront of innovation, work with a cross-functional team of experts, and contribute to the growth of a company poised to transform the fintech industry. If you're ready to make an impact and be part of an exciting journey, apply now and unleash your potential in this thrilling opportunity!Company OverviewTurbine Finance is a Santa Monica based Fintech company bringing liquidity solutions to venture capital and private fund investors. Turbine partners directly with Venture and PE Funds to enable LPs to borrow against appreciated portfolio investments. HNWIs, Family Offices, and Institutional Investors are now able to use leverage tools in the alternative asset class as they always have in public markets and real estate investments.Turbine’s strong founding team has worked together for more than a decade in fintech, venture investing, and venture banking and quickly secured ~$9M from leading institutional investors including Fin Capital, TTV Capital, Alpha Edison, B Capital, Sozo Ventures. Turbine’s lead investor group represents >$10B in AUM which will provide Turbine’s initial lending pipeline.Job BriefWe are an early stage fintech company dedicated to revolutionizing the world of venture capital investing. We are seeking a talented and passionate Machine Learning/Artificial Intelligence Specialist to join our team and develop a cutting-edge predictive model for venture capital outcomes. As a specialist in this field, you will play a crucial role in helping us make data-driven investment decisions, enhance portfolio management strategies, and optimize our overall performance.ResponsibilitiesDevelop and implement state-of-the-art machine learning and artificial intelligence models to predict venture capital outcomes, including success rates, return on investment, and exit strategies.Collect, clean, and preprocess large datasets related to venture capital investments, including historical investment data, market trends, financial indicators, and company-specific information.Collaborate with cross-functional teams, including investment analysts and credit specialists, to gather requirements, define model objectives, and integrate the predictive models into our lending decision-making processes.Utilize statistical techniques and machine learning algorithms to analyze complex data patterns, identify relevant features, and build accurate predictive models.Continuously research and apply the latest advancements in machine learning and artificial intelligence techniques, as well as industry best practices, to ensure the models are state-of-the-art.Evaluate and validate the performance of the developed models using appropriate metrics and statistical methods, and iterate on model improvements based on feedback and results.Present findings, insights, and model outputs to both technical and non-technical stakeholders, effectively communicating the value and implications of the predictive models.Collaborate with the data engineering team to optimize data pipelines and ensure efficient data processing and model training.Maintain documentation of the developed models, including methodologies, assumptions, and limitations, to facilitate transparency and reproducibility.Contribute to the development of a data-driven culture within the company by sharing knowledge, providing mentorship, and promoting the use of machine learning techniques across different departments.Skills RequiredBachelor's degree in computer science, statistics, mathematics, or a related field. Progress towards a master's or Ph.D. degree is preferred.Experience as a Machine Learning Engineer, Data Scientist, or similar role, preferably in the financial or investment industry is a significant plus.Strong knowledge of machine learning techniques, including regression, classification, clustering, and deep learning algorithms.Proficiency in programming languages such as Python, R, or Scala, along with experience using popular machine learning libraries and frameworks (e.g., TensorFlow, PyTorch, scikit-learn).Solid understanding of data preprocessing, feature engineering, and model evaluation techniques.Experience working with large datasets, data manipulation, and database querying languages (e.g., SQL).Familiarity with cloud computing platforms (e.g., AWS, Azure, GCP) and distributed computing frameworks (e.g., Hadoop, Spark) is a plus.Excellent problem-solving skills and the ability to think analytically and critically.Strong communication and presentation skills, with the ability to convey complex concepts to both technical and non-technical audiences.Self-motivated and detail-oriented, with a passion for innovation and a strong desire to contribute to the growth of an early stage fintech company.Join our dynamic and ambitious team, where you will have the opportunity to shape the future of venture capital investing through the power of machine learning and artificial intelligence. Apply today and be part of our journey towards revolutionizing the venture capital industry!Candidates must be eligable to work in the United States. We are not able to sponsor visas at this time.\n      "
}