{
    "https://www.linkedin.com/jobs/view/research-scientist-autonomous-vehicles-new-college-grad-at-nvidia-3641365145?refId=5bk5Dbv1tYRAVEibzZY7VQ%3D%3D&trackingId=Ho4w0L%2BgrOW%2B%2FSvCc2tE0w%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nWe are now recruiting top Research Scientists for Autonomous Vehicles! AI-powered autonomous vehicles that can learn, reason, and interact with people are no longer science fiction. Self-driving cars, autonomous delivery vehicles, and autonomous construction vehicles, among others, are getting increasingly close to widespread deployment. However, fundamental research questions still need to be addressed for us to achieve full vehicle autonomy. For instance, how can we: Remove the traditional barriers among perception, prediction, and planning in order to improve overall system performance? Equip autonomous vehicles with online and offline assurances that meet the standards for safety-critical systems? Ensure that autonomous vehicles work seamlessly in new places?These are some of the exciting questions that the NVIDIA Autonomous Vehicle Research group is tackling. We bring together a diverse, interdisciplinary research team working on core topics in vehicle autonomy, ranging from perception and prediction to planning and control, as well as critical related areas such as decision making under uncertainty, deep learning, reinforcement learning, and the verification and validation of safety-critical AI systems. Our focus is on basic research; lab members are encouraged to publish their work and open-source code. NVIDIA is well known for its team culture, and lab researchers are able to closely interact with others within the company who are experts in perception systems, machine learning, and robotics. There is an opportunity to make a strong impact on products, while having the freedom and bandwidth to conduct ground-breaking publishable research.What You'll Be DoingDesigning and implementing cutting-edge techniques in the field of vehicle autonomy.Publishing your original research.Collaborating with other research team members, a diverse set of internal product teams, and external researchers.Transferring technology you've developed to relevant product groups.What We Need To SeeCompleting or recently completed a PhD in Robotics, Computer Science, Computer Engineering or related field (or equivalent experience).Minimum of 3 years of relevant research experience in the field of vehicle / robot autonomy.Strong knowledge of theory and practice of vehicle / robot autonomy, or a related area with a strong interest in connecting your work to autonomous vehicles.A track record of research excellence with your work published in top conferences and journals such as RSS, ICRA, IJRR, NeurIPS, ICML, CVPR, TAC, etc, and other research artifacts such as software projects.Exceptional programming skills in Python; C++ and parallel programming (e.g., CUDA) are a plus.Knowledge of common machine learning frameworks such as PyTorch and Tensorflow.Strong communication and interpersonal skills are required along with the ability to work in a dynamic, research-focused team.Are you dedicated, upbeat and dynamic with excellent analytical ability? Are you an engineer passionate and highly motivated about solving complex problems? If so, you may be a perfect fit for NVIDIA!The base salary range is $118,400 - $247,250. Your base salary will be determined based on your location, experience, and the pay of employees in similar positions.You will also be eligible for equity and benefits .NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.\n"
}