{
    "https://www.linkedin.com/jobs/view/thin-film-research-scientist-at-azimuth-corporation-3545536085?refId=hqV2hfHh2JLJxUKFhIfwhg%3D%3D&trackingId=uDyVRkSnzTezpxGJ%2FcH1Zw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nPosition SummaryAzimuth seeks a qualified research scientist to carry out R&D at the Materials and Manufacturing Directorate (RX) at the Air Force Research Laboratory (AFRL) located within Wright-Patterson Air Force Base. This research position resides within the Optical Coatings group of the Photonic Materials Branch (RXEP). At the broadest level, optical coatings research within AFRL/RXEP plans, directs, and carries out in-house and extramural R&D of materials-based technologies with an emphasis in functional optical coating applications.ResponsibilitiesResearch responsibilities for this position will focus on the development/fabrication and comprehensive characterization of advanced optical thin film coatings, multilayer coatings, and nano/microfabricated metasurface arrays. The candidate research scientist will conduct experimental fabrication and characterization of emergent optical coating technologies in conjunction with existing in-house machine learning driven optical coating design expertise. Hands-on experience involving physical vapor deposition methodologies is mandatory and complementary nano/microfabrication experience is preferred. Exceptional teamwork and communication skills are required for this position.Basic QualificationsPhD in Physics, Chemistry, Materials Science & Engineering, Chemical Engineering, or closely related science, engineering, or mathematics field.PhD entry level or 0-3 years of professional research experience post PhD.Excellent technical communication skills as demonstrated by research conference presentations and peer-reviewed publications.Ability to be self-motivated, work independently, and seamlessly engage in proficient collaborative teamwork dynamics.Experience with physical vapor deposition such as magnetron sputtering, pulsed laser deposition, e-beam evaporation, or thermal evaporation.Experience with experimental optical characterization of thin films or metasurfaces (e.g., UV/Vis/NIR and FTIR spectrophotometry, polarization-dependent spectrophotometry, temperature-dependent spectrophotometry, spectroscopic ellipsometry, etc.).Experience with compositional, morphological, or topological experimental characterization of thin films or metasurfaces (e.g., XPS, XRD, XRR, AFM, SEM, TEM, etc.).Citizenship: Must be a U.S. Citizen.Clearance: Selected applicants will be subject to a security investigation and will need to meet eligibility requirements for access to a classified environment and information.Preferred QualificationsExperience with magnetron sputtering techniques including DCMS, PDCMS, HiPIMS, and reactive ion sputtering methods thereof.Experience with co-deposition or co-sputtering methodologies involving (but not limited to) oxides, nitrides, or metals.Experience with in situ monitoring or diagnostic techniques during thin film deposition (e.g., ellipsometry, IES, LAXS, RHEED, etc.).Experience with nano/microfabrication such as (but not limited to) photolithography, nanoimprint lithography, e-beam lithography, template lithography, or controlled patterning by selective reactive ion etch chemistries.Experience with direct write lithography methodologies and associated experimental top down nanofabrication workflow procedures.Experience working in a cleanroom environment adhering to cleanroom safety protocols and equipment standard operating procedures.Experience with LabVIEW, MATLAB, Python, or Mathematica and associated scripting languages.Experience deducing structure-property-processing relationships of thin films and optical coating systems through systematic design of experiments.Ability to research, learn, and devise new experimental techniques or technical concepts.Agile problem solving skills.Ability to learn and use Google Workspace (Gmail, Calendar, Google Docs, Sheets, Slides, etc.) as well as Microsoft Office, Microsoft Teams, and all related application tools.Physical Requirements / TravelMust be able to work in a laboratory environment and lift or carry up to 25 lbs.Must be able to work in an office environment at a desk using a computer, keyboard, and mouse.May travel up to 10% of the year to attend research conferences, program reviews, industry meetings, or other collaborative events. Most or all requisite travel will be in the CONUS (Continental United States).Hybrid on-site and local remote telework scheduling options availableAzimuth OverviewAzimuth is an award-winning Woman Owned Small Business specializing in providing research and development and professional services support to the federal government. Azimuth's agility, customer driven approach and our commitment to our employees allows us to meet and exceed our client goals. Excellence, Integrity, Accountability, Community and Humility are the core values of Azimuth as we continue to strive as a recognized leader in the management consulting community that both federal agencies and industry partners value doing business with. We are an organization that offers both our employees and clients an exceptional experience; our culture will be contagious, while always maintaining a genuine reputation.Disclaimer The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job.Azimuth Corporation does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.#cj\n      "
}