{
    "https://www.linkedin.com/jobs/view/staff-applied-research-scientist-at-runway-3641798439?refId=tR7DYllv2POSqPU3QXesXg%3D%3D&trackingId=mIfgr5PJKKgU0Gj2l17KOw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        At Runway, we believe everyone has a story to tell. Our mission is to make professional video and content creation accessible to all. We are taking recent advancements in computer graphics, the web, and machine learning to push the boundaries of creativity and in turn, lower the barriers of content creation; unfastening a new wave of storytelling 🚀Over the last three years, we've raised funding from top-tier investors including Felicis, Coatue, Lux, and Amplify, all with a team small enough to fit at one (growing) table. Our team consists of creative, open minded, caring and entrepreneurial individuals from all walks of life. We aspire to build incredible things which starts with building an incredible team, so we'd love to hear from you! 😄About The Role 🎉We're looking for Staff Applied Research Scientists to help us develop cutting-edge computer vision and generative models to power our creative tools. We are looking for candidates with a strong background building impactful and novel machine learning projects, strong software engineering skills, and who are deeply interested in seeing their research materialize in novel user interfaces for creative tasks.This is a cross-functional team that requires strong communication and collaboration skills; you will have a chance to work with our backend team to help bring your research models to production, and with our design and frontend engineering team to make sure that your machine learning models work in harmony with the user interfaces that interact with them.What you'll do 🎨Develop innovative research projects in computer vision, focusing on generative models for image and video. Build new computer vision pipelines for automating visual effects tasks (such as video segmentation, pinpointing, tracking). Work with a world-class engineering team pushing the boundaries of content creation on the browser. Collaborate closely with the rest of the product organization to bring cutting-edge machine learning models to production. What You'll Need 💻5+ years of relevant engineering or research experience in computer vision and/or graphicsExpertise with programming such as Python, C++, CUDA, and deep learning frameworks such as TensorFlow and PyTorch. Very strong programming skills and ability to write clean and maintainable research codeDeep interest in building human-in-the-loop systems for creativityPassion for seeing research through from initial conception to eventual applicationExperience mentoring and teaching other researchersStrong communication, collaboration, and documentation skillsRunway strives to recruit and retain exceptional talent from diverse backgrounds while ensuring pay equity for our team. Our salary ranges are based on competitive market rates for our size, stage and industry, and salary is just one part of the overall compensation package we provide.There are many factors that go into salary determinations, including relevant experience, skill level and qualifications assessed during the interview process, and maintaining internal equity with peers on the team. The range shared below is a general expectation for the function as posted, but we are also open to considering candidates who may be more or less experienced than outlined in the job description. In this case, we will communicate any updates in the expected salary range.Lastly, the provided range is the expected salary for candidates in the U.S. Outside of those regions, there may be a change in the range, which again, will be communicated to candidates.Salary range: $180,000-$230,000Working at Runway 🥳We are a small and growing team of artists, engineers, researchers, and dreamers working together to reimagine creativity. And we're building a unique team of talented individuals from diverse backgrounds. We believe that this will allow us to continue to up-level each other, our company, and our product. We're looking for people that will add to our culture, not just fit in.We're committed to creating a space where our employees can bring their full selves to work and have equal opportunity to succeed. So regardless of race, gender identity or expression, sexual orientation, religion, origin, ability, age, veteran status, if joining this mission speaks to you, we encourage you to apply!Keep exploring Runway:Our Behaviors and Company MissionRunway raises $50M Series CRunway Research | Runway Graphics | Runway Blog | Runway StudiosWe're excited to be recognized as a best place to work! Crain's | InHerSight | BuiltIn NYC\n      "
}