{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-portfolio-value-creation-at-value-driven-solutions-3623079419?refId=rZIRSXuXKYdQ3engGRsILQ%3D%3D&trackingId=g9wkjZCd0OHt7%2FEpWwdkxQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob DescriptionOur client is looking for a Senior Data Scientist to join the Portfolio Value Creation (PVC) team. Our client partners with global Investment Groups across a portfolio of c. 90 portfolio companies and works out of offices in Toronto, London, Hong Kong, New York, San Francisco, and São Paulo. The firm consists of c. 35 experienced professionals with investment, consulting, technology, and corporate backgrounds.The client is responsible for driving value creation across clients Investments’ global portfolio of material direct equity investments. The team is active across the asset lifecycle with selective pre-deal and consistent post-deal involvement. Examples of the work we do include support complex diligences, onboard new investments into the portfolio, and identify and drive initiatives that improve business performance.The client is also driving a differentiated data-led and technology enabled approach to the private investing process. As part of this, the client has established a data science deployment team (Iris team) that uses analytics practices including machine learning to improve business and investment decision making.Reporting to the Managing Director, Head of Portfolio Value Creation, you will be part of an integrated team of operating, data science and engineering professionals working with portfolio company management teams to help them solve real-world business challenges using a variety of analytical models to generate insights, predictions, or recommendations. While you will spend the majority of your time working with portfolio companies, you will also have the opportunity to work closely with our Investment Groups and internal technical teams to bring data-led approaches across the investing lifecycle, including how we buy, sell and monitor our portfolio companies. The position can be based out of one of three locations San Francisco, New York, or Toronto offices.You will:Join a growing team of data scientists and engineers that aims to bring data & advanced analytics as a key differentiator for our portfolio companies and asset management decisions.Work closely with our portfolio companies to design, prototype and build next generation analytics/data science models and services that will be directly used by core business teams.Define the analytics approaches, collaborating with business partners to develop effective models to mimic business decisions and integrating work into the applications / tools set-up by data engineers.Effectively communicate the analytics approach and how it will meet business objectives.Build repeatable, scalable, and dynamic analytical models that can be seamlessly incorporated into the business decision making process.Contribute to the development of best practices and build differentiated intellectual property for clients Investments (e.g., through analytics libraries and tooling), codifying the best of our project developments.QualificationsCore technical requirements:3-8 years of relevant professional experienceDegree in statistics, computer science, engineering, mathematics, or equivalent experienceTrack record of designing analytics approaches and building applied analytics models; experience applying analytics techniques and delivering measurable impact in a business context is an advantage.Strong knowledge of Python and SQL, with ability to write clean, maintainable, scalable, and robust code in a professional setting. Ability to translate the code into commercial context for non-technical stakeholders in portfolio companies is a strong plus.Proficiency with using machine learning, including use of ML frameworks / libraries, to solve a variety of problems including clustering, time series, classification, regression, simulation, and optimization.Practical knowledge of software engineering concepts and best practices, including testing frameworks and libraries, automation is considered an advantage.Non-technical requirements:Strong business judgement – an ability to translate business challenges to a relevant data science problem and make appropriate trade-offs across speed, accuracy and precision, and impact.Ability to navigate fast moving environments and adjust trajectory as learning.Curiosity and courage in taking on challenging problems across a variety of business areas and/or industries.Solid problem-solving skills with an ability to process complex information, develop hypotheses, and present it clearly and simply.Excellent team collaboration, including experience working cross-functionally across engineering and business partners to develop innovative solutions.Strong communication skills with an ability to explain technical concepts to a wide variety of technical and non-technical stakeholders is a plus.Conduct consistent with our Guiding Principles of Integrity, Partnership and High PerformanceAdditional InformationSenior Associate - The salary range for this position is $185,000 - $220,000 with annual bonus based on performance.Powered by JazzHRg8uhb6syi8\n      "
}