{
    "https://www.linkedin.com/jobs/view/principal-scientist-at-galois-inc-3590305841?refId=2JXZ9skPuHTJV1orIr9vyA%3D%3D&trackingId=CaP7QXvleH87tpO4KtJk8g%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Galois:Galois tackles the hardest problems in computer science. Our mission is to assure trust in critical systems that protect the privacy and integrity of information in the real world. Core to this is the application of formal analysis techniques that allow systems to be modeled, analyzed, and mathematically proven correct to ensure that a system behaves exactly as we intend under all circumstances.We are a community of researchers, engineers, and operations people who are dedicated to creating trustworthiness in critical systems in every functional area of the organization. Our organization is highly collaborative, and we pursue working from first principles, transparency, building deep trust, learning and innovating, and creating space for you to be authentically you. Our unique organizational structure enables us to adapt to the needs of the innovative projects we deliver.We are employee-owned and aspire to provide employees with a sense of freedom to pursue passions in and out of work — whether it be opportunities to learn, career growth, a sense of community, or whatever else brings you value as a person.About This Role:We are hiring Principal Scientists. In this role, you will drive a research agenda and develop R&D opportunities that require engaging with customers. Our aim is to pursue innovative research that helps our clients build safe, reliable, and trustworthy systems..We’re looking for people who can invent, learn, think, and who can inspire both colleagues and clients.We are especially interested in researchers with a proven track record of applying techniques in domains such as (but not limited to): programming language design, type theory, compiler design, static analysis, runtime verification, logical solvers, automated reasoning, interactive theorem proving, program analysis, binary analysis, verification, and cyber-security.Responsibilities:As a Principal Scientist, you will:Develop and lead an externally funded research program involving frequent client and government agency interactions.Collaborate across Galois, academia, government, and industry to advance active research and development programs.Publish and speak on your work, establishing a reputation for thought leadership in your domain of expertise.Competitive candidates for this role will be experienced researchers in their field and have demonstrated success envisioning, designing, and leading significant research programs.We value hands-on experience in the proposal writing process and a deep interest in pursuing programs that connect one’s research interests directly to actual customer needs. Excellent technical writing, verbal communication, and public speaking skills are essential.Key Qualifications:Ph.D. in Computer Science or a related field with a history of high quality academic or industrial research as evidenced by publications, involvement in the research community and/or patent applications.A track record in obtaining external research funding.Passionate curiosity, interest in new ideas and love of learning.Our research engineers work in small teams and successfully interact with clients, partners, and other employees in a highly collaborative environment. Many of them have PhDs in their fields as well. We’re looking for people who can invent, learn, think, inspire these teams, and our clients.The candidate may be subject to a security investigation and will need to meet eligibility requirements for access to classified information.Location:We enjoy a hybrid work environment, and being co-located with one of our offices is preferred - locations in Arlington, VA, Dayton, OH, Minneapolis, MN, and Portland, OR. Potential for remote work is possible.Benefits:We offer a robust benefits package to provide for your and your family’s well-being, including:Employee Stock Ownership Plan (ESOP)401(k) retirement plan with 5% employer match and immediate vestingFully paid medical insurance plans and dental and vision reimbursement planHealth Savings Account (HSA) with generous employer contributionsMental health and wellbeing support through our employee assistance program5 weeks of paid time off and 9 days of paid company holidays each year16 weeks of fully paid parental leave (available for new parents for birth, adoption, and fostering)1 week of fully paid “Blue Sky” innovation time each year to pursue your interestsFor more information on our benefits, visit Careers at Galois.Compensation:Compensation is based on the value of your results, not your value as an employee or person. The compensation process, individual salaries, and criteria for salary changes are transparent to the entire company.For more information about our forward-looking and transparent approach to pay, visit Compensation.Equal Employment Opportunity:Galois is an Equal Opportunity Employer and does not discriminate in employment opportunities or practices based on race, ethnicity, national origin, ancestry, color, sex, gender identity or expression, sexual orientation, marital or parental status, pregnancy or childbirth, disability, age, religion, creed, genetic information, veteran status, or any other characteristic protected by applicable federal, state, or local law. We encourage and respect different viewpoints and experiences as being essential to the process of innovation. We strive to acquire, grow, and maintain a diverse and inclusive workplace that applies principles and standards equitably while supporting the needs and accommodations of the individual employee.Consistent with the Americans with Disabilities Act (ADA) and federal and state laws, it is the policy of Galois, Inc. to provide reasonable accommodation when requested by a qualified applicant or employee with a disability, unless such accommodation would cause an undue hardship. If you require reasonable accommodation in completing the employment application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please contact peopleoperations@galois.com\n      "
}