{
    "https://www.linkedin.com/jobs/view/ai-research-scientist-at-gridmatic-3629395714?refId=JlSMfE%2FSYcR0N%2BoMKYpulA%3D%3D&trackingId=FZKFFT6h5GKKnC4QxBdqRQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Gridmatic Inc. is a high-growth ClimateTech startup based in the San Francisco Bay Area that is accelerating the clean energy transition by applying our expertise in data, machine learning, and energy to power markets. We are the rare startup that has 6 years of profitable growth without raising venture capital. Gridmatic is a great place to work with a culture that values teamwork, continuous learning, diversity, and inclusion. We are environmentally and data-driven, with a growth-oriented mindset and we value integrity as much as excellence.What you might work onDevelop understanding of mathematics and mechanisms of energy markets in order to be able to discover and adapt appropriate methods to solve specific problems. Keep abreast of latest advances in ML research in order to consider if any new methods are especially promising for problems in the electricity market space. Generalize and unify problem frameworks across electricity markets. Design, perform, and analyze experiments for new ML techniques, as well as consult on those tasks for others on the ML teamApplying cutting edge ML techniques to problems in the energy space. Promote probabilistic thinking and rigor in statistical testing across the company. Mentor machine learning engineers on modeling and communication of results (including for publication)Author research papers in the fields of generative modeling / forecasting / decision making under uncertainty. Write, optimize and review code, with attention to performance and readability. You might be a good fit if you:have at least 5 years of experience conducting (basic or applied) ML research. have a strong publication record: NeurIPS, ICLR, ICML; and/or papers on forecasting and generative/probabilistic models in CV/NLP/Speech venues. have earned a PhD in ML, statistics or related quantitative modeling field. have deep knowledge of math, probability, statistics and algorithms. show proven experience researching and implementing relevant machine learning models. are able to write robust code in Python. are familiar with ML frameworks (like PyTorch or TensorFlow) and libraries (like scikit-learn). have outstanding analytical and problem-solving skills. have excellent mentorship, communication, and teamwork skills. have enthusiasm for learning. Knowledge of the energy industry a strong plus. $140,000 - $240,000 a yearFAQWhat’s your policy on remote work?We value the ability to work and collaborate in-person in our early stage as a startup, so Gridmatic has a hybrid policy of \"50% in-office”. Most of the company works in our Cupertino office 2 or 3 days a week.How does the interview process work?We start with 1-2 initial conversations about the role, your past experience, and Gridmatic as a company. We then have a skills assessment which involves a take-home project; if that goes well, you’d come onsite to Cupertino to talk to the team.Join our team and make a difference! Click below or email us at careers@gridmatic.com.\n      "
}