{
    "https://www.linkedin.com/jobs/view/2023-phd-residency-earth-scientist-ai-resident-at-x-the-moonshot-factory-3186856662?refId=nd6xFbDmPCR35lVo75D5kw%3D%3D&trackingId=3aP3L1MY5L0fXMIdEi2arQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        X is Alphabet’s moonshot factory. We are a diverse group of inventors and entrepreneurs who build and launch technologies that aim to improve the lives of millions, even billions, of people. Our goal: 10x impact on the world’s most intractable problems, not just 10% improvement. We approach projects that have the aspiration and riskiness of research with the speed and ambition of a startup.THE FOUNDATION OF AN AMAZING JOURNEYOur goal at X is to make the world a radically better place. In order to do that we seek fresh unexpected perspectives, from different fields, and that’s why we’re excited about you.Life here isn’t easy, but it’s fun. We’re trying to build things most people can’t even imagine, and we’re doing it with the hope of making a huge, positive impact on the world. You’ll be embedded into a moonshot project, where you’ll partner with team members to solve key challenges.This isn’t your ordinary internship. You’ll be positively challenged and pushed professionally, in ways that you may have never experienced. If this excites you - keep reading.During Your Internship You Can Expect To be placed on one of our confidential or public X projects  To get paid competitively and with Google benefits  To be part of a lively community of other Interns and Residents  To addend colloquium and discussions with team leads from across Google, DeepMind and external organizations Details Location: X's headquarters in Mountain View, CA  Start Date(s): Year-round rolling basis  Duration: a flexible 4 mo. to 1 year program based on project team needs and your availability Requirements Must be enrolled in an academic program and working towards completing a PhD degree What You'll Be Working On Collaborating with confidential X Project team to apply advanced ML and geophysics computing techniques to their project's mission Understanding the project’s challenges;  Suggesting a number of ways in which ML and other techniques can apply to those challenges;  Prototyping solutions;  Work closely with team members to implement solutions.  Learning Moonshot thinking, attending colloquium and tech talks.  Engaging with the X Internship community during the program.  Having fun! Minimum Qualifications Must be enrolled in a PhD program focused in Geophysics, Seismology, Machine Learning, Physics, Mathematics or Statistics.  Must be currently doing research at the interface of geophysics/seismology and machine learning.  Completed coursework in geophysics, linear algebra, signal processing, machine learning, or their equivalent.  Strong programming skills in Python. Proficient in Numpy, Scipy, Matplotlib, scikit-learn. Proficient with ML frameworks such as Tensorflow, Keras, JAX.  Experience with machine learning and geophysics algorithms or applications such as: deep learning, computer vision, optimization, denoising, signal processing or time-series analysis. Preferred Qualifications Research experience in one or more following areas: full waveform inversion, elastic wave propagation, distributed acoustic sensing, microseismic.  Projects that demonstrate relevant skills.  Publications in relevant conferences and journals. The US base salary range for this role is between $105,000 - $134,000 + benefits. Your recruiter will share more about the specific salary range for your targeted location during the hiring process.\n      "
}