{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-genomics-at-shape-therapeutics-inc-3641786047?refId=JnHaxKrA6VFXhc4YCokvGQ%3D%3D&trackingId=%2FRSwmWKEZX8shVuEwdrtrg%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Seattle, WAShapeTX® is pioneering the field of programmable RNA medicines to repair the genetic causes of diseases. By merging innovations in AI and RNA technology to generate and analyze hundreds of billions of therapeutic possibilities, ShapeTX is developing breakthroughs in RNA editing, next-generation AAVs, and disruptive gene therapy manufacturing. The ShapeTX platform enables pharma innovators to design treatments across a wide range of diseases, including rare genetic disorders as well as debilitating conditions, such as Alzheimer's, Parkinson's, and many more. You can find us at shapetx.com and on LinkedIn and Twitter.At ShapeTX, we are a dynamic team of professionals who are dedicated and passionate about making cures a reality. Through diversity of thought, scientific knowledge, professional rigor and focus we are merging cutting-edge science with extensive drug development expertise to unlock cures to many debilitating diseases.Shape Therapeutics is headquartered in Seattle, Washington with a satellite site in Boston, Massachusetts.We are looking for a talented and motivated individual with a strong background in data science, Next-Generation Sequencing (NGS), and generative artificial intelligence (AI) to join the fast-growing Analytics and Informatics team as a Machine Learning Scientist, Genomics. We are dedicated to applying generative AI to revolutionize how gene editing, delivery, expression, and manufacturing are done for gene therapy. We believe in the power of diverse perspectives to drive innovation in gene therapy and are committed to creating an environment where integrity, patient impact, and personal growth are valued. We welcome individuals from all backgrounds who possess experience in data science, software engineering, and machine learning. As a Machine Learning Scientist at ShapeTX, you will develop and apply novel statistical learning techniques across a range of molecular and NGS datasets to further revolutionize our gene editing, delivery, expression, and manufacturing methods. You will have the unique opportunity to refine statistical and deep learning techniques, advancing novel gene therapies that address serious human genetic diseases.Roles and Responsibilities:Design and implement statistical and machine learning (ML) analyses, including generative models, to rigorously test biological hypotheses in gene editing, delivery, and complex disease. Collaborate with experimentalists to understand data structure and incorporate appropriate methodologies to ensure accuracy and facilitate decision-making. Cross-compare diverse analytical strategies using quality control metrics to troubleshoot and optimize computational workflows for disparate data types. Write and maintain clearly documented code, collaborating effectively for further optimization. Operationalize deployment of validated, predictive models to inform experimental design and therapeutic prioritization. Qualifications and Requirements:Doctorate, or Master's degree with over six years of experience, in ML, Statistics, Genomics, Computer Science, Data Science, or a related discipline. Ability to work both independently and collaboratively in a diverse team-science environment. Aptitude for tackling challenges with a problem-solving, can-do attitude. Skills and Experience:Passion for building tools and executing strategies that optimally leverage novel data types to address biological hypotheses through statistical inference and ML. Initiative to identify, develop, and optimize innovative ML approaches for predictive models for therapeutic sequence design. Demonstrated proficiency in programming languages (Python, Bash, R) and common data science tools (pandas, tidyverse, scikit-learn). Fluency with at least one deep learning framework for neural network inference (e.g. PyTorch / PyTorch Lightning, TensorFlow / Keras). Familiarity with generative ML techniques and their application in genomics research. Experience with statistical modeling and inference using large, biological datasets and NGS. Experience with cloud-based services (e.g. AWS) and version control systems (e.g. Git). Capacity to manage multiple projects involving different data types and structures simultaneously. Intellectual curiosity, attention to detail, strong organizational skills, proactive communication, and a team-player mindset. Experience in molecular biology, NGS experimental protocols, or high-throughput screening is a plus; as is knowledge of protein biology, RNA biology, neurobiology, or genetic diseases. If the notion of analyzing novel NGS and molecular datasets towards providing an end-to-end gene therapy solution for millions suffering worldwide from rare genetic disorders motivates you like it does us, we're very excited to have you join us!ShapeTX offers a robust benefits package, including but not limited to: Medical, Dental and Vision coverage for employees and their eligible dependents. We provide eligible employees with 12 paid Holidays plus a one week winter break at year end. We are proud to offer a competitive paid parental leave benefit, an annual employee stipend for employees to use however they choose, a Flex Paid Time Off program (allowing flexible PTO for vacation, sick leave, and other purposes) and Company paid Long Term Disability. Employees are eligible to enroll in our Company's voluntary 401k plan, voluntary Life/AD&D and Voluntary FSA's.The salary range for this role is $120,000 - $200,000. The hired applicant's placement within the range is based on qualifications and professional experience. Additional compensation may include annual target bonus and/or sign-on bonus, equity grant and relocation bonus.We aspire to Shape Life! not only through our science, but also through our commitment to foster an inclusive environment that supports diverse perspectives and experiences.\n      "
}