{
    "https://www.linkedin.com/jobs/view/scientist-generative-ai-ml-us-remote-at-biospace-3642989029?refId=cWId%2FWzN8MVod1j6rT5%2FCQ%3D%3D&trackingId=RKr6lRxcElXrAD4%2FrXcvfQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nHOW MIGHT YOU DEFY IMAGINATION?Youve worked hard to become the professional you are today and are now ready to take the next step in your career. How will you put your skills, experience and passion to work toward your goals? At Amgen, our shared missionto serve patientsdrives all that we do. It is key to our becoming one of the worlds leading biotechnology companies, reaching over 10 million patients worldwide. Come do your best work alongside other innovative, driven professionals in this meaningful role.Scientist - Generative AI/MLLiveWhat You Will DoLets do this. Lets change the world. We are actively seeking a highly qualified and motivated Scientist with a strong background in Generative AI/ML. The scientist will join the Bioinformatics Technology team within Amgens Center for Research Acceleration by Digital Innovation (CRADI). CRADI is a multi-disciplinary effort embedded within our drug discovery engine that continually uses advancement in digital technologies for disease modeling and digital modality engineering to accelerate our pipeline from target inception through drug development. Bioinformatics Technologies plays a pivotal role within CRADIs Computational Biology and Bioinformatics function, establishing an innovation engine for deploying and exploiting emerging digital technologies in the field of computational biology.RNA therapeutics comprise a rapidly expanding class of modalities that will fast-track solutions to the clinic. In this vital role you will lead the development and implementation of AI/ML models and optimization paradigms for the design of best-in-class RNA therapeutics. This position will involve close collaborative relationships with scientists within RNA therapeutic research, safety sciences, and therapeutic areas as well as data scientists and engineering partners across Amgen R&D. An ability to communicate clearly and collaborate effectively with colleagues from different fields will be essential.The successful candidate will possess strong analytical proficiency, have a high degree of technical competency in computational sciences with a deep theoretical understanding of machine learning paired with excellent understanding of RNA biology proven by a strong track record of innovative and collaborative research published through peer-reviewed publications.ResponsibilitiesEngage in collaborative efforts with stakeholders and subject matter experts to formulate technical solutions accelerating the development and increasing clinical efficacy of RNA therapeutic modalitiesFind opportunities, set strategy, and deliver appropriate quantitative methods, such as discriminative and generative AI/ML models, to push the state of the art for optimizing RNA therapeutic modality design, formulation, and deliveryConsult on data generation and translate experimental findings into computational model design and refinementServe as subject matter expert on the intersection of computer science and RNA biologyClearly document methods and analyses to allow reproducible researchCollaborate with engineers and data scientists to develop innovative bioinformatics tools that facilitate data access, model utilization, and output interpretationCommunicate project results and data-driven recommendations to stakeholders and cross-functional partnersMonitor, review, and critically interpret published computational research spanning RNA therapeutics and emerging oligonucleotide modalitiesProactively scope and deploy novel computational methods and digital technologiesWinWhat We Expect Of YouWe are all different, yet we all use our unique contributions to serve patients. The dynamic professional we seek is a scientist with these qualifications.Basic QualificationsDoctorate degreeOrMasters degree and 4 years of computational biology, bioinformatics, biomedical data science or related fieldOrBachelors degree and 6 years of computational biology, bioinformatics, biomedical data science or related fieldPreferred QualificationsPhD in computer science, data science, computational biology or bioinformatics including industry experienceDeep experience in and theoretical understanding of statistical modeling, machine learning, deep learning, and other relevant quantitative methodsKnowledge in RNA biology, particularly RNA structure and functionFluency in scientific programming and tool development with R, Python, or equivalents. Proficiency in C++ or Java is a plus.Proven record of innovative thinking to propose and champion the development of novel algorithms and AI/ML models that generated interpretable and actionable results for practical applicationsExperience with software development good practices, including code versioning, documentation, and testing, amongst othersExperience with cloud computingCreative, open-minded, and passionate about scientific researchDemonstrated ability to thrive in a team environmentStrong interpersonal, collaborative, organizational, and presentation skillsUnderstanding of RNA therapeutic modality discovery and development is a plusThriveWhat You Can Expect Of UsAs we work to develop treatments that take care of others, we also work to care for our teammates professional and personal growth and well-being.The annual base salary range for this opportunity in the U.S. is $135,563 - $150,625.In Addition To The Base Salary, Amgen Offers a Total Rewards Plan Comprising Health And Welfare Plans For Staff And Eligible Dependents, Financial Plans With Opportunities To Save Towards Retirement Or Other Goals, Work/life Balance, And Career Development Opportunities IncludingComprehensive employee benefits package, including a Retirement and Savings Plan with generous company contributions, group medical, dental and vision coverage, life and disability insurance, and flexible spending accounts.A discretionary annual bonus program, or for field sales representatives, a sales-based incentive planStock-based long-term incentivesAward-winning time-off plans and bi-annual company-wide shutdownsFlexible work models, including remote work arrangements, where possibleApply nowfor a career that defies imaginationObjects in your future are closer than they appear. Join us.careers.amgen.comJoin UsIf you're seeking a career where you can truly make a difference in the lives of others, a career where you can work at the absolute forefront of biotechnology with the top minds in the field, you'll find it at Amgen.Amgen, a biotechnology pioneer, discovers, develops and delivers innovative human therapeutics. Our medicines have helped millions of patients in the fight against cancers, kidney disease, rheumatoid arthritis and other serious illnesses.As an organization dedicated to improving the quality of life for people around the world, Amgen fosters an inclusive environment of diverse, ethical, committed and highly accomplished people who respect each other but compete intensely to win. Together, we live the Amgen values as we continue advancing science to serve patients.Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n      "
}