{
    "https://www.linkedin.com/jobs/view/cheminformatics-scientist-at-the-fountain-group-3638270217?refId=QEA3IQ9CwfF2TYBxEVF3yg%3D%3D&trackingId=0q6NOCa53KVEw%2BnfV0ALsA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        DetailsPay for this position is 70.00 to 90.00 hourly depending on experienceThis position is a 5 month contract with the possibility for extension or conversion to permanent. ResponsibilitiesDevelop, integrate, and apply cheminformatics/computational tools and workflows to improve existing infrastructure and acquire or create needed ones Provide informatics and cheminformatics support to the functions within Chemical Sciences, drug discovery projects and new target development initiatives. Build and maintain infrastructure/data workflows to facilitate mining and integrating data from internal and external databasesDesign and apply state-of-the-art machine learning and cheminformatics algorithms for molecule generation, scoring and selection Collaborate closely with the computational chemistry group and other cross-functional teams including Research IT, MedChem, BioChem, Compound Management, etc.Communicate scientific results internally and externally via presentations and publications QualificationsA PhD with 1+ years OR Master’s degree with 4+ years post-graduate experience (industry preferred) in cheminformatics, computational chemistry, computer/data science, or related fields. Pay rate commensurate with experience.Strong hands-on experience with one or more programming, scripting, or querying languages (e.g. Python, R, Java, SQL/NoSQL, etc) and cheminformatics toolkits (such as RDKit, ChemAxon, DeepChem, OEChem, etc)Technical expertise in developing cheminformatics protocols using workflow tools - experience with KNIME and Schrödinger eco-system of computational software preferredWorking experience with machine learning and deep learning architectures such as PyTorch, TensorFlow, Keras, Scikit-Learn is a plusA basic knowledge of drug discovery processes, medicinal chemistry, chemical biology and DMPK is encouraged\n"
}