{
    "https://www.linkedin.com/jobs/view/research-data-scientist-at-swayable-3613049246?refId=S%2BAFHO4eD54QXqXRPutdZQ%3D%3D&trackingId=1lCMf6F3igQbACXrIQs2ew%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Swayable is a fast-growing cloud analytics product that measures public opinion and the impact of messages and advertising content on it. Its 35-person team is backed by top technology and social impact investors, including Y Combinator. Founded in 2018 by two physics PhDs, it is led by the former Executive Director for Digital Strategy at the New York Times. Clients include major consumer-facing brands (Square, Paramount Pictures, Amazon), researchers (MIT, Yale, Stanford), and mission-aligned advocacy campaigns (including multiple Democratic Presidential candidates and winning Midterm campaigns).Joining Swayable means being on a team whose work changes the course of history. The technology we develop is at the leading edge of transforming some of the world’s most important campaign organizations and enterprises: combatting disinformation, protecting democracy, and supporting the sustainable growth of consumer-facing brands.This is a uniquely exciting opportunity to tackle critical unsolved problems in public opinion research and causal modeling. As a Research Data Scientist (reporting to the Director of Data Science), you’ll have the infrastructure and talent around you to turn results into new discoveries, prototypes and features that deliver insights to the world's most important organizations.Responsibilities (what You Will Be Doing)Conduct data science research to push our experimental methodologies to the bleeding edge of social scienceDevelop robust tools to uncover insights in experimental data Prototype data science improvements to core platform featuresCommunicate the results of data science investigations to both internal and external stakeholdersRequirements (what you will need to succeed)PhD in data science, computer science, statistics, or natural scienceDemonstrated ability to communicate clearly and draw implications from dataFluency in the python data science stackExpertise in statistical, analytical, and data science methodsExcellent communication and data visualization skillsAbility to work independently, prioritizing multiple important tasks/deadlinesA keen eye for the 20% of effort that delivers 80% of the resultsBeing a flexible team player whose values align with oursPreferred qualifications (what will help you succeed)Experience writing and reviewing production-quality python codeExperience working in a fast-moving startup environmentExperience interacting with MongoDB databasesSome industry/startup experience preferredOur team is centered in NYC and SF, with flexible work arrangements for remote work.We offer a benefits package that is well above-market. Swayable covers 100% of the health, dental, and vision insurance premiums for full-time employees. We also offer generous PTO, parental leave, equity, 401k, FSA, and an ongoing professional development stipend.We are an equal opportunity employer. We strive to promote an organizational environment that values diversity and fosters growth. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other basis prohibited by law. The team especially encourages applicants from underrepresented backgrounds.\n      "
}