{
    "https://www.linkedin.com/jobs/view/lead-research-scientist-at-nobleai-3638522584?refId=uQrhjwk6uuvQd6lb4if1Gw%3D%3D&trackingId=T323rBz6NKEMtI8KIAEhRA%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        At NobleAI, we believe that material science and chemistry are key to building a sustainable world and that artificial intelligence is essential to unlock this potential. NobleAI uses our innovative and unique Science-Based AI technology to transform current materials development strategies. We deliver actionable insights and reliable predictions to accelerate development and reduce costs of developing new chemicals, materials, and formulations.We see ourselves as a team of individuals striving to be excellent in everything we do. We value people who are thoughtful and respectful, while relentlessly focused on building and delivering products which help delight our customers and empower engineers and researchers to bring better products and services into the world faster.As a Lead Research Scientist, this role is responsible for carrying out research and developing mathematical algorithms which deliver value to our R&D customers. As a Lead Research Scientist, you will work on customer or industry-specific problem domains, and data sets, leveraging Noble Artificial Intelligence Platform features and products and collaborating with other Research Scientists and Machine Learning Engineers on developing new mathematical modeling techniques to solve customer needs.RequirementsKey ResponsibilitiesCarrying out world-class research oriented to improving NobleAI’s core AI technologyWorking on customer or industry specific problem domains and data sets, leveraging NobleAI Platform features and products and/or collaborating with research scientists on new modeling techniques to solve the customer needs.Working with and leading engineers and data scientists to integrate research advances into NobleAI products Collaborating with engagement success teams to accurately communicate technical aspects of solutions provided to customers through the NobleAI platform.Adapting cutting edge machine learning research to science and R&D applications and making scholarly contributions through research publications and patentsMission oriented: you’re a face of the company and carry the NobleAI flag forwardBias towards action: you appreciate the many needs of a early-stage startup, and match or exceed the dedication of those around you Team player: you’re committed to excellence, and naturally know how to bring out the best in others, you earn the trust of your colleagues to deliver on-time at high qualityWhat we're looking forPhD. in Computer Science, Mathematics, Statistics, Physics, Chemistry, Biology or other quantitative disciplineAt least 3 years of industry experienceStrong background in machine learning: classical and deep learning techniques (examples may include CNNs, transformers, or embedding techniques, etc.), focus on supervised learningStrong experience in Python and associated ML frameworks (Tensorflow, Keras, PyTorch, sklearn, etc.)Demonstrated ability to effectively communicate complex technical details at a high levelExperience in either Natural Language Processing, Computer Vision, or unsupervised learning approaches are all plusses!Experience with either cloud or distributed training frameworks (AWS, GCP etc.) is a plus!Experience working in Artificial Intelligence is a big plus!BenefitsDid we mention we offer great pay & benefits?  Top notch Medical, Dental & Vision Insurance plans Company-paid Life, Short-Term Disability & Long-Term Disability Insurance Generous Paid Time Off & Holidays401(k) with employer match Equity PackageSalary Range $190k - $220k (Depending on experience & Geographic location) + Performance Based Bonus Plan\n"
}