{
    "https://www.linkedin.com/jobs/view/associate-principal-scientist-cancer-biology-at-atomwise-3641780273?refId=7L7g5%2BN%2F6%2BUN7ns9wp4H%2Bg%3D%3D&trackingId=mEXuejqL8CYNbdV26BkNLA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nCompany OverviewAtomwise is revolutionizing how drugs are discovered with AI. The Company invented the use of deep learning for structure-based drug discovery and is developing a pipeline of small-molecule drug candidates advancing into preclinical studies. The AtomNet® technology has been used to unlock more undruggable targets than any other AI drug discovery platform. Atomwise is tackling over 600 unique disease targets across 775 collaborations spanning more than 250 partners around the world. The Atomwise portfolio of joint ventures and partnerships with leading pharmaceutical, agrochemical, and emerging biotechnology companies represents a collective deal value approaching $7 billion.To date, Atomwise has raised over $174 million from leading venture capital firms to advance its mission to make better medicines, faster.To support its mission, further its progress in enterprise building and leverage its robust discovery engine, Atomwise is building biology and pharmacology capabilities to fully leverage its small molecule AI expertise to advance molecules for clinical development. You will work closely with Atomwise interdisciplinary teams to provide guidance on pharmacology strategy, clinical indications of interest, and other aspects of drug development.Role SummaryAtomwise is recruiting an experienced cancer biologist to support the internal oncology drug discovery portfolio into early-stage and late-stage development programs with a goal to design and oversee preclinical studies that will allow the robust evaluation of oncology targets and small molecule candidates. You will provide strategic and technical leadership to the teams supporting oncology drug discovery projects from target discovery through IND-enabling studies.This role requires excellent communication skills, in-depth knowledge of preclinical cancer biology/pharmacology, and ability to design translational studies to support future clinical activities. You will work effectively with an interdisciplinary team of computational and medicinal chemists, biologists, cheminformaticians, software engineers, CROs, and program managers to define, build, and optimize our preclinical oncology programs.Key ResponsibilitiesLead and collaborate with project teams to develop in vitro pharmacology strategies and support Atomwise preclinical oncology programs. Direct the selection, validation, and analysis of quantitative biophysical, biochemical, and cellular assays to evaluate binding and function of Atomwise molecules across diverse target classes and relevant oncology signaling pathways leveraging CRO partners. Participate in the evaluation and selection of new Atomwise oncology targets/indications and develop pharmacology criteria for continued advancement of lead molecules and development candidates. Develop pharmacology criteria for the advancement of early discovery oncology programs from hit identification to lead optimization including key milestones/decision points and timelines, identifying risks and mitigation strategies, and study planning and execution. Required QualificationsPh.D. in cancer biology, pharmacology, cell biology, related scientific discipline plus 6+ years of relevant industry experience in oncology. Extensive hands-on experience building quantitative in vitro assays (biochemical and cellular) and expertise with in vivo pharmacology models in an oncology drug discovery setting. Demonstrated success in the management of CROs, including evaluation/selection, setting up processes, and quality control. Experience collaborating with medicinal chemists and project teams to build effective critical paths to drive structure-activity relationships (SAR) and selection of high quality chemical series to support oncology programs. Demonstrated track record of clear communication, working with a multidisciplinary team, mentoring, and developing talent. Compensation & BenefitsCompetitive salary, commensurate with experienceStock compensation plan – you'll be an Atomwise co-ownerPlatinum health, dental, and vision benefits for you and your dependents401(k) retirement plan with generous company match (up to 4%)Flexible paid time off (PTO), 13 paid holidays, and wellness breaks for employees to spend time with their loved ones and rechargeHealth Savings and Flexible Spending Account options to help save money on healthcare, daycare, and commutingEmployee Assistance Program (EAP) and Pet InsuranceFunding for professional development and conference attendanceFlexible work scheduleGenerous paid parental leaveHigh performance cultureGreat colleaguesAtomwise is an equal opportunity employer and strives to foster an inclusive workplace. Our mission is to develop better medicines faster, and we know that we need a diverse team to develop medicines that serve diverse populations. Accordingly, Atomwise does not make any employment decisions (including but not limited to, hiring, compensation, and promotions) on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, veteran status, disability status, or any other characteristics protected by applicable federal, state, and local law.We strongly encourage people of diverse backgrounds and perspectives to apply.Pay range for this role is between $164,400- $170,000*\n"
}