{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-2022-0124-at-acclaim-technical-services-3630747689?refId=yRsnGJaf%2FYrllgG2Dvq0Rw%3D%3D&trackingId=PL6cTUuoTQHtqiG3E0qjew%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Acclaim Technical Services, founded in 2000, is a leading language and intelligence services company supporting a wide range of U.S. Federal agencies. We are an Employee Stock Ownership Plan (ESOP) company, which is uncommon within our business sector. We see this as a significant strength, and it shows: ATS is consistently ranked as a top workplace among DC area firms and continues to grow.We are actively hiring a Data Scientist to join our Department of Homeland Security Division working in McLean, VA. The Data Scientist will contribute to building new analytical tools and packages across the enterprise and will be expected to collaborate with team members in a highly technical environment. In this role you will support a fast-paced and growing data science team working on projects critical to National Security.ResponsibilitiesThe Data Scientist will be expected to build statistical models, test hypotheses, interpret, summarize, visualize, and succinctly report on data findings.The Data Scientist will perform research on various data sources, to include unstructured data using quantitative and qualitative content analytics.The Data Scientist will construct and perform complex database search queries in multiple databases using SQL and API interfaces.The Scientist will perform web scraping and apply various techniques for processing unstructured data. Scientist will leverage automation and machine learning to manage data, predict scenarios and make recommendations.The Data Scientist will contribute to building new analytical tools and packages across the enterprise and will be expected to collaborate with team members in a highly technical environment.The Data Scientist will be expected to learn and leverage emerging technologies including AWS and Git.Required Education & Experience Bachelor’s degree in a highly quantitative subject or related field ( for example, statistics, mathematics, economics, or related field) In order to qualify as a Journeyman, candidates are required to have a BS degree + a minimum of 3 years of applicable work experience. In order to qualify as a Senior, candidates are required to have a BS degree + 18 years of applicable experience OR a Master’s degree + 10 years of applicable experience TS/SCI clearance with polygraph required Strong experience working with Python or R programming languages Experience working with data manipulation, analytic/business insight tools, and data visualization experience Experience with SciPy stack or Tidyverse packages Experience constructing and performing complex database search queries Experience/ knowledge of computer science concepts, data architecture, and experience/knowledge of statistics Demonstrated experience using statistical and machine learning techniques including supervised and unsupervised learning and natural language processing Experience /familiarity with frequentist statistics and probability including predicative modelingEqual Employment Opportunity / Affirmative ActionATS is committed to a program of equal employment opportunity without regard to race, color, ethnicity, national origin, ancestry, citizenship, sex, pregnancy, marital status, sexual orientation, gender identity, age, religion/creed, hairstyles and hair textures, handicap/disability, genetic information/history, military/veteran status, or any other characteristic or condition protected by federal, state or local law. It is the policy of ATS not merely to refrain from employment discrimination as required by the various federal, state, and local enactments, but to take positive affirmative action to realize for women, people of color, individuals with disabilities and protected veterans full equal employment opportunity. We support the employment and advancement in employment of individuals with disabilities and of protected veterans, and we treat qualified individuals without discrimination on the basis of their physical or mental disability or veteran status.Powered by JazzHRFNtq7kGkDo\n      "
}