{
    "https://www.linkedin.com/jobs/view/senior-principal-ai-research-scientist-at-biomap-3641794656?refId=gUgeNL4WNyeNvyGuCGyb%2Fw%3D%3D&trackingId=i0rQKtu4qi7X%2BeVZFhFj5g%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        BioMap is a platform company that integrates AI technology with cutting-edge biotechnology. We are committed to achieving breakthroughs in target discovery and drug design, and bringing global first-in-class medicine for unmet medical needs in the areas of immune-oncology, autoimmune diseases, fibrosis, and aging-related diseases.Location: Menlo Park. This role is preferably based in The Bay Area, but we are open to discussing other locations in the United States.Keywords: design deep learning algorithms, protein design, equivariant graph neural network, large pre-trained language models, generative modelsYou will:Design and apply deep learning algorithms in protein designTransform research, open-source models, and prototypes into the production-level pipelineDesign and apply innovative computational/ statistical algorithms (including classic, statistical, ML, and AI techniques) to generate actionable biological insightLead the machine learning team to build and deploy the AI models at scaleRequirements:Master's or Ph.D. degree in computer science, AI, bioinformatics, statistics, or related fields4+ years of hands-on experience in software development, machine learning, and/ or bioinformatics software development and researchTrack record of collaborative research, making co-author level contributions to peer-reviewed publications in machine learning, is highly preferredDeeply involved or meaningfully contribute to high-impact, open-source projects on platforms, such as GitHubFamiliar with equivariant graph neural network, large pre-trained language models, generative models, and other algorithmsGreat communication skills, including code documentation, oral presentation, with excellent cross-functional collaborationWhat we offer:The opportunity to work on high-impact tools and products that are immediately deployed to accelerate the discovery of new medicinesA strong team in AI, software, and biochemistryCompetitive salary and equity401(k) plan with generous employer matching for contributionsExcellent medical, dental, and vision coverageDaily lunch and a full snack stationCommuter benefitsBioMap is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n      "
}