{
    "https://www.linkedin.com/jobs/view/scientist-i-computational-protein-generation-at-generate-biomedicines-3593582006?refId=9yvKwGAlH%2FDY36gq0C5QYQ%3D%3D&trackingId=ZQV9DAC0C9Zupie9KWnoGQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Generate BiomedicinesGenerate Biomedicines is a new kind of therapeutics company – existing at the intersection of machine learning, biological engineering, and medicine – pioneering Generative Biology™ to create breakthrough medicines where novel therapeutics are computationally generated, instead of being discovered. Generate has built a machine learning-powered biomedicines platform with the potential to generate new drugs across a wide range of biologic modalities. This platform represents a potentially fundamental shift in what is possible in the field of biotherapeutic development.We pursue this audacious vision because we believe in the unique and revolutionary power of generative biology to radically transform the lives of billions, with an outsized opportunity for patients in need. We are seeking collaborative, relentless problem solvers that share our passion for impact to join us!Generate was founded in 2018 by Flagship Pioneering and has received over $420 million in funding, providing the resources to rapidly scale the organization. The Company has offices in Somerville and Andover, Massachusetts with over 250 employees.The Role: We are seeking a creative, motivated Computational Scientist with a strong background in Protein Design. The ideal candidate would have demonstrated extensive expertise in computational protein design that goes beyond mastery of existing tools and methods, with strong intuitions about what is lacking in current approaches and an urge to fundamentally change existing paradigms. Exposure to deep machine learning techniques in the context of protein design is a strong preference.The successful candidate will work with the Machine Learning, Protein Sciences and Preclinical Discovery and Development groups at Generate to develop, analyze and apply protein design protocols toward specific design objectives, incorporating both existing and new methods and models. The role will involve building protein-generation algorithms, validating them using in-house and external data, designing novel proteins, and working closely with experimental scientists in a tightly integrated design-build-test-learn cycle with the opportunity to design agents that can fundamentally impact the lives of future patients.Here's how you will contribute:Develop, validate, and productionize protein generation protocols, optimization algorithms, and other numerical techniques, and hone them through direct deployment on our experimental platform. Use our integrated data platform to devise generation methods that leverage measured data “in-the-loop\". Work cross-functionally with Machine Learning, Protein Sciences and Preclinical Discovery and Development groups to design proteins tailored for specific therapeutic programs. Advance and evaluate the state of the art for understanding the relationship between protein sequence, structure, and function - including but not limited to protein sequence design, structure prediction, complex prediction, and optimization of functionReview literature and work closely with biologists to deeply understand biological domain and assay characteristics. Analyze computational and experimental data to assess and refine generation algorithms. Develop production-ready code in a team setting and present progress from scientific work in regular research meetings. The Ideal Candidate will have:PhD in Computational Biology, Computer Science or a related field with demonstrated experience working on protein-related applications.  3+ years of experience with applying computational and/or ML methods to problems related to protein design, modeling, or prediction, especially in relation to structure-based techniques.  A strong understanding of protein biophysics and structure. Generate Biomedicines is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.COVID Safety:Generate Biomedicines enforces a mandatory vaccination policy for COVID-19. All employees must be fully vaccinated and have received a booster. The purpose of this policy is to safeguard the health of our employees, their families, and the community at large from infectious disease that may be reduced by vaccinations. The company will make exceptions to this policy if required by applicable law and will consider requests for an exemption from this policy due to a medical reason, or because of a sincerely held religious belief, or any other exemptions that may be recognized by applicable. Recruitment & Staffing Agencies  : Generate Biomedicines does not accept unsolicited resumes from any source other than candidates. The submission of unsolicited resumes by recruitment or staffing agencies to Generate Biomedicines or its employees is strictly prohibited unless contacted directly by Generate Biomedicines’s internal Talent Acquisition team. Any resume submitted by an agency in the absence of a signed agreement will automatically become the property of Generate Biomedicines, and Generate will not owe any referral or other fees with respect thereto.\n"
}