{
    "https://www.linkedin.com/jobs/view/entry-level-data-scientist-at-synergisticit-3622574664?refId=2Fzt37gj4jxKiInhsq2qfA%3D%3D&trackingId=0%2FEtE8On5eVt46ciy8ucyQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout UsSynergistic IT is a full-service staffing and placement firm servicing client in America for the past 12+ years. We are dedicated towards fulfilling the IT needs of our clients. From staffing to full implementation of projects we provide the highest quality IT Services. We Intend to deliver exceptional student outcome. We don't just help you secure a tech job but build a solid career in technology.Job DescriptionGood understanding of the below modelsIdentify valuable data sources and automate collection processesUndertake preprocessing of structured and unstructured dataAnalyze large amounts of information to Client trends and patternsClassifier, Random Forest Classifier, Nave Bayes, Support Vector MachineMachine Learning Algorithms - Linear Regression, Logistic Regression, Decision Tree Unsupervised/Clustering algorithmsNLP models, Deep Learning models for image classification Desired Candidate ProfileSkills RequiredHands on experience Python scriptingHands on experience in building Machine Learning and Artificial Intelligence modelsGood knowledge on Exploratory Data Analysis (EDA)Hands on experience on platforms - Microsoft Azure/Amazon Web ServicesLibraries - Numpy, Pands, Scikit learn, Seaborn, Plotly, TensorFLow, Should be able to do data visualisation using Tableau or Excel.Excellent English communication (both oral and written) and reading comprehension skills.Strong analytical and problem-solving skills, with clear attention to detail.Education Requirement: -Bachelors, Masters in Computer Science/ Computer Engineering/ Information Systems/Information Technology/ Electrical Engineering/ Mechanical Engineering.BenefitsOn Job Technical supportE- verifiedFiling of H1b and Green cardFull time position Candidate who are missing the required skills, might be provided an option to enhance their skills, so that they can also apply for the role and can make a career in IT industry.If you do respond via e-mail, please include a daytime phone number so that we can reach you. In considering candidates, time is of the essence, so please respond ASAP. Thank you\n      "
}