{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-at-gridware-3581601898?refId=OX970KWHuue%2BJP23Hmmf3g%3D%3D&trackingId=Um7xNgsx5tlnhq7CtJDlvg%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nDescriptionIn-person - Walnut Creek, CA (Bay-Area).Gridware is a venture-backed climate tech startup on a mission to protect the electric grid from extreme weather events such as wildfires and storms. We’re a startup building hardware and software to provide grid operators with unprecedented on-the-ground intelligence to ensure safe and reliable power operations.Founded in 2020, we’ve raised over $18M from leading VC funds including Lowercarbon Capital, Fifty Years, True Ventures, and Wireframe Ventures. Gridware’s technology was listed as one of 200 life-changing inventions by Time Magazine in 2022. Our co-founders have also been listed in Forbes’ “30 under 30” for social impact.To build on this success, we’re currently looking for a senior data scientist with deep experience working with high frequency physical sensor data. You will design, implement, and help productionize multi-modal fault classification and prediction models that operate on resource-constrained edge compute systems.Why do we need you?Gridware's core product relies on robust models to detect and predict the types of physical fault phenomena that can lead to a grid outage or wildfire ignition. Using a plethora of data sources, ranging from experiments at our physical test site to sensors deployed on real distribution grids, we centrally fit models that are then deployed to unique inference and learning environments. To continuously improve our product performance and innovate on the data challenges, we're looking for a creative scientist with a strong track record in execution.ResponsibilitiesDesign, analyze, test classifiers and predictors that extract insight from our system's observations of grid infrastructure and its interactions with the environmentCollaborate with experimental scientists in designing physical or data experiments to direct data collectionHelp establish+execute DS workflows and best practices for individual and team projectsWork closely with our world-class engineering team to minimize and productionize modelsRequirements4+ years of professional experience as a data scientistB.S. in data science, computer science, mathematics, or statisticsExperience working with high frequency time-series data originating from physical sensors; e.g. audio, electrocardiogram, electroencephalography, motion, etc.Strong fundamentals in machine learning, statistics, sampling, and data fundamentalsFamiliarity with standard tooling, environments, and languages such as pytorch, tensorflow, git, linux, SQL, python, etc.A passion for working in a fast-paced environment and hands-on development and testing Highly motivated, self-starting, and able to perform duties without supervisionApplicationAlthough we do not require candidates to submit a cover letter, candidates who wish to have their application stand out are invited to write a cover letter outlining one or all of the following things in a bullet-point format:Why you are interested in joining GridwareWhat skills you have that makes you the perfect candidate for this roleBenefitsWe offer competitive benefits that help employees to thrive and grow. These benefits include:4-day week every other week2 weeks paid time off, plus an additional annual paid 2 week “off the grid” mini-sabbatical with a $3000 stipend to make it a great adventureFlexible starting hours to reduce commuteHealth Insurance = We cover 100% of Gold and Platinum health insurance plan premiums and up to $800 of plan premiums for dependents.Dental & Vision = We also cover 100% of the premiums of an excellent Dental and Vision Plan and 100% of the premiums for one dependent.Paid Parental Leave401KStock option planCompany-paid training to upgrade your skillsFree parking and a commuter allowanceAn attractive salaryGridware is an equal opportunity employer. We want applicants of diverse backgrounds and hire without regard to color, gender, religion, national origin, citizenship, disability, age, sexual orientation, or any other characteristic protected by law.Gridware is located in Walnut Creek, California.\n      "
}