{
    "https://www.linkedin.com/jobs/view/ai-research-scientist-language-technical-leadership-at-meta-3637742733?refId=cZl2m8JDR%2FuK7P5QTCRadw%3D%3D&trackingId=xqIj516ROpMPYviiqKfhNQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Meta is seeking Research Scientists to join our AI Research and Development organizations. The ideal candidate will have industry experience working on Language related topics and the ability to apply relevant AI and machine learning techniques to build intelligent rich language systems that improve Meta's products and experiences. Candidates should have an equal interest in taking new research findings in this area and implementing them towards product needs. We are hiring in multiple locations.AI Research Scientist - Language (Technical Leadership) Responsibilities:Help advance the science and technology of intelligent machinesWork on research projects, strategies, and problems of moderate to high complexity and scope. Can identify and define both short & medium term objectivesInfluence progress of relevant research communities by producing publicationsEstablish strong connection with cross-functional partners and contribute research with the goal of applying to Meta's product developmentLead and collaborate on research projects within a teamDesign policies, processes, procedures, methods, tests, and/or components, from the ground up for end-to-end systemsApply in-depth knowledge of how the machine learning system interacts with the other systems around itMinimum Qualifications:Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.Experience holding a faculty, industry, or government researcher positionPh.D. and publications in machine learning, AI, computer science, statistics, applied mathematics, data science, or related technical fieldsProven track record of recent and consistent publication/citation historyExperience leading a team in solving modeling problems using AI/ML approachesExperience in applying research to production problemsExperience communicating research for public audiences of peersExperience in developing and debugging in Python, C/C++, or C#Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employmentPreferred Qualifications:4+ years of work experience post PhD in a university, industry, or government lab(s), in a role with primary emphasis on AI research.4+ years of experience as technical lead for a project of 4 or more individuals.First-author publications at peer-reviewed AI conferences (e.g., NeurIPS, ICML, ICLR, AAAI).Experience with interdisciplinary and/or cross-cultural collaboration.Experience bringing machine learning-based products from research to production.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We may use your information to maintain the safety and security of Meta, its employees, and others as required or permitted by law. You may view Meta's Pay Transparency Policy, Equal Employment Opportunity is the Law notice, and Notice to Applicants for Employment and Employees by clicking on their corresponding links. Additionally, Meta participates in the E-Verify program in certain locations, as required by law\n      "
}