{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-entry-level-at-patterned-learning-ai-3640890081?refId=EoQhRFwWk73jX6t7KI47HA%3D%3D&trackingId=60o4MV0d%2BHqeW2CPoZIcdw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nREMOTE (US/Canada Residing people only, with work permit) Patterned Learning – Machine Learning Scientist (Entry-Level), FULL-TIME, Salary $60K - $70K a year & minimum 1+ years of work experience.About us: The Future of AI is Patterned, a stealth-mode technology startup. Top investors include Sequoia and Anderson Horowitz, founders from Google, DeepMind, and NASA and we’re hiring for almost everything!💻 RoleWe are looking for intellectually curious, highly motivated individuals to be foundational members of our Machine Learning and Data Platform team. You will partner across the company and use data to design scalable solutions based on a deep understanding of critical business goals. The ideal candidate will leverage data analysis, statistics and machine learning to support initiatives end to end, including data & machine learning engineering.ResponsibilitiesDevelop and implement machine learning algorithms and models to solve complex problems.Conduct exploratory data analysis, feature engineering, and data preprocessing.Collaborate with cross-functional teams to identify business requirements and translate them into technical solutions.Perform model evaluation and optimization to ensure robustness and efficiency.Stay up-to-date with the latest research and developments in machine learning and AI fields.Contribute to the creation and maintenance of scalable and reliable data pipelines.QualificationsBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.Strong foundation in machine learning concepts and algorithms.Proficiency in programming languages such as Python, R, or Java.Experience with popular machine learning libraries (e.g., TensorFlow, PyTorch, scikit-learn).Familiarity with data visualization tools and techniques.Excellent problem-solving and analytical skills.Strong communication and teamwork abilities.A passion for innovation and a desire to make a positive impact through machine learning.Special Benefits You Will LoveFlexible vacation, paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceSchedule: 8 hour shift, Monday to Friday , Time: Flexible, Job Type: Full-timeNote: This is an entry-level position, and the emphasis is on foundational knowledge and a willingness to learn and grow in the role.\n      "
}