{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-indigo-slate-3641926158?refId=QuDiRa0UhuN2AKTie9gCDA%3D%3D&trackingId=T%2F3Om3VrDmgGnsx250qGhw%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        At Indigo Slate, we are looking to build an onsite high energy collaborative team of ML/AI Researchers and Engineers for one of the fastest growing and innovative enterprise customer.What are the required qualifications?At least 2-8 years of hands-on experience in Machine Learning and Deep Learning using python.Good understanding of Feature Engineering, Regularization, Hyperparameter Tuning, Model Selection and ValidationMust be experienced in building custom DL/ML modules with custom architecture.Mush be creative in labelled data creation / generationMust be aware of methods to choose ML methods based on the type of data, volume and time performance requirementsMust have built large-scale mining system for streaming text. Must have experience in creating and hosting scalable Restful APIs using python.A deeper understanding of ML and DL and the ability to build models quickly.Understanding the right evaluation metrics for ML problems.Must have the capability to convert business problems to ML problems.Must have dealt with large volume, velocities of noisy data to build ML models.Experience in using MongoDB, Cassandra and MySQLHighly Desirable SkillsHaving CUDA based DL will be advantage.Ability to scale the DL/ML Models for the production.Ability to containerize the ML models.Experience in distributes data processing using Spark – especially Spark MLlibFrameworksScikit-Learn (Must)Keras, TensorFlow (Must)Spark MLlib (Highly desired)MxNet, Pytorch (Good to have)Spark, Spark MLlib (Desirable)MongoDB, Cassandra, MySQLWhat's in it for you?Join our growing team and contribute your ideas and leadership in ways that are meaningful. This is work the way you always hoped it would be. Authentic feedback, support for your personal and professional growth, and empowerment to help shape the agency. We offer competitive compensation and full benefits.Powered by JazzHR\n      "
}