{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-hayden-ai-3641781481?refId=GwK0uOEFnu79spJndcg3ng%3D%3D&trackingId=uuOndBy2wH6Y%2FTyI3hmXRA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Welcome to Hayden AI, where the future is ours to make. From bus lane and bus stop enforcement to digital twin modeling and more, our clients use our mobile perception system to speed up transit, make streets safer, and create a more sustainable future.Led by experts in AI, computer vision, data science, transportation, and government technology, Hayden AI is pioneering real world problem solving powered by AI and machine learning.Our mobile perception platform is currently utilized by New York City's MTA for automated bus lane enforcement. We recently raised $20 million in Series A funding and have been featured in Bloomberg CityLab, Forbes, Smart Cities Dive, and Politico.Come join us, and help us build a vision-based data platform for smart enforcement and smart cities with our six core values in mind:Customer FocusPassionCollaborationEmpowermentTransparencyIntegrityMachine Learning EngineerSummary of Responsibilities:This role will work with the data generated from perception algorithms to create insights and fine-tune our perception system. You will access databases to create local datasets. Analyze the data to understand the performance and problems with the current solutions. Develop custom data models and algorithms to apply to improve our decision-making pipelines. Coordinate with different functional teams (cloud/device) to implement models and monitor outcomes. Present findings to the company so that insights can be acted on across the company to improve performance. Use data visualization tools to present findings in easy-to-understand ways to make improvements to the current system. Summary of Qualifications:Strong data science and traditional ML skills (SVM, Random Forest etc.). Strong problem solving skills with an emphasis on product development. Self led and excited to dig into the data to find issues and insights. Python, Pandas (C++ or Go experience is a bonus). Understanding of computer vision and deep learning. SQL/Database access experience. Experience working with geospatial data is a plus. Target Salary Range:$89,000 - $200,000Company granted equity Company wide bonus programThere are endless learning and development opportunities from a highly diverse and talented peer group, including experts in a wide range of fields (AI, Computer Vision, Government Contracting, Systems & Device Engineering, Operations, Communications, and more)!Just a few of our perks include:Options for 100% company paid medical, dental, and vision coverage for employees and dependents (for US employees)Flexible Spending Account (FSA) and Dependent Care Flexible Spending Account (DCFSA)Life, AD&D, Short and Long Term Disability InsuranceAflac Critical Illness, Accident Insurance & Hospital Indemnity InsuranceMetLife Legal Plan(s) & Pet InsuranceFarmers GroupSelect Auto & Home Insurance401(k) with 3% company matchingProfessional development reimbursementWellness stipendsUnlimited PTORemote work opportunitiesHome office & technology reimbursementDaily catered lunches in our Oakland officeHayden AI is committed to creating a diverse and inclusive environment that fosters learning from each other. We celebrate people of diverse backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and are committed to providing a work environment free of harassment and discrimination. Hayden AI is also committed to working with and providing reasonable accommodations to individuals with disabilities. Please let your recruiter know if you need an accommodation at any point during the interview process.To all recruitment agencies: Hayden AI does not accept agency resumes. Please do not forward resumes to our jobs alias, Hayden AI employees or any other company location. Hayden AI is not responsible for any fees related to unsolicited resumes.Privacy Policy\n      "
}