{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-durable-3606666869?refId=%2F1Dknf373ZoNCZL%2BBr%2FlqQ%3D%3D&trackingId=yqFGvxIxLoPi1aoDa2dNig%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout UsAt Durable, we’re on a mission to transform access to custom software using explainable AI capable of human-level reasoning and dialogue. Our vision is of a future where custom, flexible, and durable software is democratized and accessible to everyone.We are a VC-funded early stage startup founded by repeat founders building a product in a new category with a nimble team and using cutting-edge neuro-symbolic AI. Our goal is to foster a work culture where team members are empowered with transparency and the right context to use good judgement and make optimal decisions quickly without organizational overhead.About The RoleIn this role you’ll join a small team of passionate and experienced scientists and engineers building a new product using neuro-symbolic AI. Our technical approach spans the fields of NLP, ML, and Program Synthesis. Your technical direction, design, and implementation contributions will play a key part in bringing our product vision to life.We are a small team and prefer the high bandwidth and collaborative nature of colocation, but we’re also open to considering remote or hybrid arrangements.What You’ll NeedMaster in computer science with focus on ML or equivalent work experience.Experience curating training datasets and evaluating models.Knowledge of state-of-the-art ML methods and familiarity with the literature.Experience training models, especially at scale with distributed compute.Although not required, we’d be thrilled if you have experience with natural language processing.Proficiency with Python and frameworks such as Pytorch and Tensorflow.Strong communication skills and a proactive attitude towards collaboration.Our Offer to YouHigh-empowerment and low-ego team environment with low organizational overhead.Excellent benefits, and the option to tune salary/equity to fit personal preferences.Opportunity for real impact and growth in a small team.Located in the beautiful Colorado Front Range, close to transit, trails, and open space, with a team passionate about the outdoors (skiing, mountain/road biking, trail running, hiking, etc).\n"
}