{
    "https://www.linkedin.com/jobs/view/healthcare-data-scientist-at-optimizerx-3641918217?refId=iRV95FzolZXPlhOY5WcJVA%3D%3D&trackingId=yAXzA%2BaeQt%2F%2BTjbnXotP5Q%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout OptimizeRxHealthcare Data Scientist Job DescriptionOptimizeRx Corporation (NASDAQ:OPRX) is the best-in-class health technology company, enabling car-focused engagement between life sciences organizations, healthcare providers, and patients at critical junctures throughout the patient care journey. Connecting over 60% of US healthcare providers and millions of their patients through a proprietary point-of-care network, connectivity is facilitated via its integrated Therapy Initiation and Persistence Platform.As Healthcare Data Scientist your primary responsibility is to execute exploratory analyses on healthcare data and build AI models to support customer deliverables. You’ll work to productionalize these analyses/models in robust pieces of software. You’ll be part of an integrated team of subject-matter experts, Physicians, Data Scientists & AI engineers, and a wider group of product/technology professionals.Core ResponsibilitiesAnalyze healthcare pathways and clinical dynamics relevant to patient & physician experiences to support client-facing solutionsCombine your healthcare knowledge with business/customer needs, translating those qualitative requirements into impactful Data Science deliverablesUse healthcare data to answer practical business questions, develop predictive (AI) modeling solutions that solve customer problems, and build software components/modules to help automate workflowsCreate advanced analyses on healthcare data including but not limited to: supervised AI models, descriptive & inferential statistics, exploratory data analysis (including unsupervised learning as needed), network analysis/inference, and natural language processingCollaborate with internal & external stakeholders to define the right work to be done; structure requirements and propose timelines for analytic deliverablesCommunicate with internal & external stakeholders to present results, including data visualizationsOther duties as assignedRequirementsBachelor’s degree in a quantitative field (Computer Science, Mathematics, Engineering), or scientific field with strong math/programming coursework2+ years’ experience developing quantitative products/analyses that make meaningful business impacts – driving better product/business decisions, delivering results to clients, or embedding intelligence into software products2+ years’ experience with fundamentals of advanced analytics and Machine Learning workflows, including Exploratory Data Analysis, Model Development, Interpretation, and Deployment2+ years’ experience working with healthcare data such as electronic medical records, medical claims, prescription drug claims, affiliation data, or other life sciences commercial or clinical data1+ years' experience building AI models, including deployment in production environmentsExcellent communication skills, both written and verbal. Able to cater to both technical and non-technical audiences.Demonstrated experience with PythonPreferred Experience/KnowledgeExperience with technologies such as: R, Bash/Basic Linux, Machine Learning Frameworks (Pytorch, Tensorflow, Sklearn), SQL, AWS suite, Databricks, PySpark, OMOP, and CI/CD tooling.\n"
}