{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-ntent-3636799001?refId=kDB%2FV5w3LmVvbM0mbAkinQ%3D%3D&trackingId=d%2B7umWjizSeqzmfuhnqdTw%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nPosition: Full timeLocation: Carlsbad officeAbout UsNTENT provides a Platform-as-a-Service (PaaS), allowing industry partners to customize, localize and integrate search technologies directly into their business-to-consumer offerings. We are a unique group of brilliant minds intent on discovering, learning and building. We work in a vibrant atmosphere, with an emphasis on personal and professional development. This is an opportunity to tackle complex problems usually reserved for a handful of large companies in the search industry.About The OpportunityWe are looking for a talented Machine Learning Engineer to join our team and deliver machine learning-driven products. The right candidate will work on development, deployment, and lifecycle management of machine learning models for various large-scale applications (natural language understanding, web search and ranking, recommendation, personalization, dialog/conversation management).KeywordsMachine learning, natural language processing, learning-to-rank, online learning, deep learning, interactive machine learning, machine teaching, conversational agents, human computer interactionDuties And ResponsibilitiesDesign, implement, and deploy machine learning algorithms.Manage machine learning algorithm lifecycle.Coordinate data collection and annotation efforts.Work with real-time data and content coming from various data sources.Manage machine learning data pipelines. Design tests for machine learning algorithm effectiveness and performance monitoring.Design tools and interfaces for interactive machine learning and teaching.Research and development on cutting-edge machine learning technologies.Qualifications And SkillsGraduate degree in Computer Science with a strong background in machine learning required.Strong problem-solving abilities, solid background in algorithms and data structures required.Strong programming skills in Python and Scala required. Experience in other programming languages (eg. Java, R, Haskell) a plus.Solid knowledge of machine learning tools (eg. scikit-learn, tensorflow, keras, pytorch, Spark MLlib) required.Experience with distributed and streaming data technologies (eg. Hadoop, Spark, Kafka) required.Experience with building and deploying API's with Docker and Kubernetes required.Experience with natural processing tasks (eg. named entity recognition, language modeling, vector representations) required.Experience with Elastic Search, Lucene a plus but not required.Experience with ranking algorithms a plus but not required.Experience with interactive machine learning (eg. active learning, reinforcement learning, machine teaching) a plus but not required.The ideal candidate will be self-motivated, possess excellent communication skills (both oral and written) and be able to work independently. A keen interest in various aspects of natural language processing is essential in our multi-disciplinary team.We offer a full comprehensive benefits package including medical, dental and vision. Employees receive a generous time off (PTO) plan and 13 holidays per year. We also offer 401(k) benefits, long term disability benefits and life.\n      "
}