{
    "https://www.linkedin.com/jobs/view/machine-learning-solutions-engineer-at-roboflow-3625991293?refId=QKAQEHH1uukX1d2PNKU%2BHw%3D%3D&trackingId=sFMJY5mMFShWrAByYEAxew%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nOverviewRoboflow is the fastest way to use computer vision in production. Over 250k engineers build with our tools. Helping our users get the most out of Roboflow is essential to their success.We’re hiring our second Solutions Engineer to partner closely with our sales team and drive new customer wins. You’ll have an immense impact on shaping the future of not only this role, but our company. A large portion of the Roboflow sales process is technical, ensuring customers understand how to incorporate computer vision into their products. Building successful relationships with our potential customers -- many of whom are engineers -- as well as showcasing what the Roboflow product is capable of is a key component of the role, so you will leverage both your engineering background and user-facing mindset to be successful.What You’ll DoBecause our customers use computer vision in so many different industries (accelerating cancer research, improving manufacturing processes, enabling automated checkout, and so much more), your workday will always include an engaging variety of challenges. You will work with sales on delivering demos, building proofs of concepts and prototypes with prospects, and in answering technical questions, assisting in closing deals. You will use your knowledge gathered through sales motions and work with our Customer Success team to determine ways to best drive adoption and successful implementations of computer vision within their products. You will also contribute to the post-sales process (Customer Engineering) in an engineering capacity to ensure our customers are successful throughout their journey with Roboflow. We don’t just stop at signature and onboarding. We want our customers to be life long partners with Roboflow and ensure they are receiving the ROI they envisioned when they first signed on. If you think, “I’m an engineer that loves sharing my work with others,” you’d be in great company in this role.Who You’ll Work WithAs an early first Machine Learning Solutions engineer hire, you’ll be partnering directly with our co-founder/CEO, Sales leadership and Customer Success leadership to not only do great work in the role, but shape how this function works for the future of Roboflow.In This Role, You’llSupport Sales team to assess technical fitDemo Roboflow to potential customers, answer questions about Roboflow, ultimately convincing them Roboflow is the correct solutionYou will collaborate with Sales and Engineering teams to develop POCs and propose solutions that best fit a customers needsTalk with potential customers, understand their problems, and assess whether or not Roboflow is a good fitGive presentations to potential customers on why Roboflow is the perfect platform for their computer vision use cases.Create technical content to demonstrate best practices (e.g. sample apps, documentation, videos, etc.)Dive into our codebase to understand technical limitations in Roboflow that need solving via code (e.g. a bug, a missing feature, etc.) to help close a dealWork with sales to develop strategy and building roadmaps for our potential customers Help potential customers in performing analysis on their image data to answer specific business questions and identify opportunities for improvement through computer visionTest and validate new product features with usage and consumption in mindCreate a repository of reusable artifacts as you build out demos and POC’s, that can be used by customers to accelerate their Roboflow journeyWork with Customer Success team to improve processes, documentation and the overall customer experienceAssist our Customer Success team with customers onboarding, adoption and engineering efforts.The Skillset You’ll BringAn enthusiastic, strong, technical generalistA background in computer science or a related fieldTechnical experience in a professional environment, ideally a startupStrong knowledge of APIs, building webapps with JavaScript and/or PythonAn awareness of the machine learning development lifecycle (and eagerness to learn more)Previous experience talking with customers, working sales motions and solving their problemsAbility to think on your feet, and solve problems during calls with technical customersThe ability to speak to potential customers about their vision and turn this vision into Roboflow use caseThe sales mindset where it comes naturally and you are sharing your passion for Roboflow with those around you, rather than just “selling.”\n"
}