{
    "https://www.linkedin.com/jobs/view/data-scientist-at-wurl-3641770710?refId=om04Ys3Lr%2BDGEHV90ShP%2Fg%3D%3D&trackingId=JNO%2FLWE1bCfDFuS5PRiLEg%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Wurl, LLC.Wurl is a global streaming network. Our B2B services provide streamers, content companies, and advertisers with a powerful, integrated network to distribute and monetize streaming television reaching hundreds of million of connected televisions in over 50 countries. This year Wurl was acquired by AppLovin (Nasdaq: APP), an industry-leading mobile marketing ad tech company, bringing together the technology and innovation of the mobile and television industries. With the merger, Wurl employees enjoy the best of both worlds: the dynamic environment of a 160+ person start-up and the stability of a high-growth public tech company.Wurl is a fully-remote company that has been recognized for the second year in a row as a Great Place to Work. Wurl invests in providing a culture that fosters passion, drives excellence, and encourages collaboration to drive innovation. We hire the world's best to build a bunch of cool stuff on an interface fully integrated with their own from streaming, advertising and software technology to continue to help us disrupt the way the world watches television.Data Scientist - RemoteWurl is seeking an experienced, detail-oriented Data Scientist who will support our product, sales, leadership, and marketing teams with insights gained from analyzing company data. Wurl's position in the video and ad delivery ecosystem enables detailed performance and behavioral measurement. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms, and creating/running simulations and predictions. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.The ideal candidate is experienced with Big data, ML processes, SQL, python, Agile processes, microservice architectures, SaaS concepts. Experience with OTT video, ad insertion processes, JIRA, Confluence, DataDog, Snowflake, AWS, and DataBricks is advantageous but not mandatory.What you'll do:Contributing to Wurl's understanding of our data Contributing to data processing and machine learning initiatives Identifying quality metrics and data featuresBuilding data models and prediction modelsContributing to Wurl's ML frameworks: research modelsParticipating in the evolution of Wurl's data management and analysis framework Creating solutions that are practical and can be applied to business applicationsUsing probability, statistics, predictive modeling, machine learning, or other quantitative methodologies to solve real-world TV delivery and advertisement problems. Qualifications:PhD in Computer Science, Mathematics, Physics or relative field plus 2 years of relevant experience OR Master's degree in Computer Science, Mathematics, Physics or relative field plus 4 years of relevant experienceExpert programming skills with Python and SQLKnowledge of Spark/PySparkStrong mathematical background and knowledge including but not limited to statistics, predictive modeling, linear algebra, machine learningExperience with AI, including building ML models using frameworks such as TensorFlow, PyTorch, SparkML, scikit-learn. Knowledge of fundamental NLP concepts and updated with the state-of-the-art NLP modelsData pre-processing, visualization and data cleansing experience Experience dealing with big datasets and databasesEffective communication skillsWorks well in a team and independentlySoft skills: creative, innovative, open to receiving and giving constructive criticism, open to discussions, trustworthy and reliableProven record of being an outstanding problem-solverLocation: US remote. Pluses:Advanced proficiency with data visualization tools (such as Tableau, Power BI, Domo)Knowledge Snowflake, Databricks and GitExperience with SaaS offerings: AWS preferred. Containerization, serverless processes, microservice architectures, etc. Experience with OTT streaming formats (HLS, DASH), SSAI Publications in a peer reviewed journalsWhat We OfferCompetitive Salary & EquityStrong Medical, Dental and Vision Benefits, 90% paid by Wurl Remote first policy Flexible Time Off 12 US Holidays 401(k) MatchingPre-Tax Savings Plans, HSA & FSAGinger, Aaptiv and Headspace subscriptions for mental and physical wellnessOneMedical subscription for 24/7 convenient medical carePaid Maternity and Parental Leave for all family additionsDiscounted PetPlan and easy at home access to Covid testing with empowerDX $1k Work From Home Stipend to set up your Office Few companies allow you to thrive like you will at Wurl. You will have the opportunity to collaborate with the industry's brightest minds and most innovative thinkers. You will enjoy ongoing mentorship, team collaboration and you will understand what we mean by 'human connection\". You will be proud to say you're a part of the company revolutionizing TV.Wurl provides a competitive total compensation package with a pay for performance rewards approach. The expected base pay range for this [CA based or North America based] position is $121,000 - $196,000. Base compensation at Wurl is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Depending on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical and other benefits.\n      "
}