{
    "https://www.linkedin.com/jobs/view/nlp-data-scientist-studios-at-tifin-3641783258?refId=J%2BNOsto0tgDPKcg5%2Fpq3kw%3D%3D&trackingId=Zr%2F0se7yaq8oIRhcM9q%2F%2BA%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nWHO WE ARE:TIFIN is a fintech platform backed by industry leaders including JP Morgan, Morningstar, Broadridge, Hamilton Lane, Franklin Templeton, Motive Partners and a who's who of the financial service industry. We are creating engaging wealth experiences to better financial lives through AI and investment intelligence powered personalization. We are working to change the world of wealth in ways that personalization has changed the world of movies, music and more but with the added responsibility of delivering better wealth outcomes.We use design and behavioral thinking to enable engaging experiences through software and application programming interfaces (APIs). We use investment science and intelligence to build algorithmic engines inside the software and APIs to enable better investor outcomes.In a world where every individual is unique, we match them to financial advice and investments with a recognition of their distinct needs and goals across our investment marketplace and our advice and planning divisions.OUR VALUES: Go with your GUTGrow at the Edge. We are driven by personal growth. We get out of our comfort zone and keep egos aside to find our genius zones. With self-awareness and integrity we strive to be the best we can possibly be. No excuses. Understanding through Listening and Speaking the Truth. We value transparency. We communicate with radical candor, authenticity and precision to create a shared understanding. We challenge, but once a decision is made, commit fully. I Win for Teamwin. We believe in staying within our genius zones to succeed and we take full ownership of our work. We inspire each other with our energy and attitude. We fly in formation to win together. WHAT YOU'LL BE DOING:TIFIN Studios is the innovation division of TIFIN that conceives and creates fintech companies. We start with frictions that individuals face and address with fin (investment algos + science) and tech (AI + innovative software). We build MVPs in 3 months with production-ready products in 6-12 months with real-time feedback from an ecosystem of industry professionals.TIFIN Studios is seeking an NLP Data Scientist. The AI-based products center primarily around conversational AI assistants and personalization with applications across different themes and user groups. We are looking for a creative thinker who can be hands-on with early-stage projects.The ideal candidate is passionate about conversational AI and NLP and its application in the investment space.You must be a motivated and tenacious self-starter who is comfortable interpreting technology requirements, based on business requirements, and implementing them with maximum impact on the users. You will be expected to develop technology that minimizes technical debt while maximizing the customer experience. This is a high-impact role on a lean team that is results-and execution-oriented. We are a team of do-ers!THE ROLE:Analyze large conversational data sets made up of chatsBuild and enhance NLU (natural language understanding) data models for conversational AI productTransfer data into a new format to make it more appropriate for analysis Build tools and scripts to automate data collectionContinue to tune the models to improve accuracy and effectivenessWHO YOU ARE:Ph.D./Masters/Bachelors' degree in computer science, mathematics, statistics, engineering, or relevant field Experienced in the field of NLP/NLU and well versed with the current and latest state-of-the-art research 2+ years of practical experience in the development of chatbots or other conversational AI applications Understanding or hands-on experience with digital chat application tools like Google Dialog Flow, Rasa, etc. Knowledge in querying databases and using statistical computer languages (i.e., Python, etc.) Experience using machine learning/ deep learning frameworks such as TensorFlow and/ or PyTorch Analytical and problem-solving skillsAbility to visualize data in the most effective way possible for a given project or studyA local presence in the Boulder, CO or San Francisco, CA areas Thrives in a highly demanding, entrepreneurial, and fast-paced environmentIs a top performer and has a proactive, \"doer\", and problem-solver mentality Is highly flexible, has a good tolerance for ambiguity, and can quickly adapt to changing prioritiesIs an exceptional team player with solid communication skillsCOMPENSATION AND BENEFITS PACKAGE:For Colorado Applicants: The expected starting salary range for this position in Colorado is between $100,000 - $160,000. Applicable salary ranges may differ across markets. Actual pay will be determined based on experience and other job-related factors permitted by law. The position is also eligible for incentive compensation as well as client acquisition bonus programs.TIFIN offers a competitive benefits package that includes:Performance linked variable compensation, including equityMedical, dental, vision, life and disability insuranceFlexible Spending Account (FSA) and Health Savings Account (HSA)401(k) Retirement PlanFlexible PTO policy and Company-paid holidaysParental Leave: 12 week paid maternity, 4 week paid paternity leaveCorporate Social Responsibility and volunteering opportunitiesAccess to our Chief Mindfulness Officer, including 1:1 personal coaching for executives and rising starsCompany sponsored events like Qi Gong, Lunch & Learns, Development Workshops, Dinners, Happy Hours, and more!The ability to make a real impact in an incredibly fast-growing organizationA note on location. While we have team centers in New York City, San Francisco, Charlotte, and Mumbai, TIFIN is headquartered in Boulder, CO and our preference is to build the team here whenever possible, so relocation packages are available for any candidate willing to relocate to the Boulder area.TIFIN is proud to be an equal opportunity workplace and values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\n      "
}