{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-us-remote-at-hugging-face-3561773331?refId=5tjt%2FngUoiYejtWZ3Vod%2Fg%3D%3D&trackingId=VlFIXe5zbY0FbsYksoMzXg%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nDescriptionHere at Hugging Face, we’re on a journey to advance good Machine Learning and make it more accessible. Along the way, we contribute to the development of technology for the better.We have built the fastest-growing, open-source, library of pre-trained models in the world. With over 130K+ models and 110K+ stars on GitHub, over 10 thousand companies are using HF technology in production, including leading AI organizations such as Google, Elastic, Salesforce, Algolia, and Grammarly.About The RoleAs a Machine learning engineer, you will work mainly with existing open-source libraries, such as Transformers and Accelerate to boost the support for all the new advances in model training and fine-tuning such as DeepSpeed, fairscale, and all forms of model parallelism.You'll get to foster one of the most active machine learning communities, helping users contribute to and use the tools that you build. You'll interact with Researchers, ML practitioners, and data scientists on a daily basis through GitHub, our forums, or slack.About YouIf you love open source, are passionate about making complex technology more accessible, have experience building and training large models, and want to contribute to one of the fastest-growing ML libraries, then we can't wait to see your application!If you're interested in joining us, but don't tick every box above, we still encourage you to apply! We're building a diverse team whose skills, experiences, and backgrounds complement one another. We're happy to consider where you might be able to make the biggest impact.More About Hugging FaceWe are actively working to build a culture that values diversity, equity, and inclusivity. We are intentionally building a workplace where people feel respected and supported—regardless of who you are or where you come from. We believe this is foundational to building a great company and community. Hugging Face is an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.We value development. You will work with some of the smartest people in our industry. We are an organization that has a bias for impact and is always challenging ourselves to grow continuously. We provide all employees with reimbursement for relevant conferences, training, and education.We care about your well-being. We offer flexible working hours and remote options. We offer health, dental, and vision benefits for employees and their dependents. We also offer 12 weeks of parental leave (20 for birthing mothers) and unlimited paid time off.We support our employees wherever they are. While we have office spaces in NYC and Paris, we're very distributed and all remote employees have the opportunity to visit our offices. If needed, we'll also outfit your workstation to ensure you succeed.We want our teammates to be shareholders. All employees have company equity as part of their compensation package. If we succeed in becoming a category-defining platform in machine learning and artificial intelligence, everyone enjoys the upside.We support the community. We believe major scientific advancements are the result of collaboration across the field. Join a community supporting the ML/AI community.\n      "
}