{
    "https://uk.linkedin.com/jobs/view/data-scientist-at-perspectum-ltd-3642697312?refId=gePxNpObcBnzpNgZdRapcw%3D%3D&trackingId=ZnRY28uc%2FOSmL486QIEUvg%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Are you and expereinced Data Scientist looking for a new role?About The RoleThe Data Scientist helps develop methods to accelerate and scale new and existing workflows, leveraging machine learning techniques for improved use of data across the company. They maintain the deep learning models behind much of Perspectum’s automated image analysis capabilities while also working closely with other research teams to run Perspectum’s core algorithms at scale. Their work supports teams across the organisation in internal research, business intelligence, clinical, and CRO work.Your DutiesCarry out research into relevant data science algorithmsImprove data science algorithms through empirical investigation and fine tuningRead and understand technical reports and algorithm specificationsDevelop proof-of-concept and prototype softwareKeep up to date with advances in data science, through team discussion meetings and conference attendanceImplement and extend state-of-the-art data science algorithmsWrite technical reports and algorithm specificationsMake presentations showcasing the work of the GroupCollaborate with product management and software engineering teams on product developmentCollaborate with internal research teams and on external research collaborationsStrengthen the interfaces with other Groups in PerspectumWhat we need from youSolid grounding in mathematics/sciencesGood oral and written communication skillsAbility to work independently and as part of a teamGood organisational skillsEvidence of an interest in the application of research to biomedical problemsExperience in artificial intelligence / machine learning / data science Experience in prototype coding (e.g. Python, MATLAB)Understanding of the importance of algorithmic validationAbout UsAt Perspectum, we offer our employees a flexible, fast-paced and fun environment. We are driven by hiring the best talent, who share our values of excellence, accountability, integrity, openness and passion.We value our employees and are constantly striving to ensure we provide a working environment that offers something for everyone, whether that be flexible working, training opportunities or health and wellbeing initiatives. Benefits include:33days annual leave (inclusive of Bank Holidays), increasing with service Discretionary bonus scheme Private healthcare including medical referrals, discounts, access to counselling and nutritional support, and cashback on healthcare bills Life assurance Pension contribution rising to 6% after 2years service Hybrid working – we like our employees to be in the office 3 days per week. Our sociable working environment includes pool table, tennis table and table football. Office Facilities include free on-site parking, refreshments, onsite showers and changing facilities, bike locks and Electric Vehicle charging points. Perspectum delivers cutting-edge digital technologies that help clinicians provide better care for patients with liver disease, diabetes, and cancer. With a strong focus on precision medicine using advanced imaging and genetics, our vision is to empower patients and clinicians through quantitative assessments of health enabling early detection, diagnosis, and targeted treatment.\n      "
}