{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-rose-ai-3556911798?refId=BnDLSy71aE3ifdc2p4vKWA%3D%3D&trackingId=jBPiiYVJVzm212%2BUe9iqlA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Rose AIRose AI is a cutting-edge cloud data platform that leverages generative AI to help users find, visualize, and share data. By combining powerful natural language processing and state-of-the-art open-source LLMs, we empower knowledge workers to research at the speed of thought, starting with the finance industry. Our platform simplifies the process of accessing, manipulating, and visualizing data, providing a single source of truth that is fully auditable and easy to use.Job DescriptionWe are seeking a talented and experienced Senior ML/AI Engineer to join our team at Rose AI. You will be responsible for designing, implementing, and optimizing advanced machine learning models to drive the next generation of our platform. You will work alongside a team of passionate engineers and researchers dedicated to transforming the way data is accessed, visualized, and shared.ResponsibilitiesDevelop and implement cutting-edge machine learning and AI algorithms to improve the platform’s performance, scalability, and user experienceCollaborate with cross-functional teams to define and prioritize product requirements, scope, and timelineConduct research to stay up-to-date with the latest ML/AI technologies and industry trendsOptimize existing models and algorithms to enhance performance and efficiencyDevelop and maintain a robust ML/AI pipeline, including data preprocessing, feature extraction, model training, and evaluationEnsure high-quality code by following best practices and conducting thorough code reviewsWork closely with the data team to understand data sources and implement data ingestion and processing solutionsMentor and support junior team members to foster a culture of continuous learning and growthQualificationsBS, MS, or PhD in Computer Science, Engineering, Statistics, or a related field5+ years of experience in machine learning, AI, or a related fieldStrong programming skills in Python and experience with ML/AI frameworks (e.g., TensorFlow, PyTorch, or similar)Expertise in natural language processing, deep learning, and generative modelsFamiliarity with cloud platforms and services (e.g., AWS, GCP, Azure)Experience with data processing tools and libraries (e.g., Pandas, NumPy, Dask)Strong problem-solving skills and the ability to work independently and collaborativelyExcellent communication and interpersonal skillsPreferred Qualifications:Experience in the finance industry and familiarity with financial data sourcesExperience working with large-scale, distributed systemsA proven track record of published research in ML/AI or related fieldsExperience with data visualization tools and libraries (e.g., D3.js, Plotly, or similar)BenefitsCompetitive salary and equity packageComprehensive health, dental, and vision insuranceGenerous vacation and holiday policyProfessional development and growth opportunitiesCollaborative and inclusive work environmentHow To ApplyIf you are a talented and driven individual with a passion for revolutionizing the way data is accessed and visualized, we would love to hear from you. To apply, please submit your resume, a cover letter detailing your relevant experience, and any links to your GitHub, research publications, or other examples of your work.Rose AI is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.Please note that this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\n"
}