{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-gauntlet-3575098028?refId=HsBZuzjcyU6AdP3MScaYIA%3D%3D&trackingId=Eo2GhYk%2F3b%2F6venPQcZwVA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Gauntlet’s mission is to drive adoption and understanding of the financial systems of the future. Gauntlet is the platform for off-chain intelligence that drives on-chain efficiency in Decentralized Finance (DeFi). We work with protocols to manage risk, improve capital efficiency, and manage incentive spend. We also publish cutting-edge research and aim to take a leading role in defining market risk standards across the industry.Gauntlet is building infrastructure that allows us to simulate and stress-test blockchain protocols, contracts, and network interactions at scale over a wide range of market conditions. Our models ingest a wide range of on-chain and off-chain data, and are continuously calibrated to the current crypto market structure so that our recommendations are always up-to-date. These models and infrastructure power our platform that currently manages risk and optimizes incentives for over $40B in assets.In order to grow our impact in the DeFi space we are looking to hire experienced Machine Learning Engineers to help new and established protocols better manage the systems they’ve built. This role will require establishing a strong ability to scope, build, and maintain end to end machine learning pipelines in order to dynamically manage and tune protocols under changing market conditions to maximize their growth.ResponsibilitiesOwn end to end creation of ML models to dynamically optimize DeFi protocolsContribute to making our core ML infrastructure and platform world-classBuild data models and visualizations of public blockchain data and modeling results that provide intuitive analytics to our customers to better understand our recommendations and their protocolQualifications5+ years of professional engineering experienceProficient at writing code in Python or similar interpreted languagesExperience with scientific computing packages such as Numpy/Scipy, Jupyter, Pandas, etcExperience deploying and tuning ML models in a production settingStrong communication skills and the ability to work collaboratively in a distributed team environmentBonus PointsExperience working in the crypto industry is a plus but not requiredEnthusiasm for the space, especially DeFi, is very much desiredSmart contract development experience (e.g. Solidity)Experience with building machine learning models at scalePublished or presented research in the spaceBenefits and PerksRemote first - work from anywhere!Regular in-person company retreats and cross-country \"office visit\" perk100% paid medical, dental and vision premiums for employeesLaptop, monitor, keyboard and mouse setup provided$1,000 WFH stipend upon joining$100 per month reimbursement for fitness-related expensesMonthly reimbursement for home internet, phone, and cellular dataUnlimited vacation100% paid parental leave of 12 weeksFertility benefitsOpportunity for incentive compensationPlease note at this time our hiring is reserved for potential employees who are able to work within the contiguous United States and Canada. Should you need alternative accommodations, please note that in your application.The national pay range for this role is $150,000 - $180,000 base plus additional On Target Earnings potential by level and equity in the company. Our salary ranges are based on paying competitively for a company of our size and industry, and are one part of many compensation, benefits and other reward opportunities we provide. Individual pay rate decisions are based on a number of factors, including qualifications for the role, experience level, skill set, and balancing internal equity relative to peers at the company.\n"
}