{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-at-lynntech-inc-2894004745?refId=f5oihHfF1cEU4846Cyt%2FMA%3D%3D&trackingId=kkGQGeD%2BO95%2F2ftitavn2Q%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Lynntech, Inc., a rapidly growing technology development company specializing in transitioning innovative ideas and concepts into marketable products, is seeking a highly motivated and creative researcher to join our team. All work is done on our campus, remote work is not an option.The Candidate Should Preferably Have 2 Years Of Relevant R&D Experience (industrial Or Academic), And Must Have Demonstrated Expertise In One Or More Of The Following AreasWe have an opening for a Machine Learning (ML) Scientist to develop novel platforms for unsolved or frontier challenges in this domain.Designing, developing, and evaluating product-focused solutions utilizing machine learning methods, deep learning, computer vision, or natural language processing.Working collaboratively on complex problems using machine learning to provide customized product solutions, such as intelligent systems, autonomous systems, improving training experience, and simplifying workflow processes.Programming and Software Engineering with a strong focus on Machine Learning algorithms and methods.Familiarity with evaluation of AI algorithm performance, Generative methods (e.g., GANs), AI Explainability methods, or AI Security (e.g., Adversarial Examples).Effective oral and written communication skills, organizational skills and technical writing ability are required.One or more of the following additional skills/experiences are highly desired:Conception of new research areas, grant proposal writing and managing research projects. PhD.-level research that applied Math, Science or Statistics to implement computer analysis solutions (examples include Physics, Astronomy, Microscopy, Medical Imaging, Surface Science, Aerospace, Geo-spatial Intelligence, Genomic Signal Processing, Radio Frequency applications, etc.).Training and validation of scalable ML models in a machine learning platform (e.g., TensorFlow, Keras, Lua or PyTorch) for AI applications. This should be demonstrated through publicly available code, publications, videos, or presentations.Proficiency with Python or MATLAB. Proficiency with C and C++.Platform agnostic: should be able to work with Microsoft Windows, Linux, or MacOS.The Research Scientist Is Responsible ForObtaining regular funding as primary author of research proposals submitted to federal agencies.Executing and designing experiments and interpretation of the results.The preparation of high-quality progress reports and other deliverables required by funding agencies.Identifying potential intellectual property and assisting with preparation of draft patent applications.In addition to a challenging multidisciplinary work environment, qualified applicants will have the opportunity to develop and strengthen their business skills by interacting with companies expressing interest in commercializing patented technologies.The selected candidate will join the Intelligent Systems unit at Lynntech. Our team develops systems to provide actionable information by transforming and analyzing data, often in challenging application-environments. We use machine learning, state-of-the-art electro-optical/infrared, embedded navigation systems, human-machine interfaces, radio frequency data, and other resources to solve real-world problems. Examples of our domain expertise include, but are not limited to search and rescue, analysis of geospatial data to provide actionable intelligence, terrain monitoring, disaster recovery, computer vision for autonomous vehicles, assistive technologies for disabled users or training contexts, data analytics, natural language processing, and mobile computing for Internet of Things (IoT) applications.Our facilities are located in College Station, Texas, just four miles from Texas A&M University and centrally located near Dallas, San Antonio, Austin, and Houston.Must be a US Citizen or Permanent Resident due to contract requirements.Qualified applicants should apply online at www.lynntech.com. Lynntech is an Equal Opportunity Employer/M/F/Vet/Disabled.\n      "
}