{
    "https://www.linkedin.com/jobs/view/data-scientist-at-talentplug-llc-3642397065?refId=OzJljJE75F0LEd8hzzHSOw%3D%3D&trackingId=FnUU%2FivIFko25kTM6oYybw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nRole: Data ScientistDuration: Full-Time/PermanentLocation: Remote or Cary NCRequired SkillsData collection (ex. SQL data query, Power Automate)Data transformationData analysisBusiness Intelligence Application skills; Power BI required, others encouragedEnterprise Data Lake (EDL) experience preferredAbility to communicate with both technical and process experts and non-expert stakeholdersFamiliar with Accounting or Business Administration concepts and termsResponsibility 1 - Standardized Account Reporting - Account Manager Performance Develop suite of tools for Account Managers to use in developing strategy and tactics for strategic accounts and contracts. Provide visibility to the work of the Account Managers with their assigned accounts/markets and enable their ability to develop key insights to share with dealers/stakeholders.Responsibility 2 - Monthly/Quarterly/Annual Performance Reporting Deliver easy-to-use, easy-to-read dashboard to tell the SABD success story both within the department and to external stakeholders in Sales & Marketing, Accounting, Dealer Development, etc. Maintain data to ensure accuracy in reporting.Responsibility 3 - OPC Audit Performance Dashboard Support managers and supervisors ability to measure overall team and individual team member performance in measures such as throughput and accuracy. Identify trends in volume, bottlenecks in capacity, and opportunities for continuous improvement using performance data.Responsibility 4 - OPC Dealer Experience Measures Enable deep-dive conversations with dealers/stakeholders through tools that can reveal SLA level, support and response provided for accounts, contracts, dealer groups, and other potential data slices. Reveal insights to support dealer education, internal process improvement, or other solutions to describe and improve experience doing business with SABDRequirements Of This PositionData collection (ex. SQL data query, Power Automate) Data transformation Data analysis Business Intelligence Application skills; Power BI required, others encouraged\n"
}