{
    "https://www.linkedin.com/jobs/view/data-scientist-at-steneral-consulting-3632547910?refId=BR4Si9WY3CQtppdDwFkO2Q%3D%3D&trackingId=%2FIXkWCcitbLBexOXFHZDZg%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nMUST HAVE-5 TO 10 YEARSMust have LinkedIn ProfileComputer Vision specialtyData ScienceModel ConstructionOverviewFM Global is a leading property insurer of the world's largest businesses, providing more than one-third of FORTUNE 1000-size companies with engineering-based risk management and property insurance solutions. FM Global helps clients maintain continuity in their business operations by drawing upon state-of-the-art loss-prevention engineering and research; risk management skills and support services; tailored risk transfer capabilities; and superior financial strength. To do so, we rely on a dynamic, culturally diverse group of employees, working in more than 100 countries, in a variety of challenging roles.We currently have an opening for a data scientist with computer vision/image processing experience. The ideal candidate will have strong experience with ML models created using Python, ability to perform analysis on use cases and identify the correct algorithm ensembles to create ML models to specification. Previous experience with the Agile SDLC methodology is preferred.As An ML Engineer You BringStrong problem-solving skillsCommitment to deliveryExcellent communication skills and a desire to collaborate openly within a fast-moving teamA deep desire to learn and apply technology in a pragmatic way to create client valueExperience designing and building systems that are maintainable, evolvable and highly testedResponsibilitiesCreate computer vision AI/ML models based on use cases identified via business needDetermine the model algorithm stack based on use case requirementsLeverage shared libraries to accelerate developmentDefine, train and score models following a common use case development pathWork cross-functionally in AI/ML team to drive continued improvement of processes and deliver the next set of improvementsPartner with other functions to drive long-term roadmap, improved capabilities, and share results/processes with the organization more broadlySkills/KnowledgeExperience working with large imagery datasets and managing these datasets for model training and scoringKnowledge of common imagery formats and their associated technical packagesExperience with deep learning using PyTorch, Tensorflow, KerasKnowledge of designing ML models to use case specificationExperience with scaling production models using containerizationFluency in Python; some experience with production pipeline coding (Java/Go/Scala)Ph. D. in Computer Science, Computational Science, or related computational field is preferredAdditional Preferred SkillsExperience working with Agile methodologies and frameworksExperience working in Azure cloud and Azure Machine Learning\n      "
}