{
    "https://www.linkedin.com/jobs/view/senior-machine-learning-computer-vision-engineer-at-offworld-3596373669?refId=8i2DT9bT%2F%2B0u7Z%2Fahj8gwA%3D%3D&trackingId=psQt40IEikLICoDJEUqM5Q%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        www.offworld.aiSenior Machine Learning / Computer Vision EngineerBased in Pasadena, CAOffWorld is a robotics startup working on developing a mobile robotic workforce for heavy industrial jobs on Earth, Moon, asteroids & Mars. OffWorld was founded by an experienced engineering team drawing on decades of tackling formidable engineering challenges at NASA, ESA, NOAA, Maxar Technologies, CERN, Reaction Engines, SAFRAN, Surrey Satellites and Cisco. OffWorld’s first challenge is developing and maturing a modular robotic system for extreme environments on Earth. Our robots will go deeper underground and farthest on Earth than humans can, eliminate the need for humans to work in life-threatening environments in mining, construction, tunneling and other dangerous industries, and dramatically reduce the environmental footprint and cost of operations in key economies on Earth and beyond. We have designed a modular robotic architecture that focuses on maximizing the commonality and reusability across components for fast deployment and optimization. Our robotic systems combine sensor information, cutting edge classical/machine learning (ML) algorithms and a robotics real-time system platform for control, decision making and execution. We are seeking a highly skilled Machine Learning Engineer with expertise in Computer Vision to join our team. As a member of the Machine Learning team, you will be responsible for leading the design and implementation of state-of-the-art deep learning algorithms for segmentation, object detection and classification. You will work closely with other engineers to create robust and reliable vision modules that will deliver the best performance in real-world environments.In this role you will have the opportunity to:Develop novel deep learning methods and algorithms that solve complex vision problems in the mining and exploration context, including object detection, semantic segmentation, instance segmentation, and depth estimation.Develop scalable and robust data pipelines that can process large datasets for model training and deployment.Build and maintain vision datasets by deeply understanding customer requirements and leading data collection and annotation initiatives.Collaborate with cross-functional teams to integrate the ML models with the real robot system.To hit the ground running you need:At least 3 years of work experience developing and implementing ML models for computer vision tasks based on Camera or LiDAR.Solid background in one or more computer vision related areas such as object detection, semantic segmentation, instance segmentation.Strong deep learning fundamentals with demonstrated experience building model architectures from scratch.Strong software engineering fundamentals and proficiency in Python.Bonus: Experience in deploying models to real robots (outside of simulation), optimizing architectures for accuracy vs. compute tradeoff.Bonus: Experience with ROS or ROS 2.Good problem-solving skills, attention to detail, and ability to work independently as well as part of a team.Excellent communication skills and ability to present complex technical information to both technical and non-technical audiences.In a nutshell, we offer the:Opportunity to sink your teeth into cutting edge industrial robotics problems Opportunity to contribute to the mission of transforming how we mine on Earth today and how we will one day mine on the Moon, asteroids & Mars Opportunity to work with a kind, brilliant and supportive teamOpportunity to join the OffWorld team ifYou are as crazy-excited about the mission as we are You’ve demonstrated you are The Right StuffExpected Compensation:$130,000 - $230,000/annual salary + stock awards + benefitsOur benefits package includes the following:Robust medical plan offerings with 0 to limited paycheck deductionsDental and vision insuranceUnlimited Paid Time Off401K MatchPay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. The total compensation package for this position may also include other elements dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment.OffWorld is an Equal Opportunity / Affirmative Action employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state or local laws.OffWorld is also committed to working with and providing reasonable accommodations to individuals with disabilities. Please let your recruiter know if you need an accommodation at any point during the interview process.Powered by JazzHR5ZZHnoUcXk\n      "
}