{
    "https://sa.linkedin.com/jobs/view/senior-data-scientist-at-mozn-3642923932?refId=gePxNpObcBnzpNgZdRapcw%3D%3D&trackingId=OBGUcHm%2Fy%2Bb8t%2FvSTkQx1g%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Mozn is a rapidly growing and leading data science & product development firm based in Riyadh with a proven track record of excellence in supporting and growing the analytics ecosystem in Saudi Arabia. Mozn is a trusted analytics partner for the largest government organizations in Saudi Arabia, as well as many large corporations and startups. We are in a critical stage of scaling the company to build institutional analytics knowledge within Mozn and Saudi Arabia. It is an exciting time to work in Saudi Arabia; through Vision 2030, the rate of social and industrial change is staggering. We are searching for a strategic and inquisitive Data Scientist. As a member of Mozn’s Data Science team, you will work with cross-disciplinary teams to identify the problems to be solved, specify the problems in mathematical and statistical terms, scope out the project/product in collaboration with your team and external stakeholders, and then go about answering the identified questions. You find insights that spur teams and stakeholders to improve their business/product and drive value for internal and external stakeholders.As a Senior Data Scientist, your daily workload might include:Work with cross-functional teammates from engineering, products, business, and marketing to deliver data-powered solutions.Communicate highly technical results and methods clearly to a wide variety of external clients.Analyze and extract insights from multiple and complex datasets through regression analysis, hypothesis testing, and other machine learning techniques.Develop and apply new machine learning techniques to ensure modern yet optimal approaches are applied to Mozn’s solutions.Develop data pipelines and ingestion engines for Natural Language Understanding and/or Risk Management; as well as contribute to current engines at Mozn.Engage with stakeholders to identify and define the scope of challenges and propose data-powered solutions.Staying informed with new frameworks and technological advances to increase Mozn’s efficiency and productivity.Coordinate with internal teams to set up and execute solution development strategies.Overseeing a large technical area of work, defining project priorities, and technical solutions.RequirementsOur target profile is candidates with...B.S. or M.S. in Computer Science, Statistics, Mathematics, or similar quantitative fields.Relevant experience as a data scientist, or in similar fields that require developing ML/AI models. Over 3 years for B.S. degree and over 2 years for M.S.Programming experience over two years in software development, including object-oriented programming, and data manipulation using Python or other languages.Good understanding of statistics and probability, such as Hidden Markov Models, Probabilistic Graphical models, or Bayesian inference.Applied experience in machine learning, such as diagnosing models and modifying loss functions.Experience in deep learning frameworks, such as PyTorch.Expertise in Natural Language Understanding and/or Probabilistic Machine Learning applications.BenefitsWe think you'll enjoy working at Mozn. Here's why:We selectively choose to undertake projects with impact; our users and clients trust us to solve mission-critical problems.We move quickly, but carefully and confidently. Iterations happen on the scale of days to weeks, and we invest considerable effort in minimizing the operational overhead to empower you to do your best work.You will be given a lot of responsibility and trust. We believe that the best results come when the people responsible for a product are given the freedom to do what they think is best.\n"
}