{
    "https://www.linkedin.com/jobs/view/machine-learning-scientist-chemistry-at-scismic-3628694107?refId=ov9K%2BNuVe1KaxhAkgWZHXA%3D%3D&trackingId=8uNL9N%2F1HCoy47RjltljKw%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob DescriptionScismic is supporting the growth of a start up company who is hiring a small team of machine learning scientists and bench scientists to aid in building out a new lab space in the Bay Area! You will have a major impact on accelerating their platform to expand their chemical structure/small molecule discovery pipeline that will be tested in vitro and in vivo with the goal of advancing them to clinical trials.About The RoleThey are in search of a talented Machine Learning Scientist | Data Scientist to join their team. In this role, you will be working closely with their entire team of scientists to develop machine learning methods for evaluating chemical structures and predicting new structures that act upon dysregulated protein aggregates that cause neurodegenerative diseases. You must excel in asking the right questions, and applying the right statistical and machine learning methods, to ensure that we are making the right inferences from their biological data. You have a strong understanding of deep learning methods, and can guide their leadership team on when it is appropriate to use such methods vs. more traditional machine learning methods. You treat machine learning/data science as a true science, including writing up your conclusions in Jupyter notebooks or the like to discuss your findings with other team members, including benchlab scientists. You enjoy a mix of practical and theoretical work, and are driven by the impact your work has on concrete decision-making to ensure we meet their long-term goals of getting drugs into the hands of patients with neurodegenerative diseases.QualificationsMS or PhD with an educational background in chemistry or computational chemistry required. Industry experience preferredExperience working with chemistry/chemical structure data, biological data requiredExperience developing deep learning algorithms requiredExperience selecting the appropriate machine learning and statistical methods for various types of datasets requiredStrong scripting skills in Python, including python machine learning libraries and JupyterhubComfortable working in AWS and/or Google Cloud computing environmentsFamiliarity with version control and software engineering best practicesFamiliarity with setting up Docker files/containers to create highly reproducible machine learning models and outputsPrevious experience working with chemical structure data highly preferredPrevious experience interpreting biological data/results preferredPrevious experience and collaborating with biologists preferredHybrid (2-3 days onsite in the Bay Area) preferred, to facilitate interactions and collaborations with our benchlab teamAbout The TeamYou will collaborate closely with their benchlab Scientists to interpret and analyze data collected from CROs and in-house assays to make decisions about which compounds to advance for further drug development. You will develop machine learning methods to build upon and augment their existing machine learning platform for prediction novel chemical structures that act upon toxic protein aggregates in neurodegenerative diseases. You will report to a senior-level computational leader and work closely with their CEO.LocationTheir labs are located in the Bay Area, with a small satellite office in Santa Barbara. The ideal schedule is 1 to 2 days onsite in the Bay Area to brainstorm and collaborate with team members, but flexibility would be offered for the right candidate.\n      "
}