{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-liminal-3618796117?refId=QKAQEHH1uukX1d2PNKU%2BHw%3D%3D&trackingId=YUOg5lcvBfGk2UPcU5aWsQ%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Liminal InsightsLiminal’s mission is to accelerate the clean energy transition by improving the cost, quality, and reliability of battery manufacturing. We do this by providing customers with better analytics and insights during production. Our breakthrough EchoStat® platform uses ultrasound and machine learning technology to supply customers with the information needed to accelerate production ramp-up, improve productivity and reliability, and detect critical defects early. Liminal has active product evaluations with major cell manufacturers and EV OEMs, and are on track to close multiple $M deployment contracts for commercial cell production in 2023.Our Culture and ValuesWe are dedicated to building a world-class, world-positive company.We work closely on a foundation of mutual trust and informed decisions.Our core values are trust, empathy, and curiosity.We encourage personal growth, continuous learning, and safety.We believe the most innovative teams are inclusive and celebrate all forms of diversity.RoleAs a machine learning engineer at Liminal you will join a small, nimble team of engineers creating cutting-edge battery inspection equipment. You will be an integral part of developing models with the data produced by this equipment, developing a deeper understanding of the relationship between battery internals and its ultrasound signature, and creating tools and techniques to deploy, track, and monitor the performance of our models.On a typical day, you may: design and implement algorithms for distilling ultrasonic signals into meaningful features, and correlate those features with performance data; deploy new models and algorithms into production; manage the tracking and performance of our model offerings with customers; build analytics tools and visualizations to empower our engineers and customers; optimize, automate, and streamline our analytics pipeline, and integrate the pipeline with real-time data streams; or communicate your work to stakeholders with varied backgrounds.You value careful listening, thoughtful questions, and data-driven discussions. You are comfortable with gathering and distilling information to drive the direction of open-ended projects. The ideal candidate will approach this work with a mixture of intellectual curiosity, thoughtful creativity, and methodical rigor. The ideal candidate gets great satisfaction from seeing the impact of their work, and above all is excited to solve hard problems that have a positive impact on the world’s clean energy future.ResponsibilitiesDevelop end-to-end machine learning solutions through the full life cycle of prototyping, testing, evaluating, deploying, and maintaining.Build predictive models relating measurements from our products to battery performance.Improve predictive model performance through data engineering, feature engineering, and experimentation with modeling methods.Help build and maintain our ML deployment pipeline and infrastructure.Establish robust, scalable, automated processes for large scale data analysis, model development, model validation, and model implementation.Explore next generation applications and technologies to further expand our product offerings.Analyze customer and in-house data to provide actionable insightsBuild out data visualization tools to track the status of our productsCommunicate with our engineering and business teams to help drive decisions and influence product direction.RequirementsIf you do not have 100% of the requirements, we encourage you to apply.2+ years of experience as a Data Scientist or Machine Learning Engineer.Experience tracking and deploying ML models in production.Proficiency with Python and the Python data stack (Numpy, Scipy, Pandas, Scikit-learn)Experience with predictive modeling (Regression, Classification, Clustering, Dimensionality Reduction)Familiarity with deep learning frameworks (Tensorflow or PyTorch)Practical experience working with real world dataStrong communication skills, with a knack for conveying findings to technical and non-technical audiences visually, verbally, and/or in writingAbility to extract meaning from data and draw logical, coherent, and statistically-valid conclusionsNice to havesExperience developing code for modern parallel computing environments (e.g., parallel processing, GPUs, and distributed clusters)Experience with modern software deployment tools (e.g. Docker, Terraform)Experience with modern server stacks, (e.g. FastAPI, asyncio, gRPC)Experience with modern data pipeline frameworks (e.g. Apache Beam, Apache Flink, Apache Spark)Experience with signal processing techniques or Ultrasound dataBenefitsAnnual salary of $150,000 to $165,000 plus stock options, based on skill level and experience, to help you and your family build a healthy and secure future.Group health benefits that provide support for employee well-being and preventative care, including comprehensive medical, dental, vision, and life insurance.A retirement program that helps build future financial security through both traditional and Roth 401(k) options with employer matching.Flexible working hours and a hybrid working model so you can be productive when and how is best for you.Generous time-off policy to allow you to renew and refresh through vacation, personal leave, and holidays.For new parents, 8 weeks of fully-paid parental leave that you can take at any point during the first year.Liminal is an equal-opportunity employer. We celebrate all forms of diversity and are committed to creating an inclusive environment for all employees. However you identify or whatever your path here, please apply if this job excites you. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the hiring process, perform essential job functions, and receive other benefits and privileges of employment.\n      "
}