{
    "https://www.linkedin.com/jobs/view/data-scientist-at-wiredpeople-inc-3636908707?refId=Cnu2rQ1q2vrLdsjQNXiM%2FQ%3D%3D&trackingId=8Ynd4peTyS7y3iXlNYlmzg%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nOverview:This Data Scientist is a member of an interdisciplinary team of epidemiologists and public health consultants assisting Florida in reaching its strategic public health goals.Essential Functions:Build routine reporting mechanisms, such as dashboards, on descriptive statistics, trend analyses and interactive geographic data displays using public health data. Use statistical computer scripting and programming languages to digest, manipulate, prepare, augment, evaluate, analyze, integrate, summarize and visualize data. Conduct statistical analysis of surveillance data in Merlin (i.e., reportable disease surveillance system), ESSENCE-FL (i.e., syndromic surveillance system) to define and monitor the prevalence and geographic distribution of infectious diseases and other diseases and conditions of public health significance. Participate in analytic projects that require advanced data management, forecasting and statistical analyses. Conduct epidemiologic analyses that involve large datasets, or linkage of multiple datasets, building and automating pipelines and programming and comparing complex matching algorithms. Participate in Data Science workgroups to collaborate and learn from peers on Data Science topics of interest. Evaluate data quality assurance activities including reviewing and cleaning data using standard data quality measurements to identify inconsistencies and outliers. Collaborate with other data scientists, project managers, epidemiologists, and IT staff to select, evaluate, improve and document tools and systems in order to strengthen the Departments analytic and forecasting capacity. Identify and document where data science techniques (visualization, data mining, forecasting, machine learning) can be integrated into workflows in order to modernize and improve processes. Apply identified data science techniques (visualization, forecasting, data mining, machine learning) into daily workflows in order to modernize and improve processes.Lead data science projects from conception through implementation, including conducting exploratory data analysis and data mining, developing model specification requirements and conducting advanced statistical analyses.Qualifications:Master’s degree or higher in data science, statistics, biostatistics, public health, epidemiology, healthinformatics, or other science, technology or engineering discipline.Experience with data mining and data analysis methods, using a variety of data tools.One-two years of experience with statistical analysis.One-two years of experience collecting, organizing and analyzing data.Two years of experience with coding languages (such as R, SAS, SQL and Python)Preferably one year of experience with data visualization tools (Qlik, Tableau, Arc GIS).Ability to communicate complex data in a simple and actionable way.Six months of experience engaging with and producing reports for stakeholders, including epidemiologists, medical providers and the general public using disease-related data.WiredPeople provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, WiredPeople complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.Powered by JazzHRObxPVNOBOj\n      "
}