{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-2022-0259-at-acclaim-technical-services-3580749423?refId=APi5j8drFiYlr8gIc5USKQ%3D%3D&trackingId=b%2F1TJRd0mlc0eMiFXCx2qQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Acclaim Technical Services, Founded in 2000, is a leading language and intelligence services company supporting a wide range of U.S. Federal agencies. We are an Employee Stock Ownership Plan (ESOP) company, which is uncommon within our business sector. We see this as a significant strength and it shows: ATS is consistently ranked as a top workplace among DC area firms and continues to grow.We are actively hiring a Data Scientist with TS/SCI clearance and polygraph to join our company working in Chantilly, VA. As a member of our team, you will be responsible for:Working on and developing innovative solutions to complex issues including data collection and program and systems evaluationLeading qualitative and quantitative research and designBreaking down complex analytical pieces into easy-to-follow briefing materials Create briefing materials that easily demonstrate your assessments Required Education & ExperienceBachelor’s degree in Communications, Writing, Journalism, Political Scient or any technical discipline5+ years’ experience leading qualitative and quantitative research and designMust possess an active TS/SCI clearance with polygraphAbility to create interactive, user friendly dashboards and toolsProficient in R and/or PythonMust be able to work singularly and in a team setting supporting mission critical data science initiatives Proficiency with customer's internal data science environments and tools Ability to synthesize and analyze large data setsAbility to create interactive, user friendly dashboards and toolsProficiency in social mediaPreferred SkillsTechnical targeting experience Data AnalyticsData ScienceExcelEqual Employment Opportunity / Affirmative ActionATS is committed to a program of equal employment opportunity without regard to race, color, ethnicity, national origin, ancestry, citizenship, sex, pregnancy, marital status, sexual orientation, gender identity, age, religion/creed, hairstyles and hair textures, handicap/disability, genetic information/history, military/veteran status, or any other characteristic or condition protected by federal, state or local law. It is the policy of ATS not merely to refrain from employment discrimination as required by the various federal, state, and local enactments, but to take positive affirmative action to realize for women, people of color, individuals with disabilities and protected veterans full equal employment opportunity. We support the employment and advancement in employment of individuals with disabilities and of protected veterans, and we treat qualified individuals without discrimination on the basis of their physical or mental disability or veteran status.Powered by JazzHRj5lR0HxYuS\n      "
}