{
    "https://www.linkedin.com/jobs/view/research-scientist-at-trl11-3642610045?refId=sBB9W9F%2BiQcwixShCiX8ew%3D%3D&trackingId=Cyy8o9KgxUz%2BHCB6bpL4FQ%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        TRL11, Inc. is looking for a Research Scientist in the exciting new space imaging (and aerospace) industry. As a venture backed startup, TRL11 is at the forefront of bringing cutting edge video technology to the space economy. Based in Irvine, CA, our team is dedicated to delivering innovative solutions that enable new discoveries and breakthroughs in space.The Research Scientist will join our team and play a key role in developing and implementing research projects in the field of space imaging technology. This position provides an excellent opportunity for an individual with a deep interest in AI/ML Machine Vision, etc. analysis to work with a dynamic and innovative team.ResponsibilitiesConduct research in the field of AI/ML technologies, with an emphasis on video/image processing and analysis.Analyze video data from space missions to extract information and develop AI/ML/MV algorithms to automate analysis.Develop innovative image processing techniques to enhance the quality of video and images captured from space.Work with a team of researchers and engineers to implement algorithms and applications in software.Stay current on trends and advancements in the field of space technology.Collaborate with other teams to support project goals.RequirementsPhD in engineering, aerospace or related field.Experience conducting research in space technology, image processing, AI/ML Machine Vision or related fields.Strong programming experience in C++ or Python.Excellent analytical and problem-solving skills.Ability to work independently and in collaboration with teams.Strong communication and presentation skills.Passionate about aviation and aerospace.BenefitsHealth Care Plan (Medical, Dental & Vision)Retirement Plan (401k, IRA)Life Insurance (Basic, Voluntary & AD&D)Paid Time Off (Vacation, Sick & Public Holidays)Family Leave (Maternity, Paternity)Stock Option Plan\n"
}