{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-third-wave-systems-3630045328?refId=BnDLSy71aE3ifdc2p4vKWA%3D%3D&trackingId=n9khXYpsY6fjCXMaU%2B7oOg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Third Wave Systems - Bold Innovation In MotionThird Wave Systems is the premier CAE provider for companies that machine. Our products and services are used by the top engineers globally, in progressive automotive, aerospace, medical, and cutting tool companies, to reduce machining costs, improve part quality, and get to market faster. Our team is passionate about materials, machining, modeling, and helping customers support Bold Innovation. Please visit our website to learn more www.thirdwavesys.comDescriptionAre you driven, solutions oriented, customer focused and collaborative? These are some of the necessary values at TWS. This position holds the primary responsibility of applying Third Wave System’s (TWS) solutions to metal cutting processes, working with customers, globally, to enable machining process and quality improvements, and deliver software systems support and training. This position will also work cross functionally with internal Product Management, Development and Product Quality teams to translate product needs, requests, and problems to internal requirements, provide technical assistance to the sales team, and provide feedback on product capabilities and new features. Additional career opportunities are nearly unlimited, as the company continues to grow rapidly.Technical Skills Writing production-ready code in Python for model training, applying coding and OOP best practicesDeveloping and delivering software using Python and various AI related libraries, such as TensorFlow, Seaborn, Numpy, Pandas, and more.Experience in feature engineering on complex data sets for better model feature learning.Strong ability to break down data science and ML concepts into non domain experts.Experience with creating the following ML techniques:Neural Networks (required)Regression Classification SVM (preferred)Random Forests (preferred)Reinforcement Learning (preferred)Boosting and Bagging (preferred)Verifying data quality, and/or ensuring it via data cleaningTraining models and tune their hyperparametersAnalyzing the errors of the model and design strategies to overcome themRequirements Must be able to demonstrate and exemplify Third Wave Systems Core Values:Driven, Takes Pride, Solutions Oriented, Critical Thinker, and CollaborativeBachelor’s or Master’s degree in Mechanical, Manufacturing, Industrial Engineering, or related fieldAbility to build relationships and work collaboratively across the organizationStrong written and oral communications skillsMotivated individual who is driven to make continuous improvementsExperience with Finite Element Modeling software is a plusAs many of Third Wave’s projects are export controlled, you must be a US citizen to apply\n"
}