{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-verneek-3590315335?refId=Z1PryRCVN6BSmXAXYHHhbA%3D%3D&trackingId=0b0fEIy4jq140LNPNM4ugA%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nDo you want to be part of the core team for building the next one-of-a-kind tech companies that can potentially change your career's trajectory?! We are striving to build the future of decision-making at Verneek. Come join us!If you are fed up with how little impact you are making at your current job despite all the hard work, if you are bored with your job where you cannot learn or innovate anymore, Verneek could be a perfect opportunity for you: a new deep-tech AI startup, where you'd get to learn, innovate, and leave your mark every single day.We are looking for a stellar & highly ambitious machine learning engineer as one of the first employees to help build complex AI/NLP models supporting the Verneek AI platform! You'll get to work on fundamental AI research problems, but all grounded within the scope of our particular AI platform. It'll be all much more rewarding and influential than working on narrow AI benchmarks! :)Every day, you'll get to solve very unique, highly complex, and socially impactful problems. This is an early-stage startup, so we'll be moving super-fast and there will be no legacy obstacles on your way to make a significant impact. Whatever you do every hour of every day counts!!ResponsibilitiesImplement, scale, and maintain complex AI/NLP models supporting the Verneek AI platformRequirementsMINIMUM QUALIFICATIONS BSc. degree in Computer Science or related fields3+ years of experience with Python3+ years hands-on experience developing architectures with machine learning frameworks such as Tensorflow/PyTorchDemonstrated AI/NLP engineering skillset through having deployed largescale AI/NLP systems to productionWork authorization in the USA at the time of hireContinuing work authorization during employment can be sponsored by VerneekPreferred QualificationsMSc. degree in Computer Science or related fieldsExperience in Natural Language Understanding, Dialogue Systems, Semantic Parsing, Transfer Learning and learning with limited dataBenefitsMedical, dental, vision, disability, and life insurance401K matching contributionsFlexible PTOCareer growth support through sponsoring learning opportunities and mentorshipAbout VerneekVerneek is an early-stage deep-tech AI startup, based in NYC, founded by a team of leading AI research scientists and backed by a group of world-renowned business and AI leaders. Verneek recently closed its first round of financing and is now hiring its first ten employees, with tremendous growth & leadership opportunities.Verneek MissionQuintillion bytes of data get generated every day!! Leveraging this data for data-informed decision-making for societal, personal, and business matters is more viable and crucial than ever. Verneek's mission is to enable anyone to make data-informed decisions, be personal or business, without needing to have any technical background.Verneek CultureYou can get a visual sense of our culture here: https://www.verneek.com/culture.It’s often hard to put “culture” into words. We all absolutely love what we do, care about each other, share all sorts of meals together, celebrate all kinds of events together, and work tirelessly with the excitement of making a difference through technical innovation. We are enjoying the journey, and going through all the ups and downs together.We are building a truly different kind of a company where we put the well-being, career growth, and overall happiness of our team as our north star, through which we can deliver on our highly ambitious mission. We are determined to make sure that every individual’s career and life goals will be well aligned with their role at Verneek. We are striving to hit a balance between each employees’ personal growth and their productivity in their role. We firmly believe that everyone can hit their productivity stride when they are learning and growing every single day, working towards meaningful goals; which is the case at Verneek.We are just getting started! The initial core Verneek team will be playing a crucial role in shaping the culture of the company moving forward. We are looking for highly ambitious individuals who can take the lead in driving various aspects of the company, and help us shape its lasting culture.\n      "
}