{
    "https://www.linkedin.com/jobs/view/data-scientist-at-clarifai-3641747341?refId=rDR1Iuew6VrPbwNDuJDLgw%3D%3D&trackingId=fU4jl2K8HKeTrvvSGbsk9A%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout The CompanyClarifai is a leading, full-lifecycle deep learning AI platform for computer vision, natural language processing, LLM's and audio recognition. We help organizations transform unstructured images, video, text, and audio data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States, Canada, Argentina, India and Estonia.We have raised $100M in funding to date, with $60M coming from our most recent Series C, and are backed by industry leaders like Menlo Ventures, Union Square Ventures, Lux Capital, New Enterprise Associates, LDV Capital, Corazon Capital, Google Ventures, NVIDIA, Qualcomm and Osage.Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce.Your ImpactYou will be responsible for the development of custom models to solve real world problems for business and expand Clarifai's presence in the rapidly expanding AI solutions space.The OpportunityYou will manage the development of labeled data sets Develop machine learning models Be responsible for the machine learning model performanceDocument the development of modelsSupport client engagements for creating custom modelsRequirementsMachine learning development experiencePython scripts and Jupyter notebook experienceSQL programming experienceTechnical writing skillsData Science analysis experienceCloud computing skills (AWS, GCP)College degree BS (computer science, math, physics)Individual must be in the greater DMV (DC, Maryland, Virginia) areaGreat to HaveMaster of Science degree or higher Experience with JupyterLabOpen source development experienceGithub\n"
}