{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-scientist-protein-design-at-biomap-3641798169?refId=PmA3rSF8%2BZMST6Mqb3HWGQ%3D%3D&trackingId=KcwHqGRt%2BkPhljeb7B%2FYqQ%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        BioMap is a platform company that integrates AI technology with cutting-edge biotechnology. We are committed to achieving breakthroughs in target discovery and drug design, and bringing global first-in-class medicine for unmet medical needs in the areas of immune-oncology, autoimmune diseases, fibrosis, and aging-related diseases.Location: Menlo Park. This role is preferably based in The Bay Area, but we are open to discussing other locations in the United States.Keywords: drug/protein design, structural biology, computational biology, protein folding, protein design, protein-ligand interactionYou will:Utilize bioinformatics tools into drug/protein design workflow and develop computing protocols for drug/ protein design Transforming research work research, open-source models, and prototypes into production-level pipelineDesign and apply innovative computational/ statistical algorithms (including classic, statistical, ML, and AI techniques) to generate actionable biological insightWork closely with the department lead to design and optimize protein design-related algorithms Requirements:PhD degree with research experience in bioinformatics, protein folding, protein design, protein-ligand integration is highly preferred; Or MS degree in computational biology, structural biology, or related fields, plus 2+ years of industry experienceProficient in at least one programming language, including but not limited to Python, C/C++, Java, etc. Familiar with machine learning and deep learning frameworks (e.g. Pytorch, Tensorflow, etc.)Familiar with Alphatfold, ESMfold, RFdesign, and ProteinMPNNGreat communication skills, including code documentation, oral presentation, with excellent attention to details What we offer:The opportunity to work on high-impact tools and products that are immediately deployed to accelerate the discovery of new medicinesA strong team in AI, software, and biochemistryCompetitive salary and equity401(k) plan with generous employer matching for contributionsExcellent medical, dental, and vision coverageDaily lunch and a full snack stationCommuter benefitsBioMap is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n      "
}