{
    "https://www.linkedin.com/jobs/view/senior-research-scientist-vision-and-language-at-tiktok-3608967328?refId=V4cSrEECU0o9AhNlfvudlQ%3D%3D&trackingId=%2BCfdcEdP1qG1%2BTIx7AaD%2FQ%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nResponsibilities TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.Why Join UsAt TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.About the TeamOur team's mission is to empower content understanding and creation using CV/NLP related technologies. We focus on cutting-edge R&D in areas like multi-modal understanding, vision and language, foundation models, audio/music understanding and generation with an emphasis on content creation. The team is a mix of experienced research scientists and research engineers, aiming to push the research boundaries in multi-modality and applying our research results to improve the experience of TikTok users.Responsibilities- Conduct cutting-edge research and development in computer vision and natural language processing, especially in the areas of multi-modality, vision and language, etc.- Publish our latest research results, and help to build our brand in the research community.- Transfer our research results to product applications, and explore new product ideas with CV/NLP at its core. Qualifications - Research and engineering experience in one or more areas of computer vision and natural language processing, including but not limited to  - Experience in multi-modal understanding, vision and language, such as video captioning, VQA, Text-to-video retrieval, and other related topics.  - Work with very large-scale datasets, and build very large-scale datasets to scale up foundation models.  - Experience with language models and apply them in various downstream tasks.  - Experience in audio/music understanding and generation.- Preferring candidates with publications in top-tier venues such as CVPR, ECCV, ICCV, NeurIPS, ICLR, ICML, EMNLP, ACL, COLING, etc- Highly competent in algorithms and programming; Strong coding skills in Python and popular deep learning frameworks.- Work and collaborate well with team members.- Ability to work independently; Strong communication skills.TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.TikTok is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at terra.vo@tiktok.com Job Information:【For Pay Transparency】Compensation Description (annually) The base salary range for this position in the selected city is $187040 - $280000 annually.​Compensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and restricted stock units.​At ByteDance/TikTok our benefits are designed to convey company culture and values, to create an efficient and inspiring work environment, and to support ByteDancers to give their best in both work and life. We offer the following benefits to eligible employees: ​We cover 100% premium coverage for employee medical insurance, approximately 75% premium coverage for dependents and offer a Health Savings Account(HSA) with a company match. As well as Dental, Vision, Short/Long term Disability, Basic Life, Voluntary Life and AD&D insurance plans. In addition to Flexible Spending Account(FSA) Options like Health Care, Limited Purpose and Dependent Care. ​Our time off and leave plans are: 10 paid holidays per year plus 17 days of Paid Personal Time Off(PPTO) (prorated upon hire and increased by tenure) and 10 paid sick days per year as well as 12 weeks of paid Parental leave and 8 weeks of paid Supplemental Disability. ​We also provide generous benefits like mental and emotional health benefits through our EAP and Lyra. A 401K company match, gym and cellphone service reimbursements. The Company reserves the right to modify or change these benefits programs at any time, with or without notice.​\n"
}