{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-tiger-analytics-3590300816?refId=re%2Bv3Q%2FeG4e%2B6MGEAWh2Ww%3D%3D&trackingId=%2B7m4BpDz18Oibk2WtYecmg%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Tiger Analytics is looking for experienced Machine Learning Engineers to join our fast-growing advanced analytics consulting firm. Our employees bring deep expertise in Machine Learning, Data Science, and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner.We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world. You will be responsible for:Providing solutions for the deployment, execution, validation, monitoring, and improvement of data science solutionsCreating Scalable Machine Learning systems that are highly performantBuilding reusable production data pipelines for implemented machine learning modelsWriting production-quality code and libraries that can be packaged as containers, installed and deployedYou will collaborate with cross-functional teams and business partners and will have the opportunity to drive current and future strategy by leveraging your analytical skills as you ensure business value and communicate the results.RequirementsBachelor's degree or higher in computer science or related, with 5+ years of work experienceAbility to collaborate with Data Engineers and Data Scientists to build data and model pipelines and help run machine learning tests and experimentsAbility to manage the infrastructure and data pipelines needed to bring ML solutions to productionEnd-to-end understanding of applications being createdAbility to maintain scalable machine learning solutions in productionAbility to abstract the complexity of production for machine learning using containersAbility to troubleshoot production machine learning model issues, including recommendations for to retrain and revalidateExperience with Big Data Projects using multiple types of structured and unstructured dataAbility to work with a global team, playing a key role in communicating problem context to the remote teamsExcellent communication and teamwork skillsAdditional Skills RequiredPython, Spark, Hadoop, and Docker with an emphasis on good coding practices in a continuous integration context, model evaluation, and experimental designKnowledge of ML frameworks like Scikitlearn, Tensorflow, and KerasKnowledge of MLflow, Airflow, and KubernetesExperience with Cloud environments and knowledge of offerings such as AWS SageMakerProficiency in statistical tools, relational databases, and expertise in programming languages (Python/SQL)BenefitsThis position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility.\n"
}