{
    "https://www.linkedin.com/jobs/view/data-scientist-at-tubi-3626165537?refId=rmg%2Bzagddt8Rr1uLJ5Xz4Q%3D%3D&trackingId=aQJ8ZdoNhk2l6K1tNaMbyw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Join Tubi (www.tubi.tv), Fox Corporation's premium ad-supported video-on-demand (AVOD) streaming service leading the charge in making entertainment accessible to all. With over 50,000 movies and television shows, including a growing library of Tubi Originals, 200+ local and live news and sports channels, and 455 entertainment partners featuring content from every major Hollywood studio, Tubi gives entertainment fans an easy way to discover new content that is available completely free. Tubi's library has something for every member of our diverse audience, and we're committed to building a workforce that reflects that diversity. We're looking for great people who are creative thinkers, self-motivators, and impact-makers looking to help shape the future of streaming.Job Duties:Tubi, Inc. seeks a Data Scientist to work cross-functionally with Product, Engineering, Content, Growth, and Business/Executive teams to ensure that all major decisions are data-driven. Specific duties include: 1) Uncover insights to ensure data-driven decision-making. 2) Build statistical, forecasting, and machine learning models to solve business problems. 3) Build and maintain high-quality data infrastructure that is easily used by less technical audiences. 4) Collaborate closely with product managers and engineers to help drive new product features through AB testing/experimentation. 5) Contribute to Tubi’s continually evolving experimentation pipeline. 6) Visualize and communicate insights to business stakeholders. 7) Collaborate closely with Product Managers and Engineers to help drive new product features. 8) Work cross-functionally with other teams to help drive business impact: Ads, Content, Business Operations, and Growth. 9) Combine statistical rigor with creative problem-solving to bring value to the team and organization. 10) Help build a data culture that values reproducible work, better tooling, and improved processes. 12) Help contribute to a positive data science learning environment that includes quarterly paper brackets and hackathons. Telecommuting permitted from any location in the U.S.Job Requirements:Requires a Bachelor’s degree in Mathematics, Statistics, Computer Science or related field, plus two (2) years of data science or related experience in database engineering, including experience in inferential modeling, experimentation, visualization and analysis; product analytics; SQL and Python; building dashboards; identifying and defining KPIs; and working with event-dataSpecific skills: Also requires experience or knowledge in the following: 1) Knowledge of machine learning algorithms; 2) Experience in Git, Jupyter Notebooks, Periscope or Tableau; 3) Experience in DBT (data build tool) or Airflow; 4) Experience working with multiple teams such as Product, Engineering, Revenue, Content, Growth and Business; and 5) Knowledge of the video streaming industryAny level of experience or knowledge in the specific skills is acceptable.Telecommuting permitted from any location in the U.S.Pursuant to state and local pay disclosure requirements, the pay range for this role, with final offer amount dependent on education, skills, experience, and location is: $167,440.57 - $174,000 per year. This role is also eligible for various benefits, including medical/dental/vision, insurance, a 401(k)plan, paid time off, and other benefits in accordance with applicable plan documents. Benefits for Union represented employees will be in accordance with the applicable collective bargaining agreement.Tubi is a division of Fox Corporation, and FOX Employee Benefits summarized here, covers the majority of all US employee benefits. The following distinctions below outline the differences between the Tubi and FOX benefits:For US-based non-exempt Tubi employees, the FOX Employee Benefits summary accurately captures the Vacation and Sick TimeFor all US-based employees, Tubi offers 12 paid \"Tubi Holidays\" in addition to the 11 FOX Corporate Company paid holidaysFor all salaried/exempt employees, in lieu of the FOX Vacation policy, Tubi offers a Flexible Time off Policy to manage all personal mattersFor all full-time, regular employees, in lieu of FOX Paid Parental Leave, Tubi offers a generous Parental Leave Program, which allows parents twelve (12) weeks of paid bonding leave within the first year of the birth, adoption, surrogacy or foster placement of a child. This time is 100% paid through a combination of any applicable state, city, and federal leaves and wage-replacement programs in addition to contributions made by TubiFor all full-time, regular employees, Tubi offers a monthly wellness reimbursementTubi is proud to be an equal opportunity employer and considers qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition, or disability. Pursuant to the San Francisco Fair Chance Ordinance, we will consider employment for qualified applicants with arrest and conviction records. We are an E-Verify company.\n"
}