{
    "https://www.linkedin.com/jobs/view/data-scientist-at-cydcor-3642356431?refId=nIy%2F2o%2BQN4EuOHY21yKA7g%3D%3D&trackingId=6hxypJ3%2FmtHBmJ4aKSzQ3Q%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob SummaryWe are seeking a talented and experienced Senior Data Scientist to join our organization. The successful candidate will be responsible for collecting and analyzing sales data from multiple campaigns, including door-to-door, retail, and business-to-business, to generate accurate and insightful forecasts of expected sales revenue. Additionally, the candidate will play a pivotal role in leading a small team of Financial Planning and Analysis (FP&A) professionals. The ideal candidate has a strong background in data analysis, statistical modeling, team management, and excellent communication and presentation skills.Responsibilities Sales Data Collection and Analysis:Collect, clean, and analyze sales data from various campaigns to identify patterns, trends, and key insights.Develop and implement data collection strategies to ensure comprehensive and accurate data acquisition.Utilize advanced statistical techniques and predictive modeling to forecast sales revenue for multiple campaigns.Collaborate with cross-functional teams, such as marketing and finance, to gather relevant data inputs for analysis. Sales Revenue Forecasting:Build robust models for analyzing expected sales revenue, sales quality, and recruiting headcount based on historical data and campaign-specific variables.Continuously refine and improve forecasting models by incorporating new data sources and leveraging industry best practices.Evaluate model performance and accuracy, and make recommendations for model enhancements and adjustments as needed.Provide clear and actionable insights to the executive team based on sales revenue forecasts, assisting in strategic decision-making.Develop and maintain financial and not financial models and tools to support sales forecasting, scenario analysis, and decision making Team Leadership:Lead and mentor a small team of FP&A professionals, providing guidance, support, and development opportunities.Set performance goals and objectives for the team, ensuring alignment with the organization's overall goals.Foster a collaborative and innovative work environment, encouraging knowledge sharing and cross-functional collaboration.Conduct regular performance evaluations and provide constructive feedback to team members, promoting their growth and development. Communication and Presentation:Prepare and deliver comprehensive reports and presentations to the executive team, summarizing sales revenue forecasts and key findings.Effectively communicate complex data-driven insights in a clear and concise manner to stakeholders at various levels of the organization.Collaborate with business partners to understand their requirements and translate them into actionable data analysis and reports.Stay up-to-date with industry trends, advancements in data science, and emerging technologies relevant to sales revenue forecasting.QualificationsMaster's degree or Ph.D. in a quantitative field such as Data Science, Statistics, Mathematics, or related disciplines. A combination of education and relevant experience will also be considered.Proven experience as a Data Scientist or similar role, with a focus on sales data analysis and forecasting.Strong proficiency in data analysis and statistical modeling, utilizing tools such as Python, R, or SQL.Proficiency in machine learning techniques and algorithms.Solid understanding of data visualization concepts and experience with visualization tools (e.g., Tableau, Power BI).Excellent leadership and team management skills, with the ability to motivate and develop a small team of professionals.Strong business acumen and the ability to translate data insights into actionable recommendations for executive decision-making.Exceptional communication and presentation skills, with the ability to convey complex concepts to non-technical stakeholders.Strong problem-solving skills, attention to detail, and the ability to work effectively in a fast-paced and dynamic environment.Six Sigma Certification preferred\n"
}