{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-loop-3641787036?refId=GwK0uOEFnu79spJndcg3ng%3D%3D&trackingId=w71rNjQrqaa8tThrRVnb%2Fg%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout LoopLoop's mission is to simplify logistics payments. Loop is a connected finance platform to enable frictionless payments for one of the world's largest industries – logistics. Shippers, carriers and 3pls that onboard to Loop eliminate painful billing and payment errors – resulting in spending 4% less and an 80% increase in back office productivity. Loop's new logistics payment platform won't just change how people pay. It's going to fundamentally move logistics forward.Loop has a product-obsessed team that enjoys building core infrastructure that impacts everyone. Investors include Index Ventures, Founders Fund, 8VC, Susa Ventures, Flexport, and 50 industry leading angel investors. The team is made up of talented individuals from technology companies like Uber, Google, Flexport, Intuit and Rakuten – as well as traditional logistics companies like CH Robinson.Techcrunch article about Loop.About YouIn this role, you would be responsible for building the foundational Machine Learning infrastructure. Your first focus would be leveraging NLP/CV techniques to digitalize and understand documents. You would also extend the machine learning platform to other areas,. This is a green field project, so you would have the opportunity to architect the machine learning system from scratch! You'll be working closely with our CTO and Customer Success team on this key initiative for the company.ResponsibilitiesBuild end-to-end machine learning projects from ideation to productionDesign and implement data infrastructure to apply CV/NLP techniques to extract and normalize document data. Work closely with the engineering team for deploying and monitor deep learning modelsMeasure and improve human-in-the-loop annotation data qualityResearch the state-of-the-art scientific literature in information extraction for a better understanding of all types of complex documentsPrototype and develop algorithms using advanced deep learning techniques for document understandingExtend machine learning platform to other areas, such as workflow automation, fraud detection, risk evaluationQualifications1+ years of hands-on professional experience in designing and building production-grade solutions in one or more of the following areas: Optical character recognition, named entity recognition, document classification, key information extraction, document layout analysis, document question answering, table detection1+ years of hands-on experience in deep learning frameworks (e.g., PyTorch, Tensorflow, etc.)Experience in implementing state-of-the-art products in neural networks using CNN, LSTM-RNN, Transformer, or similarExperience in cloud environments (AWS, Google, Azure)Proficient in PythonBonus points3+ years of experience with NLP models and libraries such as Huggingface, BERT, GPT, etc. is a plus5+ years of experience in computer vision is a plusRelevant PhD or master's degree is a plusCompensationBase pay 120k - 190kBenefits & PerksPremium Medical, Dental, and Vision Insurance plansInsurance premiums covered 100% for youUnlimited PTOFireside chats with industry leading keynote speakersOff-sites in locales such as Napa and TahoeGenerous professional development budget to feed your curiosityPhysical and Mental fitness subsidies for yoga, meditation, gym, or ski memberships\n"
}