{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-tavus-3603332905?refId=Z1PryRCVN6BSmXAXYHHhbA%3D%3D&trackingId=jkcTnBymhJuCVAmyTBOaQA%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Backed by Sequoia, Y-Combinator, and other top valley firms, our team is revolutionizing modern marketing and product experiences. Tavus is a leading AI synthetic media startup focused on making personalized video experiences scalable. Tavus uses artificial intelligence deepfake technology to generate realistic videos that perfectly imitate customer's gestures and voice- it's pretty stellar. Think Loom or Vidyard, but you can create thousands of hyper-personalized videos with the click of a button. Check it out for yourself 😎We’re looking for a Machine Learning Engineer to join our core AI team. Our ideal partner-in-crime works well in startup environments, is comfortable prioritizing for themselves, and is always down to take calculated risks. We’re moving fast and not looking for people to come along for the ride - we’re looking for people to pave the path.Please note that this is a fully remote position Your Mission 🚀R&D to continuously improve existing generative AI modelsAssist in ML Ops for scaleable deploymentsExplore new ideas by running experiments and testing new AI advancementsStaying relevant with the latest advancements in your specialtyRequirementsIntrinsic motivation and the drive to solve difficult problems without guidanceA passion for the AI field and keeping up to dateAbility to prioritize in a chaotic and ambiguous environment, while moving fastExperience in at least one area of generative AI (LLMs, Audio, Video)Additionally, having some of the following experiences may help you be successful in this position:Experience owning the model development cycle end to end, from idea to production to iteratingKnowledge of best practices in Software DevelopmentPast publications are nice to have but not requiredHas played Portal 1 and 2 (if not you'll need to play as part of onboarding 😄)BenefitsWhen you join Tavus, you’re joining a family. Our work is driven by our team, and our success is shared by all. This remote position has a flexible work schedule (currently we’re all fully remote!), unlimited PTO, competitive healthcare and gear stipends, as well as, of course, plenty of fun! At the end of the day, we want Tavus to be a place for you to learn, directly drive impact, and be with a team you love.To learn more about our team culture, and benefits, check out our hiring page!Tavus is growing fast, and we’d like you to grow with us! Are you excited to get your hands dirty and join the digital marketing revolution? Drop your resume and we’ll be in touch!We are not looking for cultural fits, we are looking for culture creators. In fact, diversity is what drives our success – it’s at the core of how we hire, communicate, and work. We are inclusive to all and combine our diverse backgrounds, skill sets, and thinking to build the best experiences for our clients.\n      "
}