{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-machinify-inc-3616915972?refId=QKAQEHH1uukX1d2PNKU%2BHw%3D%3D&trackingId=Bjiyj5FcGKM%2BQdR9V6UBAw%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Machinify is a revolutionary healthcare software company with a mission to ensure that patients get the right medical treatment, at the right time, at the right price. Our cloud-based Machinify AI platform leverages the latest advances in machine learning, large language models, data analytics, and cloud processing to solve previously intractable problems, transforming healthcare administration and payment operations.Our team has deployed models that check for anomalies in medical claims, predict the trajectory of care of a particular patient and the next likely treatment and even “read and understand” medical record documents using state-of-the-art NLP and computer vision techniques to assist clinicians. There are many more such problems to be solved. So if you are looking for a place where you can apply your expertise in AI/ML to solve real problems and make a difference in an industry that impacts millions of lives while accelerating your career, you’ll love Machinify. We are seeking a Sr Machine Learning Scientist to join our team.What you’ll do:Advance Machinify’s capabilities to model and understand medical decisions which will power a range of products in the claims processing space. Make thoughtful decisions around which methods/algorithms are likely to work well in solving the business problem at handConsider the quality of the available input data and build robust systems that will work well in the presence of noise/errorsMeasure the model output in practical real-world settings and iterate your approach Learn about the healthcare industry and become an expert over timeWhat You Bring:You enjoy solving real-world business problems by developing, from scratch, ML models and deploying them in production - and have been doing that successfully for a while. You are comfortable measuring and optimizing the direct business impact of your work. You are interested in learning about the healthcare industry and helping us improve the care millions of people receive. You are scrappy, and love solving hard problems that matter. You are experienced with SQL, handling large-scale data, and are comfortable with at least one programming language (Python, R, etc.). You have experience building ML models using modern ML approaches like Neural Nets or Tree-ensembles from scratch for new applications - making decisions relating to which supervised labels to use, the metric to optimize for, and the features likely to be useful. You are a critical thinker who can be strategic without losing attention to detail. You are comfortable taking the initiative and owning projects from start to finish. You can build positive relationships based on trust and value delivered. The base salary for this position will vary based on an array of factors unique to each candidate such as qualifications, years and depth of experience, skill set, certifications, etc. The base salary range for this role is $180k-250k. We are hiring for different seniorities, and our Recruiting team will let you know if you qualify for a different role/range. Salary is one component of the total compensation package, which includes meaningful equity, excellent healthcare, flexible time off, and other benefits and perks.Equal Employment Opportunity at MachinifyMachinify is committed to hiring talented and qualified individuals with diverse backgrounds for all of its positions. Machinify believes that the gathering and celebration of unique backgrounds, qualities, and cultures enriches the workplace.\n"
}