{
    "https://www.linkedin.com/jobs/view/data-scientist-2022-0226-at-acclaim-technical-services-3582723550?refId=8b31Q1WL6oilrCVg6%2F%2Bjfg%3D%3D&trackingId=o%2BvwX9vHUCltZTZdI4gY8Q%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Acclaim Technical Services, founded in 2000, is a leading language and intelligence services company supporting a wide range of U.S. Federal agencies. We are an Employee Stock Ownership Plan (ESOP) company, which is uncommon within our business sector. We see this as a significant strength and it shows: ATS is consistently ranked as a top workplace among DC area firms and continues to grow.We are currently hiring a Data Scientist with TS/SCI clearance and polygraph in our Enterprise Services & Solutions Division in the Annapolis Junction, MD area.ResponsibilitiesDesigning / implementing machine learningData scienceAdvanced analytical algorithmsProgramming (skill in at least one high-level language (e.g., Python))Statistical analysis (e.g., variability, sampling error, inference, hypothesis testing, EDA, application of linear models)Data management (e.g., data cleaning and transformation)Data miningData modeling and assessmentArtificial intelligence, and/or Software engineeringRequired Education & ExperienceMust possess an active TS/SCI clearance with polygraphExperience in one or more area is strongly preferred; Bachelor’s degree and 8 years of relevant experience. Associate’s degree and 12 years of relevant experience may be considered for individuals with in-depth experience that is clearly related to the position.Degree must be in:MathematicsApplied MathematicsStatistics/Applied StatisticsMachine LearningData ScienceOperations ResearchComputer Science A broader range of degrees will be considered if accompanied by a Certificate in Data Science from an accredited college/university.Equal Employment Opportunity / Affirmative ActionATS is committed to a program of equal employment opportunity without regard to race, color, ethnicity, national origin, ancestry, citizenship, sex, pregnancy, marital status, sexual orientation, gender identity, age, religion/creed, hairstyles and hair textures, handicap/disability, genetic information/history, military/veteran status, or any other characteristic or condition protected by federal, state or local law. It is the policy of ATS not merely to refrain from employment discrimination as required by the various federal, state, and local enactments, but to take positive affirmative action to realize for women, people of color, individuals with disabilities and protected veterans full equal employment opportunity. We support the employment and advancement in employment of individuals with disabilities and of protected veterans, and we treat qualified individuals without discrimination on the basis of their physical or mental disability or veteran status.Powered by JazzHRVp6pMnmmTo\n      "
}