{
    "https://www.linkedin.com/jobs/view/data-scientist-product-growth-at-discovery-education-3638688017?refId=olkH4qxCqGJl6H45zFuXEw%3D%3D&trackingId=BMql9E1Fvm5iF72B4L57FA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Discovery Education is looking for a Data Scientist, Product Growth to join our Product team. At Discovery Education, we are dedicated to creating exceptional educational resources that inspire students and teachers. As a Data Scientist on the Product Growth team, you will play a crucial role in guiding product development by utilizing advanced statistical modeling, predictive analytics, rigorous measurement (A/B testing), and machine learning techniques. You will become an expert on our users, empowering data-informed decision making and helping us develop the frameworks for understanding and accelerating the company’s growth. The Growth team, which sits within the Research and Analytics vertical, collaborates cross-functionally with product managers, user researchers, designers, engineers, and data analysts to drive product growth. We encourage applicants from non-traditional backgrounds to apply, so please don't be discouraged by the requirements list.This is a remote role. What You Will DoCollaborate closely with product managers to design, analyze, and interpret A/B tests that help address strategic questions regarding product UX changes. Develop predictive models to gain insights into user activation, engagement, and retention. Think creatively & proactively to identify and size new opportunities within Discovery Education’s long term strategic roadmap. Conduct machine learning or statistical analyses, and build pragmatic, scalable, and statistically rigorous solutions to deliver actionable insights, accurate predictions, and effective optimizations. Build data products and analytical frameworks that accelerate and scale insights delivery. Work with engineers to log new data sources and track events as we build new features. Contribute to our data pipeline and analytics infrastructure by building curated data models in Snowflake and dbt. Help establish a culture of data-driven product development by fostering cross-functional partnerships and effectively communicating research insights & best practices. Requirements4+ years experience in a quantitative role, such as a product analyst, researcher, or as part of a PhD program in a quantitative field. Proposed, designed, and executed rigorous experiments with clear insights and actionable recommendations. A strong desire to deliver strategic insights at a high level, while simultaneously being the subject matter expert over the technical details.An intuition for applying quantitative models to uncover user pain points and identify patterns.Familiarity with usage metrics relating to acquisition, activation, engagement, & retention, and/or have experience with user segmentation, recommendations, and personalization.Experience with modern data tech tools such as SQL, Python/R, dbt, GitHub, Snowflake, and/or Segment.Comfort navigating ambiguous problems and environments while remaining proactive and focused on goals.Excellent communication skills with the ability to effectively interact with product managers, engineers, and executives.Legal right to work in the United States.You are a great fit if you have:Demonstrated experience in mining structured or unstructured data to build predictive models using machine learning, deep learning, or natural language processing techniques. Strong programming background, with the ability to run simulations, prototype variants, or contribute to production codebases. Experience validating quantitative insights with qualitative methods (e.g., surveys, UXR). Experience running A/B tests with modest sample sizes, strong seasonality, novelty effects, or involving hierarchical statistical models. Familiarity with cloud computing tools (e.g. AWS S3, Lambda, & SageMaker) Experience with product-led growth or SaaS enterprise models. A strong desire to learn any of the above skills and techniques. BenefitsFlexible PTO.Paid holidays include Thanksgiving, Christmas, and New Year’s Eve.Generous parental leave.Annual education and professional development dollars.Major medical, vision, and dental (multiple choices).Summer hours and company recharge days.Company-paid life insurance and short- and long-term disability.Pet insurance.Company paid volunteer hours.Discovery Education is an equal opportunity employer. Discovery Education is committed to being an employer of choice, not just a good place to work, but a great and inclusive place to work. To that end, we strive to recruit and maintain a workforce that meaningfully represents the diverse and culturally rich communities that we serve. Qualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, sexual orientation, gender identity, protected veteran status or disabled status or, genetic information.\n"
}