{
    "https://www.linkedin.com/jobs/view/computational-scientist-ii-at-broad-institute-of-mit-and-harvard-3591269645?refId=8B7jt77PBASrk1HBD%2BJ1Iw%3D%3D&trackingId=kDykuaw6DfBXIWBXKv4A9w%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob DescriptionThe Talkowski laboratory in the Center for Genomic Medicine (CGM) at Massachusetts General Hospital (MGH) and Harvard Medical School, and the Broad Institute is seeking exceptional computational scientist candidates. We are seeking a candidate to perform genomics research across a spectrum of population genetics, disease association, and functional genomics studies. Successful candidates are expected to excel at critical thinking, be quick learners for new analytical approaches, and capable of applying or developing novel computational methods for solving complex problems.The Talkowski Lab is comprised of an interdisciplinary group of scientists, technicians, bioinformaticians, computational biologists, and postdoctoral fellows who work together in a mutually supportive and respectful environment. Ideas are freely shared, and contributions are highly valued. We are dedicated to the characterization of genomic variation contributing to human disease, with a focus on the relationship between genome structure and function. The lab integrates molecular and computational genomics methods to investigate the genetic architecture of neuropsychiatric disorders, as well as to develop new technologies for translational applications in genetic diagnostics. The lab has represented a hub of novel gene and variant discovery and functional genomics modeling in common complex and rare Mendelian disorders.The successful candidate will have a deep background and track record in mathematics, programming, and data science; and the curiosity and will to bridge domains in a highly interdisciplinary environment. They will seek to understand what models and tools would drive progress on core scientific questions, and lead the effort to develop and apply them, and collaborate on publishing and presenting the work.Key ResponsibilitiesDevelop, implement, and apply computational tools on genomic datasets.Work closely with biologists to interpret and understand the data.Regularly attend and present results at team meetings to share results, plan projects and experiments and to ensurecontinuous communication around methods and tools developed.Prepare high-quality publications and oral presentations.Proactively bridge scientific communities.RequirementsPhD in Mathematics, Statistics, Computer Science, Physics, Biology or a related quantitative discipline.2-4 years of experience developing theory and applications to solve challenging real-life data science problems.Proficiency with coding in Python, MatLab, Unix/Linux, Java, C++, or R.Experience with designing computational methods and tools.Prior knowledge of neuroscience and/or neurodegenerateive disease biology is preferred, but not required.Excellent oral and written English communication skills.Ability to work independently and with a team.All Computational Scientists at Broad are encouraged to continue their technical growth by engaging with the widercomputational community through Broad's vibrant Models, Inference & Algorithms Initiative (broadinstitute.org/mia).LC-2023All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.EEO is The Law - click here for more informationEqual Opportunity Employer Minorities/Women/Protected Veterans/DisabledCheck out this video for a look into our community!\n"
}