{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-refuel-3566969247?refId=A%2FSN5TMHVR4YWTGY1aIA1A%3D%3D&trackingId=a%2BCXagKbxIVf74hrne6edw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Refuel.aiThe MissionThe next wave of ML applications (video security, conversational AI and autonomous vehicles) is going to look very different from the last one (search and recommender systems). Teams working in these domains have to deal with large streams of unstructured data (images, video, text and audio), exorbitant labeling costs, and broken feedback loops. For this next wave of ML applications, getting to production takes months and adapting to the long tail is an existential struggle. That’s what we’re solving - Refuel.ai accelerates time to production for ML applications built on top of unstructured data, and enables them to continually improve in the real world.The teamRefuel.ai was founded in 2021 by Rishabh Bhargava and Nihit Desai. Our founders bring machine learning and product experience from the world's leading technology companies (Facebook, Instagram, Primer.ai and Cloudera) and institutions (Stanford, Cambridge and UIUC). We are backed by General Catalyst, XYZ Ventures and a host of successful and influential angel investors from places like Stanford, OpenAI, Datadog and Facebook.What you will doDevelop the core machine learning algorithms powering our platform, in domains such as representation learning, clustering and outlier detection in high dimensional spaces, improving label quality in real-world datasets, and active learning. Keep up with state-of-the-art research in machine learning for content understanding. Apply state of the art deep learning models developed internally and from the research community to solve problems for our customersWork closely with the rest of our engineering and design teams to identify feature and scalability improvements to our product. Help define and evolve our engineering stack as we scale the productHelp us hire a world-class team and mentor new team membersYou will be a great fit if you haveExperience building ML applications for unstructured data (image, video, text, audio streams) including data collection, model development and deploymentFamiliarity with Python programming language. Hands-on experience with at least one of the popular deep learning frameworks like PyTorch and TensorFlow is a big plusStrong communication skills and enjoy working in a collaborative environment. We encourage open discussion and want the best ideas to winA curiosity about the early startup and company building journeyBonus: experience working with Machine learning stack in AWS, or published research in machine learning or related fields at conferences/journalsOur current tech stackInfrastructure - AWS + Serverless + Kubernetes + secret sauce infra to power modern MLBackend - Python + FastAPI + Postgres + DynamoDBFrontend - React + TypescriptWhat we offerWe have raised funding from top-tier investors, including General Catalyst, XYZ Ventures and a host of successful angel investors from places such as Stanford, OpenAI, Facebook and Datadog. We will offer a competitive salary and meaningful equity in the company.Most importantly, you will have the opportunity to create a massive impact on the product and company as a member of our early team. We care a lot about making a difference for our customers while working on a team where we are empowered to do the best work of our lives.\n      "
}