{
    "https://www.linkedin.com/jobs/view/data-scientist-at-mercedes-benz-research-development-north-america-inc-3619199491?refId=HNA7eAbYte%2FkSG0EPmCO3g%3D%3D&trackingId=UrtYm3%2B78vWStKvd51xh2A%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Embedded in a worldwide network Mercedes-Benz Research & Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Farmington Hills, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.With the number of connected Mercedes-Benz vehicles on the road increasing daily, the amount of data being generated and its significance is also increasing rapidly. The data and AI team is looking for passionate and versatile Engineers and Data Scientists to support with the collection and analysis of data from Mercedes-Benz Vehicles. As a Data Scientist on the team, you'll be working on projects that will directly influence corporate strategy and future product development. Versatility, adaptability, and an inquisitive approach to problem solving make for an ideal candidate. In this role, you’ll be on the front-lines of an interdisciplinary team of engineers and data scientists and together, you will use data to shape the future of Mercedes-Benz.Job ResponsibilitiesCollaborate directly with stakeholders and subject-matter experts to define use-cases and identify relevant data sourcesAnalyze available (historical) data and create reports and drive and enhance internal business intelligence and data-driven decision making to the betterment of our customers’ experiencesWhere applicable, use data visualizations to help demo and explain insights to key stakeholders and managementDevelop predictive models and new algorithms that can be used in next-generation vehicle features and servicesMinimum QualificationsBA/BS in Computer Science, Math, Statistics, Physics or other relevant technical fieldDemonstrable programming experience with at least two of the following languages: Python, Java, Scala, R, Ruby, GoSolid knowledge and experience with a scientific computing platform (e.g. scikit learn, Weka, MATLAB)Hands-on experience with visualization tools (e.g. PowerBI, Tableau) and an acute ability to prepare and present data in a visually appealing and easy to understand mannerExperience working with common DBMS (SQL, NoSQL), as well as cloud systemsStrong knowledge of statistical data analysisHigh-level understanding of machine learning techniques, e.g. SVM, regression, classification, clustering, time series, deep learningA strong voice for data integrity and reporting quality utilizing best-practices and industry standardsExcellent critical thinking, problem solving and analytical skillsExcellent communication skills, and the ability to work effectively with othersValid Driver’s LicensePreferred QualificationsAbility to work with Linux-based systems and command-line toolsPrevious experience working with geospatial data is a plusAutomotive experience is a plusExperience in experimental design and analysis (e.g., A/B and market-level experiments)Additional InformationThe successful candidate’s starting pay will be determined based on a wide range of factors, including, but not limited to, job-related education, skills, and experience, geographic location, and market conditions. The current salary range for this position is as follows and may be modified in the future: $122,700 - $153,400.Why should you apply?Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.Benefits for Full-Time* Employees Include: Medical, dental, and vision insurance for employees and their families 401(k) with employer match Up to 18 company-paid holidays Paid time off (unlimited for salaried employees), sick time, and parental leave Tuition assistance program Wellness/Fitness reimbursement programs Vehicle lease subsidy or company car (for eligible employees only) Internships excluded from Full-Time Employee benefitsMBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce. MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.Mercedes-Benz Research and Development North America, Inc.PRIVACY NOTICE FOR CALIFORNIA RESIDENTShttps://mbrdna.com/california-employee-privacy-notice/\n      "
}