{
    "https://www.linkedin.com/jobs/view/data-scientist-crypto-at-the-tie-3634683031?refId=%2FeQxbZt6xIz1kSqA4mQ2Wg%3D%3D&trackingId=8SoXITiE0H%2BIOw2gmAVI4g%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        The Tie is the leading information services provider for digital assets. We help businesses in the cryptocurrency industry act on market-moving information faster through our leading institutional data terminal - Tie Terminal - and our proprietary social sentiment, blockchain data, and news feeds. Our clients include leading hedge funds, trading venues, market makers, tokens issuers, and other digital asset market participants.The PositionThe Tie is seeking a Data Scientist with a strong foundation in Blockchain Data Engineering to identify and explore patterns in our proprietary datasets, source and diligence external datasets, and develop tools to help leading token issuers make more impactful data-driven decisions. The Tie is located in New York City. Applicants who can work in person are strongly preferred, but remote candidates will also be considered.What You Will Work OnExplore, visualize, and validate our proprietary cryptocurrency data sets, with a particular focus on those derived from on-chain dataDevelop cutting edge analytics and modeling methods to extract signal from raw on-chain data and translate it into actionable business insightsBuild data analytics and access infrastructure such as ETL pipelines and APIs Use our data and analytics tools to help some of the largest token-issuers optimize their decision-makingCollaborate with our developers to source, research, test, and analyze new data sets to include in our suite of productsInterface with our research analysts to write and contribute to both client-focused analytics and public-facing research reportRequirementsYou have a strong interest in data science, finance, and cryptocurrency. Prior professional experience in crypto and working with on-chain data is a huge plusYou thrive in a fast-paced start-up environment where there are always new projects and challenges. While day-to-day responsibilities will revolve around data science, you will have the opportunity to learn different functional areas of the business working side-by-side with the founders and business partners, and interacting with customersYou can use R or Python to clean and analyze data, build models, and present results with customized data visualizations You are proficient in data engineering workflows: able to construct complex data analysis and ETL tasks with tools such as SQL and DBT; able to utilize orchestration tools such as Serverless You write high quality code: it’s readable, efficient, and reusableYou are creative, driven, and a self-starter, and will be able to work in both a team environment and independently towards solutionsYou have a consultative, client-driven work style and are an excellent communicatorYou have the versatility and curiosity required to rapidly learn new technologiesBenefitsEmployee stock option planHealth, dental, vision, and disability insuranceFlexible paid time offFlexible working hoursA fast-paced and exciting work environmentStrong teamwork-driven culture\n"
}