{
    "https://www.linkedin.com/jobs/view/data-scientist-at-ford-motor-company-3643365965?refId=kX6%2FD08s72MWcYSoa32LGQ%3D%3D&trackingId=ttT7LFWJzkNhYASorMmaWg%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob DescriptionIn Global Data, Insight & Analytics (GDI&A), we aspire to navigate Ford Motor Company through the disruptiveness of the information age, harnessing the power of data and artificial intelligence to realize the enterprise’s known goals, reveal hidden opportunities, and achieve data superiority.The Charging/Energy Services & Cycle Plan Analytics team under Connected Vehicle & Enterprise Analytics organization in GDI&A leverages advanced analytics and domain expertise to deliver data analytics models, tools, and services to improve the EV customers’ charging experience, support Ford strategic energy services, meet or exceed regulatory compliance via connected vehicle data, and enable what-if scenario analyses for global cycle plan planning.We are seeking top-tier Data Scientist who has full-stack of skills in product lifecycle from analytic problem definition, through data gathering, analysis, model and algorithm development, reporting/visualization development, testing, and operational deployment.Responsibilities Responsibilities  :  Acquire deep understanding of the business problems and translate them into appropriate business solutions  Collaborate internally and externally to identify new and novel data sources and explore their potential use in developing actionable business results  Drive development and delivery of analytic and statistical models using skills such as data acquisition and management, algorithm design, and model development & refinement  Work with business partners using a collaborative, agile approach to develop solutions rapidly that add value and are centered around the user experience.  Develop mathematical, analytical, optimization and/or AI/ML models to support evidence-based decision making. Ensure overall quality of the data & solutions throughout the analytic development process and support deploying them as end-to-end products on Google Cloud Platform.  Examine, interpret, and report analytical results in both written reports and in oral presentations to varied audiences. Qualifications Basic Qualifications: M.S. in Data Science, Computer Science, Electrical Engineering, Applied math, Mechanical Engineering, Industrial Engineering, or related quantitative field 4+ years of experience, including both full-time work and research/academia experience, in programming languages such as Python, Java 3+ years of experience, including both full-time work and research/academia experience, with one or more of the following tools: Data Gathering skills/tools (e.g., BigQuery, SQL, Hadoop, Spark, Teradata, etc.) and/or Visualization skills/tools (e.g., Qlik Sense, Looker, Streamlit, etc.) 3+ years of experience, including both full-time work and research/academia experience, in mathematical programming, data mining, statistical analysis, and/or machine learning. Familiar with LP, QP, MILP optimization problems. Strong oral, written and interpersonal communication skills Experience writing and speaking about technical concepts to business, technical, and lay audiences and giving data-driven presentations  Preferred Qualifications:  Ph.D. in Data Science, Computer Science, Electrical Engineering, Applied math, Mechanical Engineering, Industrial Engineering, or related quantitative field or 3+ years of industry experience in data science and analysis  2+ years of experience, including both full-time work and research/academia experience, with formulating LP, QP, MIP optimization problems and solving them by commercial software (e.g., CPLEX, Gurobi, etc)  5+ years of experience, including both full-time work and research/academia experience, in programming languages such as Python, Java  5+ years of experience, including both full-time work and research/academia experience, with one or more of the following tools: Data Gathering skills/tools (e.g., BigQuery, SQL, Hadoop, Spark, Teradata, etc.) and/or Visualization skills/tools (e.g., Qlik Sense, Looker, Streamlit etc.)  5+ years of experience, including both full-time work and research/academia experience, in mathematical programming, data mining, statistical analysis, and/or machine learning  1+ years of Experience with Google Cloud Platform (GCP), including certifications  Familiarity with connected vehicle data is a plus  Other cloud computing experience such as Azure, or AWS is a plus  Ability to drive results and handle multiple projects within a given timeframe  Well-organized, independent, and ready to work with minimal supervision  Inquisitive, proactive, and interested in learning new tools and techniques  Comfortable working in a fast-paced and innovative environment where problems are not always well-defined  Publications or presentations in recognized journals or conferences\n"
}