{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-at-highnote-3641771298?refId=HNA7eAbYte%2FkSG0EPmCO3g%3D%3D&trackingId=uCVcBWE5KF5P%2FYH1COb8IQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout HighnoteFounded in 2020 by a team of leaders from Braintree, PayPal, and Lending Club, Highnote is an all in one card issuer processor and program management platform. We give digital-first organizations the flexibility to easily issue and process payment cards that accelerate business growth and profitability.We've raised $104M+ and grown our team to 100+ employees. Headquartered in San Francisco, we've managed to build one of the most advanced payments teams in the industry, with team members in 22+ US states.Operating through our core values of customer obsession, executional excellence, intentional inclusion, we're helping businesses grow for the future by creating the payment products demanded by tomorrow, with the ability to solve for use cases that don't exist yet.We are fast-moving, hands-on, and strongly believe everyone deserves a seat at the table. We believe we're unlocking incredible opportunities that can change the future of payments, as long as we have the right people to make it happen.Job DescriptionHighnote is seeking a Data Scientist to drive analytics-based, actionable insights to enable our operations and product team to better serve our customers.What you'll be doing:Work closely with stakeholders across the organization to understand their business needs and identify opportunities for data-driven insightsWork closely with the data team to collect data from external entities and improve the data modeling, as well as the ETL processes with the attention to data qualityDesign and implement statistical analyses, predictive models, and machine learning algorithms to generate actionable insights, including:Conduct exploratory data analysis and data visualization to identify trends, patterns, and outliers in the data. Build and deploy scalable and reliable models and tools that can automate decision-making processes. Communicate findings and insights to stakeholders in a clear and concise manner, using data visualization and storytelling techniques. What we are looking for:5+ years in data science/quantitative modeling Strong knowledge of SQL Familiarity with with data visualization tools (eg. Tableau, Matplotlib)Proficiency with open source machine learning frameworksStrong knowledge of statistics and machine learningFintech or Payments background Great attention to detail A curious mindset and passion to learn new skills Strong communication, presentation, and analytics skillsOwnership mindset - caring about seeing projects through from start to finishWhy Highnote?We're a startup that allows for our employees to truly build from the ground up and impact every layer of our organization. We're a team of payments obsessed individuals. While some of us come from the fintech world, some of us don't. We value the varied backgrounds and the diverse perspectives of our employees. We're small on hierarchy and big on growth. We're a flat organization that allows everyone to have direct exposure to our leadership team. We are looking for builders who thrive in ambiguity. We're backed by Oak HC/FT, Costanoa Ventures, and XYZ Ventures. Angel Investors include Bill Ready (CEO at Pinterest) and Renaud Laplanche (Co-Founder & CEO of Upgrade). Highnote BenefitsFlexible Paid Time Off 100% healthcare coverage + 75% coverage for dependents401k programUp to 16 weeks off for Maternity leave + up to 6 weeks of Paternity leaveEquity in HighnoteStipend to build out your home office; internet and phone reimbursementAt Highnote we have built a total rewards philosophy that includes fair, equitable, geo-based compensation that is performance and potential based. Our compensation packages are competitive based on robust market research and are a combination of a cash salary, equity, and benefits. In compliance with the Equal Pay for Equal Work Act, the annual salary range for applicants is $150,000-$200,000Please note that positions located in San Francisco are hybrid and include core working days of Tuesday, Wednesday, Thursday in office.Highnote is a diverse and inclusive company committed to growing a diverse and inclusive team. We invite people from all backgrounds and identities to apply. We do not discriminate based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other characteristics protected by US federal state or local laws, or the laws of the country or jurisdiction where you work. Additionally, we encourage everyone to share which pronouns you wish for us to use when addressing you (i.e.: she/her, he/him, they/them, etc).\n      "
}