{
    "https://www.linkedin.com/jobs/view/sr-data-scientist-at-alteryx-3643355758?refId=V4cSrEECU0o9AhNlfvudlQ%3D%3D&trackingId=uGj8tupF85g2MVu9MKfVUQ%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        We’re looking for problem solvers, innovators, and dreamers who are searching for anything but business as usual. Like us, you’re a high performer who’s an expert at your craft, constantly challenging the status quo. You value inclusivity and want to join a culture that empowers you to show up as your authentic self. You know that success hinges on commitment, that our differences make us stronger, and that the finish line is always sweeter when the whole team crosses together.Alteryx is searching for a Sr. Data Scientist. This position is remote-friendly.Position OverviewWe are excited to be adding to our expanding Data Science Team that drives data-driven decision-making into internal decisions and helps enable customers with education and thought leadership on implementing analytics in their environments. You will help to improve the product alongside our sales engineers, market more effectively to our customers, make sales happen, and help every department use Alteryx and other data science tools more effectively to deliver amazing results. In addition, the team will be working to drive our Alteryx for Good mission, helping schools and citizen data scientists around the world become more data literate, more capable answering questions, and more able to solve problems. It is a meaningful and exciting role to be in!Primary ResponsibilitiesDesign: Build robust, end-to-end analytics and data science products partnering with business customers throughout the company.Technical Creativity: Leverage & Implement a wide array of statistical, econometrics, ML and advanced analytics methods to drive business insights and support data-driven decisions.Tenacity & Business Savvy: Constant & unstoppable drive to iteratively improve business processes and practices through the application of data science techniques.Customer-Centric: Always put customer needs first by delivering quick, agile and thoughtful analytics while continuing to find opportunities to provide novel insights and capabilities to our partners.Teacher: Utilize deep knowledge of data science and Alteryx to upskill and support Alteryx colleagues around the globe.Team Player: Work on a cross-functional team of technical peers, business partners, and subject matter experts to develop best-in-class solutions.QualificationsGraduate Degree in Statistics, Economics, Econometrics, Engineering, Physics, Data Science or other Quantitative Discipline a plus.2-5 years' relevant professional experience leveraging data & analytic techniques with direct business application (Prediction, Forecasting, Inference). Experience applying Data Science techniques within Sales, Marketing or Customer Success in the Software Industry a plus.Applied Knowledge of visualization tools (Tableau, Qlik, etc.) to translate complex process/model output into deep business/customer insights.Experience building robust, end-to-end analytic products (ETL, EDA, Modeling/Analytics, Deployment/Maintenance) with multiple examples of deployed solutions delivering significant ROI or business transformation.Ability to interface directly with customers to problem solve and facilitate solution implementations.3+ years experience in Alteryx, Python, R or programming/statistical other languages.Experience working in a fast-paced culture, managing multiple deliverables a plus.Demonstrated experience in data & analytics change management, working hand-in-hand with the business to deliver analytics and enablement business customer to utilize data for day-to-day decision making.CompensationAlteryx is committed to fair, equitable, and transparent compensation. Final compensation will be determined by various factors such as your relevant work experience, education, certifications, skills, and geographic location.The salary range for this role in Southern California, Colorado, Washington, and Rhode Island is $118,700 - $165,800.The salary range for this role in New York City and Northern California is $129,500 - $170,200.In addition, you may be eligible for additional compensation, such as a bonus and stock grants. Employees may also be eligible for a wide range of other benefits, including medical, retirement, financial, wellness, time off, employee discounts, and others.Interested? Learn more and apply today at alteryx.com/careers!Find yourself checking a lot of these boxes but doubting whether you should apply? At Alteryx, we support a growth mindset for our associates through all stages of their careers. If you meet some of the requirements and you share our values, we encourage you to apply. As part of our ongoing commitment to a diverse, equitable, and inclusive workplace, we’re invested in building teams with a wide variety of backgrounds, identities, and experiences.Benefits & PerksAlteryx has amazing benefits for all Associates which can be viewed here.\n"
}