{
    "https://www.linkedin.com/jobs/view/general-applications-software-engineer-all-levels-at-clever-inc-3641744062?refId=qTAqOukhQLDsLyLyImcnbw%3D%3D&trackingId=BoQqCNQ26XevC%2FXGPXdoAw%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Don't see a position that fits your expertise? Apply with a general application here.Founded by educators and technologists passionate about improving education, Clever is on a mission to unlock new ways to learn for all students. Already used by more than 65% of U.S. K-12 schools, Clever brings all applications into one secure portal and provides single sign-on for everyone. With the leading network of digital learning providers, Clever makes school more engaging, personalized, and fun.We're always looking for talented engineers who want to help us build Clever into something every school, student, and teacher relies on.A DAY IN THE LIFE:Collaborate with Product Management, Design and Marketing to research, design, and code major new features and enhancements that will best engage, educate, and delight educators. Develop new features like fast and intuitive UIs, Go Microservices, and application rest APIs to give districts control over the data they share with each application. Be an important part of Clever's ecosystem of engineering excellence as we strive to create both the best possible customer experiences and top quality internal architectures across all of our products and initiatives. Understand and prioritize the Clever engineering culture - see our blog post on Defining Clever's Engineering Culture. WHAT WE'RE LOOKING FOR:1+ years of experience as a full-stack Software EngineerLed small to large projects and collaborated with a team to create meaningful impactArchitected systems to solve a variety of product and data needsStrong fundamentals in computer science and software engineeringThe drive to learn and teach through collaboration and code reviewsA desire to work in a diverse, highly collaborative team environmentCommitment to equity and belonging. At Clever, we believe the classrooms we serve and our company's halls should be spaces that are diverse, equitable, and inclusive. That is why we are committed to building diverse teams, inviting every voice, and creating a safe space for everyone to be their authentic self. By fostering equity and belonging within our circles of influence, we unlock learning for ALL studentsCLEVER PERKS!A competitive salary and equity package in a well-funded, high-growth companyUnlimited Paid Time Off and Paid Parental LeaveTop-notch healthcare, vision, and dental coverage for you and your familyBest-in-class mental healthcare service that supports employees' mental and emotional wellnessUnlimited book learning credits to amazon.com and small, local bookstoresProfessional development budget and LinkedIn Learning subscription with unlimited access to thousands of expert-led online coursesAnnual company retreat and quarterly team events to connect with fun, bright coworkersFor Colorado* and California (except San Francisco) based candidates - the range of our base salary cash compensation for this role for candidates living in Colorado and California (except San Francisco) is between $122,000- $165,000, final offers are determined using multiple factors including experience and level of expertise.For NYC* and San Francisco based candidates - the range of our base salary cash compensation for this role for candidates living in NYC and San Francisco is between $135,000- $183,000, final offers are determined using multiple factors including experience and level of expertise.We offer a full robust benefits package and stock options. Because Clever's base compensation is driven by location, our recruiters will be happy to discuss a salary range for other locations during the interview process.Note: Disclosure as required by sb19-085\n"
}