{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-pulivarthi-group-pg-3625954176?refId=XB9hdl1%2BBo2gfHc7a4iH2A%3D%3D&trackingId=fmZED1STbLBRnaCqddSzig%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Follow us on Linkedin: https://www.linkedin.com/company/pulivarthigroup/Pulivarthi Group LLC is a Global Staffing & IT Technology Solutions company, with our prime focus of providing world class solutions to our customers with the right talent. We combine the expertise of our team and the culture of your company to help you with the solution that is affordable and innovative using high quality standards and technologies.We’ve served some of the largest healthcare, financial services, and government entities in the U.S.Follow us on Linkedin: https://www.linkedin.com/company/pulivarthigroup/Behavioral Interview +Technical Round _+ Client interviewThis team focuses on building data / ML services for our advertiser sellers, to guide them ways to optimize for their ad budget and goals, for example by recommending the right inventory, keywords, budget, bid and audiences to apply for their campaigns, and eventually create campaigns automatically for advertisers. This is a relatively new area but with a very high business potential and need. It would allow you to work with massive amounts of data, and use a variety of data science techniques.Responsibilities Work with Applied Researchers, Engineers, Analytics and multi-functional teams to produce end-to-end production-ready solutions Mining with big data to understand user behaviors and patterns and leverage the insights to improve Ads experience with sellers/buyers Translate business problems into Machine Learning problems Build quick prototypes and do preliminary explorations to decide on feasibility and directionRequirements BS or MS in Computer Science or equivalent experience Experience in NLP, ML and statistical modeling Experience with large data sets and related technologies, e.g., Hadoop and Spark. Knowledge of SQL is preferred. Good understanding of machine learning algorithms. Strong programming skills in Python, Scala or Java Experience in solving problems using data science, building practical solutions, and deploying models into production for evaluation\n"
}