{
    "https://www.linkedin.com/jobs/view/principal-scientist-machine-learning-protein-design-at-ordaos-bio-3597719423?refId=PP6%2FSiR5t1hBIokw6dC4%2FA%3D%3D&trackingId=kuHX%2F2zLHc%2F8faQlAQL%2B%2Fg%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Ordaos is seeking an experienced Principal Scientist to be a part of our ongoing mission to create bespoke mini-proteins that enable groundbreaking therapeutics. Ordaōs is a human-enabled, machine-driven drug design company made up of interdisciplinary thinkers who are passionate about technology and biomedicine. We are hiring immediately.Reporting to the Senior VP of Machine Learning, this team member will drive deep learning projects through close collaboration with industry leading experts to reshape, test, and extend our pipeline of generative modeling for drug discovery. This position will involve planning and implementing several projects using state-of-the-art AI techniques that enable biological capabilities working towards the success of our mission.Job Functions:You will be responsible for the research and development of innovative computational approaches and workflows to design and optimize proteinsDeveloping algorithms and models to solve complex problems with biological dataLeveraging large-scale proprietary datasets and work with subject matter experts on cross-functional teams to solve challenging problems in how we discover and engineer the next generation of therapeuticsKeeping up to date with the state-of-the-art machine learning models and techniques Presenting the latest research in deep learning and participate in discussion on how to implement these techniquesContribute to building a culture that embraces scientific excellence and integrity with a sense of urgency and collaboration with key stakeholdersSalary Range: $185-225k plus incentive stock opportunitiesRequirementsRequired:Ph.D. in computer science, engineering, statistics, structural bioinformatics, or similar with 8+ years of relevant experienceExperience with state-of-the-art machine learning approaches applied to biological protein dataExperience mentoring or supervising junior personnel Strong fundamentals in problem solving, algorithm design, model building, and statistical analysis Proficiency developing large scale models using modern deep learning packages (e.g., PyTorch)Expertise with a high-level programming language such as Python for sophisticated data analysis and reproducible research practicesExcellent problem-solving skills and teamworkStrong communication, data presentation, and visualization skillsBenefitsISO grant upon offer and milestonesCompetitive healthcare coverage through Blue Cross Blue Shield, dental and vision through Guardian Healthcare with company funded HSA ($3850 annual)401k (traditional and Roth offered) with 100% match up to first 4% of pay20 days paid vacation in addition to 12 company paid holidays or floating holidaysFree annual corporate membership to CitibikeCompany funded meals and eventsUp to 4 weeks of Compassionate LeaveAbout OrdaosOrdaōs is a human-enabled, machine-driven drug design company. Our flagship solution, mini-PRO™, is a bespoke class of mini-proteins that help pharma and biotechs around the world deliver safer and more effective life-saving treatments in a fraction of the time of traditional discovery methods. miniPRO proteins are created and evaluated in silico, and then rigorously tested in vitro, which enables us to reliably and repeatedly deliver de novo solutions that meet our client’s stringent requirements at scale, including novelty and probability of clinical success. At Ordaōs, we help birth novel therapies that reduce patient suffering, improve health, and extend life.Ordaos is a smoke-free and drug-free work environment.Ordaos is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person’s race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law. Ordaos will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.\n      "
}