{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-ml-and-algorithms-remote-at-alltrails-3617213310?refId=om04Ys3Lr%2BDGEHV90ShP%2Fg%3D%3D&trackingId=AngMEPv7uhbvhCtftjkUXg%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Senior Data Scientist, ML and AlgorithmsAbout AllTrailsAllTrails is the most trusted and used outdoors platform in the world. We help people explore the outdoors with hand-curated trail maps along with photos, reviews, and user recordings crowdsourced from our community of millions of registered hikers, mountain bikers and trail runners in 150 countries. AllTrails is frequently ranked as a top-5 Health and Fitness app and has been downloaded by over 50 million people worldwide.Every day, we solve incredibly hard problems so that we can get more people outside having healthy, authentic experiences and a deeper appreciation of the outdoors. Join us!What You’ll Be Doing:Designing and implementing algorithms that power everything from the way we optimize our content to the way we personalize experiencesDesigning machine learning models that will be pushed into production systems, at-scaleIdentifying unique ways in which data can be transformed into solutions that directly drive revenue for the organizationPartnering with teammates and product managers to develop robust solutions to highly specific technical challengesIdentifying technical and strategic gaps in our data science infrastructure and proactively driving best-in-class solutionsPresenting work to a large variety of stakeholdersRequirements:5+ years of work experience in data scienceB.S. or M.S. degree in data science, machine learning, artificial intelligence, mathematics, or equivalent practical experienceProficiency with both Python and SQLAn understanding of both simple and complex machine learning and artificial intelligence concepts (e.g. clustering, regression, classification, deep learning, transformers, diffusion) Professional experience working in least one of the following areas: vector embeddings, deep learning, natural language processing, computer vision, generative AI (e.g. LLMs, transformers), personalization, route optimization, geospatial trajectories (GPS / GIS)Experience with the end-to-end machine learning lifecycle (data cleaning, feature extraction, training/testing, model evaluation, optimization, deployment, etc.) Experience in collaborating with engineers in designing models that scale to production-level request volumesExperience working collaboratively on shared codebases using GitExperience in iterative exploratory notebook development (Jupyter, Hex, etc.) Experience working with machine learning frameworks such as TensorFlow, Caffe2, PyTorch, Spark ML, scikit-learn, or related frameworksRegularly enjoys reading highly technical research papers and translating learnings into effective prototypesStrong attention to detail, analytical, and a problem solver with a keen insight for asking the right questions and building solutions to drive direct business valueExpert communication skills, including the ability to persuade and inspire, a knack for breaking down complex concepts, and a proactive attitude towards knowledge sharing and documentation Bonus Points:Querying and manipulating data on the scale of TBs+Experience with transformation tools like dbt or DataformExperience with best practices in ML ops and software development lifecyclesWhat We Offer:A competitive and equitable compensation plan. This is a full-time, salaried position that includes equityPhysical & mental well-being including health, dental and vision benefitsTrail Days: First Friday of each month to hit the trails!Unlimited PTOFlexible parental leaveAnnual continuing education stipendDiscounts on subscriptions and merchandise for you and your friends & familyAn authentic investment in you as a human being and your career as a professionalNature celebrates you just the way you are and so do we! At AllTrails we’re passionate about nurturing an inclusive workplace that values diversity. It’s no secret that companies that are diverse in background, age, gender identity, race, sexual orientation, physical or mental ability, ethnicity, and perspective are proven to be more successful. We’re focused on creating an environment where everyone can do their best work and thrive.A successful candidate’s starting salary will be determined based on various factors such as skills, experience, training and credentials, as well as other business purposes or needs. It is not typical for a candidate to be hired at or near the top of the range of their role and compensation decisions are dependent on the factors and circumstances of each case.\n      "
}