{
    "https://www.linkedin.com/jobs/view/scientist-ii-biophysics-at-biospace-3635447447?refId=fTBmov5SHNUk%2Foge2yYkIQ%3D%3D&trackingId=8J3ShTiKOjTxj3ohLkb5vg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        We are passionate about our mission to develop high performing products to study genomics with unprecedented flexibility and quality that enable researchers to better understand biology for the improvement of global health. We have built a highly efficient product-driven organization where employees can learn, grow and thrive in a challenging but encouraging environment. We are committed to scientific integrity, collegiality, honesty, objectivity, and openness. We offer excellent benefits, which include a 401K plan, competitive health benefits, flexible vacation, and equity incentives. We are looking for a highly skilled and motivated interdisciplinary experienced Scientist II with expertise in biophysics, spatial biology, and in-situ single cell multiomics to join our R&D team. The ideal candidate will be responsible for developing and implementing innovative assay solutions for our upcoming products. You will work on the characterization and understanding of fundamental biophysical systems. This role requires a driven individual who can collaborate closely with biochemists, surface chemists, and bioinformaticians, while working cross functionally with engineering, software, and other functional groups.Essential Functions And ResponsibilitiesInnovate in-situ solutions for spatial and single cell applications by expanding Element’s core technologies.Design, develop, and optimize experimental protocols and assays to characterize and troubleshoot complex biochemical reactions, materials, and processes that involve in-vivo and in-vitro detection of biomolecules.Build new measurement platforms (such as TIRF, FRET, etc.) and generate multi-dimensional biophysical data using these new approaches.Develop new software tools for data analysis, simulation, and visualization of large and complex data sets.Plan and execute experiments as part of a larger team. Analyze data and report results to a greater audience (technical and non-technical alike).Contribute significantly in the lab – testing and performing experiments to generate high quality data to inform data-driven decisions.Work closely with members in cross functional groups to overcome interdisciplinary challenges to arrive at robust solutions.Stay up to date with latest scientific advancements in the field of biophysics, spatial biology, and in situ single cell multiomics.Education And ExperiencePhD in biophysics, biochemistry, molecular biology, chemical engineering, or a related field plus 3-5+ years of experience; or Masters in related field, plus 6+ years of experience.Experience with single-molecule microscopy is highly preferred.Experience with transcriptomics, epigenetics, and proteomics techniques preferred.Demonstrated ability to relate fundamental theory to experimental data and vice versa.Analytical and systematic approach to design, test, and troubleshooting, with a high attention to detail.A self-starter approach to scientific discovery is required.Detailed experimentalist with the curiosity to dig deeper without losing sight of project/program priorities.Experience with programming and data analysis software (Matlab, JMP, etc.).Ability to work collaboratively with internal and external stakeholders.Strong publication record in peer-reviewed journals.Physical RequirementsMust be able to lift 15 poundsLocation:San Diego, CATravelN/ABase Compensation Pay Range: $110,000 - $136,000In addition to base compensation, you will be eligible for stock options, discretionary annual bonus, no cost health insurance plans, 401k with company match, and flexible paid time off. Please Note: Base compensation will depend on multiple factors, including geographic location, qualifications, and experience. We foster an environment such that all people are afforded the freedom to pursue their passions without regard to race, color, religion, national or ethnic origin, gender (including pregnancy), sexual orientation, gender identity or expression, age, disability, veteran status or any other characteristics protected by law.\n      "
}