{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-entry-level-at-patterned-learning-ai-3640887622?refId=iajngyGh%2F6zFHqZGAgbH1g%3D%3D&trackingId=dmvCatTX7vg%2BtZCizmWM8Q%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nREMOTE (US/Canada Residing people only, with work permit) Patterned Learning – Machine Learning Engineer (Entry Level) , FULL-TIME, Salary $60K - $70K a year.About us: The Future of AI is Patterned, a stealth-mode technology startup. Top investors include Sequoia and Anderson Horowitz, founders from Google, DeepMind, and NASA and we’re hiring for almost everything!Job SummaryAre you a passionate problem solver with a strong foundation in machine learning and a desire to contribute to cutting-edge projects? We are seeking an enthusiastic and talented entry-level Machine Learning Engineer to join our dynamic team. As a Machine Learning Engineer, you will play a vital role in developing and implementing innovative machine learning models and algorithms to solve complex problems. This is an excellent opportunity for someone looking to jumpstart their career in the field of machine learning and gain hands-on experience in a fast-paced environment.ResponsibilitiesCollaborate with cross-functional teams to identify and understand business requirements and translate them into machine learning solutions.Develop, train, and optimize machine learning models and algorithms.Collect, preprocess, and analyze large datasets to extract meaningful insights and patterns.Implement data pipelines and automate data processing tasks.Collaborate with software engineers to integrate machine learning models into production systems.Continuously monitor and evaluate model performance and make improvements as necessary.Stay up-to-date with the latest advancements in machine learning and contribute to the team's knowledge sharing activities.Document and communicate technical concepts and solutions effectively to both technical and non-technical stakeholders.QualificationsBachelor's or Master's degree in Computer Science, Machine Learning, Data Science, or a related field.Strong understanding of machine learning algorithms, statistics, and mathematics.Proficiency in programming languages such as Python, Java, or C++.Experience with machine learning libraries/frameworks, such as TensorFlow, PyTorch, or scikit-learn.Familiarity with data preprocessing techniques and feature engineering.Knowledge of deep learning techniques and neural networks is a plus.Experience with big data processing tools (e.g., Hadoop, Spark) is a plus.Strong problem-solving skills and the ability to think creatively to develop innovative solutions.Excellent communication and collaboration skills.Ability to work both independently and in a team-oriented environment.Special Benefits You Will LoveFlexible vacation, paid holidays, and paid sick days401(k) with up to 2% employer matchHealth, vision, and dental insuranceSchedule: 8 hour shift, Monday to Friday , Time: Flexible, Job Type: Full-time.Note: Freshers are highly encouraged to apply.\n"
}