{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-omneky-3638855531?refId=1ZFyMvZrHZzYhmwwxkLSHg%3D%3D&trackingId=XwjtDxRWQGMYRwJUDXJg0Q%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout Omneky:Omneky (www.omneky.com/) is a fast-growing generative AI and advertising technology startup. We use the latest deep-learning algorithms to generate personalized advertisements at scale.Job Description: Omneky invites applications for the role of Data Scientist. With our rapidly growing, AI-powered creative content platform, we seek an individual who is deeply passionate about AI innovation and has the ability to confidently implement AI solutions. The ideal candidate will have 3-4 years of experience in the field, and will have the unique opportunity to learn from and be guided by the senior members of Omneky's distinguished engineering leadership. If you are excited by the prospect of contributing to the advancement of AI solutions and desire to be a part of our journey as we scale, we look forward to your application.Roles & Responsibilities:Analyze the dataset and perform feature engineering.Implement DL\\ML solutions to solve business problems and invent new features for the platform.Collaborate with the geographically distributed Engineering and AI team, including senior members..Responsible for creating data pipelines from scratch.Developing prediction systems and machine learning algorithms from scratch.Propose solutions and strategies to tackle business challengesAnalyzing large amounts of information to find patterns and solutionsCarrying out preprocessing of structured and unstructured data.Requirements:3-4 years of experience in building and deploying AI systems at scale.Deep understanding of supervised learning algorithms.Experience in any of the listed AI skills: Cloud AI services, Traditional Computer Vision, Machine Learning, Deep Learning, Data Science, AI-related frameworks, and libraries like Tensorflow, PyTorch, Keras, Scikit-learn, Numpy/Scipy.Experience with NLP and the related transformer-based language model GPT3Strong knowledge and coding experience in Python.Knowledge of developing APIs using Python and experience with Flask or DjangoKnowledge of working with databases, and experience with SQL / NoSQL .Knowledge of cloud-based Saas products.Knowledge of cloud, AWS\\Azure\\GCP anyone.Exposure to collaboration and modern developer tools (GitLab, Slack, VS code, Jira, confluence, Jupyter).Mandatory understanding of large language models, including LLAMA, and stable diffusion concepts, underlining a comprehensive knowledge of the latest developments in AI.Excellent communication and presentation skillsStrong math skills (e.g. statistics, algebra)Understanding of machine-learning and operations research.This role is perfect for someone with 3-4 years of experience and a comprehensive understanding of AI, including specific knowledge of large language models like LLAMA and stable diffusion. If you believe you are a good fit for this role, we would love to hear from you.This is an exciting opportunity to develop and apply AI skills in a dynamic and innovative environment.\n"
}