{
    "https://www.linkedin.com/jobs/view/research-scientist-fundamental-computer-vision-at-meta-3637376390?refId=Crb3pSVy4oZxyoO%2FhkqtpA%3D%3D&trackingId=OdBohJNNWBhA6GvQyGigWQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Meta is seeking a Research Scientist to join our AI Research Team, a research organization focused on making significant progress in AI. Individuals in this role are expected to be recognized experts in identified research areas such as artificial intelligence, machine learning, computational statistics, and applied mathematics, particularly including areas such as deep learning, graphical models, reinforcement learning, computer perception, natural language processing and data representation. The ideal candidate will have a keen interest in producing new science to understand intelligence and technology to make computers more intelligent.Research Scientist, Fundamental Computer Vision Responsibilities:Lead research to advance the science and technology of intelligent machinesLead research that enables learning the semantics of data (images, video, text, audio and other modalities)Devise better data-driven models of human behaviorWork towards long-term ambitious research goals, while identifying intermediate milestonesInfluence progress of relevant research communities by producing publicationsContribute research that can be applied to Meta's product developmentLead and collaborate on research projects within a globally based teamMentor other team members. Arbitrate in cases of technical disagreement among team members. Play a significant role to have a healthy cross-functional collaborationMinimum Qualifications:Experience holding a faculty, industry, or government researcher positionPh.D. and publications in machine learning, AI, computer science, statistics, applied mathematics, data science, or related technical fieldsExperience leading a team in solving modeling problems using AI/ML approachesExperience in theoretical and empirical research and for addressing research problemsExperience communicating research for public audiences of peersKnowledge in a programming languageMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employmentBachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience.Preferred Qualifications:1+ year(s) of work experience in a university, industry, or government lab(s), in a role with primary emphasis on AI researchExperience driving original scholarship in collaboration with a teamFirst author publications experience at peer-reviewed AI conferences (e.g., NeurIPS, CVPR, ICML, ICLR, ICCV, and ACL)Experience in developing and debugging in C/C++, Python, or C#Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We may use your information to maintain the safety and security of Meta, its employees, and others as required or permitted by law. You may view Meta's Pay Transparency Policy, Equal Employment Opportunity is the Law notice, and Notice to Applicants for Employment and Employees by clicking on their corresponding links. Additionally, Meta participates in the E-Verify program in certain locations, as required by law\n      "
}