{
    "https://www.linkedin.com/jobs/view/data-scientist-at-professional-diversity-network-3642994170?refId=Z0M0ZSQmM8y1U%2BVDoYKiHg%3D%3D&trackingId=vQ8oX%2F3AG90EFk6kCinXBg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nPrimary Duties And ResponsibilitiesData Scientist Southern Company is a leading producer of clean, safe, reliable and affordable energy, and we approach each day as a vital step in building the future of energy. At Southern Company we are always looking ahead, and our innovations in the industry-from new nuclear to deployment of electric transportation and renewables -help brighten the lives and businesses of millions of customers nationwide. The Data Scientist role is responsible for collecting, organizing, mining, and analyzing data to draw conclusions and develop insights that enable better decision-making and operational effectiveness of Southern Company Services Planning & Regulatory organization. Additionally, this role will work closely with stakeholders - both Business and the Technology Organization- on data management and analysis initiatives supporting the regulatory process.Strong technical competency and programming skills in large-scale data analysis using coding/querying languages including at least one of SAS, SQL, Python, or R.Analysis, design, development, test, troubleshooting and documentation of complex systems including several of the following: predictive models, feature extraction, data-driven analysis, application of machine learning algorithms, text mining, decision support, variable selection and model fitKnowledge of data migration and integration across datasets and technology platformsFamiliarity with Machine Learning, Artificial Intelligence, and/or production level model deployment.Deep analytical capability to debug, monitor, and troubleshoot issues with data solutionsExperience with data visualization in SAS Viya, Power BI, Tableau, SSRS, or other comparable tools.Experience working with large enterprise databases with demonstrated ability to independently query and prepare data for analysis.Knowledge of front-end tools such as query tools, report writers, data mining, and analysis tools.Effective communication (verbal/written) and leadership skills to foster enterprise influence on data-driven business decision-makingExperience in translating and documenting business needs to technical requirementsComprehensive consulting skills with proven ability to work with and influence othersExcellent customer service skills and focus on delivery with a positive attitudeSelf-starter with ability to work independently with minimal guidanceContinuous self-learner with perspective on industry trends in the data spaceAbility to handle multiple assignments and conflicting prioritiesStrong project management skillsAbility to hold self and others accountable for resultsComfortable Within a Fast-paced, Deadline-driven And Changing Environment. QualificationsBachelor's Degree in Systems or Mathematics (or Analytics, Decision Sciences, Statistics). Master's degree is preferred.Minimum of 3 years of professional experience in analytics, marketing, business analysis, spatial analysis. Advanced statistical and predictive modeling experience using both supervised and unsupervised modeling technique.Experience manipulating large datasets and databases with working knowledge of Hadoop or other big data cloud technologies (e.g. Azure or AWS)Extensive knowledge doing Machine Learning, Artificial Intelligence, and/or production level model deployment in the cloudExperience in coding, testing, and implementing campaign data initiatives using real-time decision-making marketing technologyExperience in at least one programming language (SQL, SAS, Python, R, etc.)Knowledge of using an integrated toolset to leverage Big DataExcellent interpersonal and communication skills, especially with communicating technical issues to non-technical audiences.Capability to work independently and collaboratively. Disclaimer: This information describes the general nature and level of work performed by employees in this job. The description is not designed to be a comprehensive inventory of duties, responsibilities and qualifications required in the job. Reasonable accommodations may be made to qualified disabled individuals for performance of essential duties and responsibilities. Southern Company (NYSE: SO) is America's premier energy company, with 46,000 megawatts of generating capacity and 1,500 billion cubic feet of combined natural gas consumption and throughput volume serving 9 million customers through its subsidiaries. The company provides clean, safe, reliable and affordable energy through electric operating companies in four states, natural gas distribution companies in seven states, a competitive generation company serving wholesale customers across America and a nationally recognized provider of customized energy solutions, as well as fiber optics and wireless communications. Southern Company brands are known for excellent customer service, high reliability and affordable prices that are below the national average. Through an industry-leading commitment to innovation, Southern Company and its subsidiaries are inventing America's energy future by developing the full portfolio of energy resources, including carbon-free nuclear, 21st century coal, natural gas, renewables and energy efficiency, and creating new products and services for the benefit of customers. Southern Company has been named by the U.S. Department of Defense and G.I. Jobs magazine as a top military employer, recognized among the Top 50 Companies for Diversity by DiversityInc, listed by Black Enterprise magazine as one of the 40 Best Companies for Diversity and designated a Top Employer for Hispanics by Hispanic Network. The company has earned a National Award of Nuclear Science and History from the National Atomic Museum Foundation for its leadership and commitment to nuclear development and is continually ranked among the top energy companies in Fortune's annual World's Most Admired Electric and Gas Utility rankings. Visit our website at www.southerncompany.com. Southern Company is an equal opportunity employer where an applicant's qualifications are considered without regard to race, color, religion, sex, national origin, age, disability, veteran status, genetic information, sexual orientation, gender identity or expression, or any other basis prohibited by law. #LI SCS2011362PDN-98cee791-b44c-4f5b-851b-b93eafa647dc\n      "
}