{
    "https://www.linkedin.com/jobs/view/data-scientist-public-sector-at-clarifai-3641744130?refId=%2BG8rqMHQHeVAQIW4u5RwXQ%3D%3D&trackingId=noiRtaD5t%2FACRY4vPIqecw%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nAbout The CompanyClarifai is a leading, full-lifecycle deep learning AI platform for computer vision, natural language processing, LLM's and audio recognition. We help organizations transform unstructured images, video, text, and audio data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States, Canada, Argentina, India and Estonia.We have raised $100M in funding to date, with $60M coming from our most recent Series C, and are backed by industry leaders like Menlo Ventures, Union Square Ventures, Lux Capital, New Enterprise Associates, LDV Capital, Corazon Capital, Google Ventures, NVIDIA, Qualcomm and Osage.Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce.Your ImpactYou will be responsible for the development of custom models to solve real world problems for business and expand Clarifai's presence in the rapidly expanding AI solutions space.The OpportunityManage the development of labeled data sets Develop, analyze the performance of, and document machine learning models and the datasets on which they were trained and validatedSupport client engagements for creating custom modelsWork 3-4 days/week remotelyWork 1-2 days/week at a government site in the DC areaRequirementsDevelopment experience in Mac and/or Linux environmentsExperience with Python scripts and Jupyter notebooksExperience with Spark SQL and Parquet dataExperience with Gitlab/GithubTechnical writing skillsCloud computing skills (AWS, GCP)College degree BS (computer science, math, physics)Live in the greater DMV (DC, Maryland, Virginia) areaHold or recently held a Secret security clearance with the ability to obtain TS/SCIExperience manipulating data on government computing infrastructureGreat to HaveMaster of Science degree or higher Machine learning development experienceExperience with Docker, Kubernetes, Kubeflow, MLflow, or other MLops environmentsTS/SCI security clearance\n"
}