{
    "https://www.linkedin.com/jobs/view/data-scientist-at-precision-neuroscience-3628246598?refId=55Jw368vztuvaem2OYC9kg%3D%3D&trackingId=8%2Fu1TdgSeN0wcokuMGRGNw%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Our mission at Precision Neuroscience is to develop and commercialize brain-computer interfaces (BCIs). We are pursuing minimally invasive approaches to BCI to address major unmet clinical needs. We are well-capitalized and have an IP portfolio that has been built over nearly 10 years.BCIs represent a new frontier in medicine and computing. We seek to establish Precision Neuroscience as one of the leading companies in this space globally. Our core objective is to deliver life-changing technology to millions of patients worldwide, and in doing so to transform the ways we interact with machines, one another, and our world.We are seeking a Data Scientist to help us develop our neural interfaces and analyze the data they generate. In this role you will help drive the state-of-the art in brain-computer interfaces (BCIs).This is an extraordinary opportunity to join our core team to help to shape the future of our company. Your work will see commercialization quickly so that we improve the lives of patients who live with neurological disorders in a matter of months and years, not decades.This position is based in Mountain View, California. To be eligible for this position you must currently be in the United States, with working rights.You will:Complete analysis of large experimental datasets obtained from micro-electrocorticographic electrodes recorded in vivo. Collaborate with our software and neural interface teams to leverage large amounts of static and streaming data to create world-class computational tools for clinical use specific to neural decoding. Contribute to design, performance and coordination of electrophysiological experiments. Collaborate with the rest of our team to publish and present our work. RequirementsMaster’s degree or above in electrical engineering or physics (or related field) with strong experience in real-time digital signal processing. Expert at deploying statistical tests for time-series and categorical variables, with the ability to quantify and regularize models. Expert at analysis of large datasets using machine learning techniques, and experience in GPU-optimized computing (especially for digital signal processing). Previous experience working with biomedical datasets. Demonstrated history of self-directed scientific work with a strong sense of ownership and accountability. Track record of delivering on accelerated timelines and budgets. Precision Neuroscience is proud to be a member of NVIDIA’s AI Startups Accelerator program, giving us access to go-to-market support, expertise and technology. Diverse workforces create the best culture, company, and products. We at Precision Neuroscience are committed to an inclusive culture that celebrates the uniqueness and contributions of everyone. As an equal opportunity employer, Precision Neuroscience does not discriminate on the basis of sex, race, religion, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n"
}