{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-radformation-3610575864?refId=QuDiRa0UhuN2AKTie9gCDA%3D%3D&trackingId=xgArBU1bXy1GSi4ILchiAg%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Work at RadformationCancer rates increase year after year, yet high-quality care is not universal. By automating and standardizing the treatment planning workflow, Radformation aims to create a system where any patient anywhere can receive the same high-quality care.We strive daily to reduce cancer's global impact and help save more of the 10 million lives it claims each year. Our unwavering commitment is to deliver reliable, high-quality, automated solutions that allow clinics to standardized care for every single person in need.Radformation is seeking a self-motivated Machine Learning / AI Engineer to join our innovative and fast moving team. This role is ideal for someone who wishes to use their machine learning and AI skills to improve cancer care throughout the world. You will work within Radformation’s fully remote teams to develop radiation oncology efficiency and automation software. You will write/maintain data ETL pipelines, build/test AI models and support FDA submissions. You will work with Radformation’s cloud team to troubleshoot problems and work with the AI team to address model issues and propose improvements.For this position we prefer candidates who have a background developing machine learning models deployed as part of clinical software. We are looking for an engineer who has experience building, training, and tuning models. Python skills are essential.ResponsibilitiesWrite / maintain ETL pipelinesBuild / test AI modelsSupport FDA submissionsParticipating in Design Reviews, Risk and Hazard Analyses, and other formal reviewsAttend daily stand-ups and related project meetingsRequired ExperienceMS with 3+ years of experience in related field: Computer Science, Mathematics, Statistics, or Medical Physics/Radiation OncologyLanguages : Expert programmer in python required. Experience with other high level languages like, C#, C++, Java is desirableFluent in PyTorch & TensorFlowWorking experience with model building, parameter tuning and training modelsExperience building CNNs with U-NetCode Repos : Expert user of any of Bitbucket, Github, Azure DevOps, or similarGIT - you will need to become an expert if not alreadyPreferred ExperienceImage processing including resampling, smoothing, segmentationClinical programming experience with HL7 or DICOMExperience with HIPAA and Medical Device regulations in software developmentWhat makes us so RAD?We take care of our people!Radformation offers top-tier medical, dental, vision care for employees and their families. Each role comes with stock options, our 401(k) & employer match vest immediately and you'll never have to stress about taking the time you need with self-managed PTO. We support our growing RAD families with generous parental leave, along with additional part-time work to help transition back into the swing of things. We are a fully remote team and while we may be apart, virtual events, yearly retreats and a collaborative work environment keep us close and connected.Cancer transcends any individual differences we may have. That's why at Radformation we celebrate diversity and are committed to creating an inclusive environment for all employees. We are proud to be an equal opportunity workplace and an affirmative action employer.Dependent on experience and location\n      "
}