{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-neural-magic-3604760280?refId=WC1hNK5T7IosorxZbu3P3w%3D%3D&trackingId=AR1JLmW2B9KZxqz5n09eXg%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Neural Magic is an early-stage AI software company democratizing high performance for deep learning models. Our goal is to reduce the cost and increase the performance of end-users deploying deep learning applications. Based on decades of research at MIT, Neural Magic has developed a software platform that allows developers to sparsify deep learning models to minimize footprint and run on CPUs at GPU speeds. Please look through our website and GitHub repos to get a feel of what we are about.Founded by an award-winning team of computer scientists and researchers out of MIT, we are a venture-backed company headquartered in Davis Square, Somerville, MA. Our investors include Amdocs, Andreessen Horowitz, Comcast Ventures, NEA, and Pillar VC.We are seeking a machine learning engineer to work closely with our product and research teams to develop SOTA deep learning software. This person will work closely with our technical and research teams to develop training and deployment pipelines, implement model compression algorithms, and productize deep learning research. If you are someone who wants to contribute to solving challenging technical problems at the forefront of deep learning, this is the role for you!ResponsibilitiesUse your understanding of machine learning to tackle meaningful technical problemsCollaborate with research and product development teams to build machine learning productsPrototype and implement appropriate ML algorithms, tools, and pipelinesCreate and manage training and deployment pipelinesCollaborate with a cross-functional team about market requirements and best practicesKeep abreast of developments in the fieldRequirementsProven experience as a machine learning engineer or similar roleSolid knowledge of machine learning and deep learning fundamentals with experience in one or more of computer vision, NLP, speech, reinforcement learning, generative models, etcKnowledge of common ML frameworks (like PyTorch or Keras) and libraries (like NumPy and scikit-learn)Strong programming skills with proven experience implementing Python-based machine learning solutionsAbility to interpret and implement research ideas and algorithmsCreative, collaborative, and innovation-focusedStrong sense of project ownership and personal responsibilityBachelor's in Computer Science, Mathematics or similar fieldBenefitsHealth Care Plan (Medical, Dental & Vision)Retirement Plan (401k, IRA)Paid Time Off (Vacation, Sick & Public Holidays)Family Leave (Maternity, Paternity)Short Term & Long Term DisabilityTraining & DevelopmentWork From HomeFree Food & SnacksWellness ResourcesStock Option PlanWe are an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.\n      "
}