{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-blackbird-ai-3590303295?refId=iajngyGh%2F6zFHqZGAgbH1g%3D%3D&trackingId=4bFuwtzk3jl0kqAz25zwJw%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nThis is a fully remote opportunity at Blackbird.AI. You will not be required to relocate.The Company:What has been the effect of disinformation on the world?Blackbird.AI creates leading-edge AI software to provide critical real-time insights to provide our clients with a deep understanding of ongoing disruptive narratives, their motives, and overall digital noise. We are united by our dedication to our mission. We believe that we have a responsibility to society and that our service is vitally needed by organizations and individuals to create an empowered and critical thinking society.If this mission resonates with you, we'd love to hear from you.The Opportunity:We are looking for a Machine Learning Engineer who can join our AI research and development efforts with a direct impact on our core platform. You will work with both engineering and business teams to best understand design requirements. Then, your role is to design and build practical high performance machine learning solutions.In this role, you will work on some of the latest cutting edge applications of machine learning applied to critical problems that affect businesses, governments and society. You will directly work with top management and key stakeholders to define solutions to critical problems that will have immediate impact and value at the platform and client levels. If you are passionate to work on massive, unstructured problems that can be solved using data, we are looking for you.RESPONSIBILITIES:Contribute to research and development focusing on the following areas: information extraction, multilingual NLP, automated summarization, graph network analysis, Vision, LLMs (Large Language Models).Manage the collection and annotation of large custom datasets for text or vision classification, unsupervised pre-training, translation, tagging, and other related problems.Capable of understanding and implementing state-of-the-art methods based on research papers and/or open source libraries, and push beyond the state-of-the-art.Experience with implementing efficient and scalable software systems in Python. Ability to integrate implemented software components into a fully functional software pipeline, and provide verification and validation against requirements.Knowledge of machine learning evaluation techniques, failure modes, and limitations.RequirementsMust Have:Minimum 2 years of professional experience working in Natural Language Processing or closely related field, with demonstration of successful delivery of novel research and/or product offerings.Masters degree or PhD from an accredited college/university in Computer Science, Computational Linguistics, Statistics, Mathematics, Engineering, Bioinformatics, Physics, Operations Research, or related fields (strong mathematical/static background with ability to understand algorithms and methods from a mathematical and intuitive viewpoint). Some exceptions can be made depending on exceptional past accomplishments/references. Experience with command-line scripting, data structures and algorithms, and the ability to work in a Linux environment, processing large amounts of data in a cloud environment.Highly skilled in Python development, as well as: Tensorflow, Pytorch, Keras and Scikit-Learn.Able to communicate scientific concepts to both technical and non-technical audiences.Nice to Have:Working knowledge of AWS and other cloud services.Experience creating novel datasets for scientific analysis or benchmarking.Capability to contribute at the system architecture level to enhance scalability, testability, robustness.Experience with generative models of fake text or images.Experience and top performances in online competitions / hackathons, such as, kaggle.Published research in areas related to machine learning, NLP, Vision or its applications.Record of contributions to open-source machine learning projects, or related endeavors.Experience writing detailed documentation of machine learning systems.BenefitsHealth Care Plan (Medical, Dental & Vision)Paid Time Off (Vacation, Sick & Public Holidays)Work From HomeStock Option PlanExciting career development prospects, to grow into leadership rolesTake note - due to the high volume of applicants, only shortlisted candidates will be notified. Thank you for taking the time to apply for the role at Blackbird.AI.Ll-Remote\n"
}