{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-ai-solutions-at-amd-3594449933?refId=8i2DT9bT%2F%2B0u7Z%2Fahj8gwA%3D%3D&trackingId=%2FI1SPzzmBumsix%2FUf8PzDg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nWHAT YOU DO AT AMD CHANGES EVERYTHING We care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences - the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives. This is who we are at our best. One Company. One Team.  AMD together we advance_ Machine Learning Engineer, AI Solutions  THE ROLE:This role will be part of the team of Software Engineers that are designing the next generation of ML and AI into the Enterprise Data Center GPU space.THE PERSON:We are looking for a machine learning engineer that is experienced in running large, distributed models on training and inferencing clusters. If terms like Horovod, MoE, FSDP, DDP, ZerO and Parameter servers are second nature, you are the right person. The large the cluster, the better your fit… KEY RESPONSIBILITIES:Experience training models on large clusters and managing checkpointing, learning rates, data sharing etc.Experience deploying inferencing models using tensor and model parallel techniques.Play a role in all the phases of software & model development, from requirement gathering, analysis, design, development, testing and final release to customers.Provide clear and timely communication related to status and other key aspects of the project to leadership team.Responsible for working with data scientist teams for resolving critical customer escalations on a need basis.Willingness to learn skills, tools, and methods to advance the quality, consistency, and timeliness of AMD software products.Experience with deep learning models and associated AI frameworks (PyTorch, TensorFlow, Jax (FLAN), Lightning, Deepspeed, Mosaic, Horovod, Collasal.ai)PREFERRED EXPERIENCE:BS with several years of related experience or MS with years of related experience or PhD with years of related experience in Computer Engineering or Electrical Engineering or Computer Science or related equivalent from top universitiesDeep experience with distributed training and inferencing frameworks like Horovod, Deepspeed, Lighting, Huggingface Training, Mosaic composer, MegatronDeep experience with AI/ML frameworks like Pytorch, Tensor flow, JAX, etc. is preferred.Knowledge of Acceleration platforms like GPU, TPU, APU, FPGAs in preferredLOCATION:San Jose, CA At AMD, your base pay is one part of your total rewards package.  Your base pay will depend on where your skills, qualifications, experience, and location fit into the hiring range for the position. You may be eligible for incentives based upon your role such as either an annual bonus or sales incentive. Many AMD employees have the opportunity to own shares of AMD stock, as well as a discount when purchasing AMD stock if voluntarily participating in AMD’s Employee Stock Purchase Plan. You’ll also be eligible for competitive benefits described in more detail here. AMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law.   We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.\n"
}