{
    "https://www.linkedin.com/jobs/view/artificial-intelligence-translational-data-scientist-at-novartis-institutes-for-biomedical-research-nibr-3642906547?refId=5QeqOS1dRMV0xhEDmUvIwA%3D%3D&trackingId=a9UkhEjttlpN%2FHvO5dRCAA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob Description766 million! This is the number of patients that were reached by Novartis medicines in 2021. Our oncology clinical trials aim to deliver new therapeutics for millions more. Help us bring innovative compounds to the clinic by building and applying AI models for patient stratification, drug combination selection and treatment outcome prediction.We are seeking an enthusiastic Artificial Intelligence (AI) expert with a curiosity about translational and early-stage clinical work supporting our ground breaking oncology drug discovery programs. You will join the Oncology Data Science team at NIBR Oncology, an outstanding collaborative environment with supportive and enthusiastic colleagues who will help your AI models achieve real-world impact.YOUR KEY RESPONSIBILITIES:Your responsibilities include, but are not limited to: Develop and deploy AI models for large- and medium-scale ‘omics and/or imaging datasets. Work closely with drug development and clinical teams to address key scientific questions in translational oncology research using pre-clinical, clinical and real-world evidence datasets. Demonstrate value of machine learning techniques in the context of biomarker and target identification, patient selection and clinical trial design. Develop scientific publications to communicate new findings to the wider scientific community.This position will be located at the Cambridge, MA site and will not have the ability to be located remotely. This position will require no travel as defined by the business (domestic and/ or international).EEO StatementThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, marital or veteran status, disability, or any other legally protected status. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration and empowers our people to unleash their full potential.Minimum RequirementsWHAT YOU’LL BRING TO THE ROLE:Essential: PhD in Machine Learning, Computer Science, Bioinformatics or a related field. At least 3 years’ experience working with deep learning frameworks (Pytorch / Keras / others), knowledge of architectures, limitations and pitfalls. Strong Python and R programming skills. Experience working with multi-modal patient data (‘omics as well as histology and clinical data), knowledge of biological sciences, preferably with regards to oncology. Clear communication with technical and non-technical stakeholders.Desirable requirements: Understanding of statistical inference principles. Knowledge of good research software engineering practices. Experience applying AI methods to clinical trial datasets. Familiarity with current trends in oncology drug development.Why Novartis?766 million lives were touched by Novartis medicines in 2021, and while we’re proud of this, we know there is so much more we could do to help improve and extend people’s lives.We believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.We believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!Imagine what you could achieve here at Novartis!COMMITMENT TO DIVERSITY & INCLUSION:Novartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.ACCESSIBILITY AND REASONABLE ACCOMMODATION:The Novartis Group of Companies are committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please send an e-mail to tas.nacomms@novartis.com call +1 (877) 395-2339 and let us know that nature of your request and your contact information. Please include the job requisition number in your message.The pay range for this position at commencement of employment in the US is expected to be between $130,400 and $195,600 /year; however, while salary ranges are effective from 1/1/23 through 12/31/23, fluctuations in the job market may necessitate adjustments to pay ranges during this period. Further, final pay determinations will depend on various factors, including, but not limited to geographical location, experience level, knowledge, skills and abilities. The total compensation package for this position may also include other elements, including a sign-on bonus, restricted stock units, and discretionary awards in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as vacation, sick time, and parental leave), dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment. If hired, employee will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.Join our Novartis Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/networkDivisionNovartis Institutes for BioMedical ResearchBusiness UnitOncology NIBRCountryUSAWork LocationCambridge, MACompany/Legal EntityNIBRIFunctional AreaData ScienceJob TypeFull TimeEmployment TypeRegularShift WorkNoEarly TalentNo\n      "
}