{
    "https://www.linkedin.com/jobs/view/marketing-data-scientist-at-sephora-3643305042?refId=zL9A%2FN9irrueIS1bf5Qolw%3D%3D&trackingId=OT91BbyQFgJnpjb1rUUe0A%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nJob ID: 230380Location Name: FSC REMOTE SF/NY/DC -173(USA_0173)Address: FSC, San Francisco, CA 94105, United States (US)Job Type: Full TimePosition Type: RegularJob Function: MarketingRemote Eligible: YesCompany OverviewAt Sephora we inspire our customers, empower our teams, and help them become the best versions of themselves. We create an environment where people are valued, and differences are celebrated. Every day, our teams across the world bring to life our purpose: to expand the way the world sees beauty by empowering the Extra Ordinary in each of us. We are united by a common goal - to reimagine the future of beauty.The OpportunityYour role at Sephora:As Marketing Data Scientist at Sephora, you will: Develop and implement analytics applications to transform raw data into meaningful information using data-oriented programming languages and visualization software. Develop data insights regarding improving marketing investments and business results. Analyze information from large structured and unstructured datasets. Work closely with marketing functions including Media Strategy, Creative, and Consumer Market Insights along with the investment strategy team financial planning and analysis, and external partners to manage efforts from end-to-end. Responsible for ensuring strategic and tactical marketing decisions are informed by data-driven insights. Develop customized Marketing Mix Modeling (MMM) projects involving specialized, nested regression models, forecasting/optimization, building dashboards, and presentations. Aggregate data sets from various database and publishers. Perform inferential statistical analysis in R statistical language to estimate marketing channel impact on sales and new customer acquisition. Position allows some work-from-home flexibility, with schedule to be approved by manager. Must be able to work on site as required.Minimum RequirementsMaster’s or foreign equivalent degree in Statistics, Economics, or a related field.Two (2) years of experience in a statistical analysis and media research for retail marketing metrics role.Experience Must IncludeExcelPowerPointCrimson HexagonAdobe AnalyticsMarine Marketing toolsTableauPower BIProgramming with R, SAS, VBA, Python, and SQLPredictive analysisData miningOptimizationForecastingClustering and classificationRegressionData envelopment analysisRate of Pay:  $153,088 to $169,000 per year.While at Sephora, you’ll enjoy… The people. You will be surrounded by some of the most talented leaders and teams – people you can be proud to work with. The learning. We invest in training and developing our teams, and you will continue evolving and building your skills through personalized career plans.The culture. As a leading beauty retailer within the LVMH family, our reach is broad, and our impact is global. It is in our DNA to innovate and, at Sephora, all 40,000 passionate team members across 35 markets and 3,000+ stores, are united by a common goal - to reimagine the future of beauty.You can unleash your creativity, because we’ve got disruptive spirit. You can learn and evolve, because we empower you to be your best. You can be yourself, because you are what sets us apart. This, is the future of beauty. Reimagine your future, at Sephora.Sephora is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, ancestry, citizenship, gender, gender identity, sexual orientation, age, marital status, military/veteran status, or disability status. Sephora is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Sephora will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.\n      "
}