{
    "https://www.linkedin.com/jobs/view/senior-data-scientist-marketing-at-otter-ai-3641763941?refId=rmg%2Bzagddt8Rr1uLJ5Xz4Q%3D%3D&trackingId=gIUWOmWPn83S60%2BwXtstKA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nThe OpportunityWe're looking for a Marketing Data Scientist to join as a member of the Engineering team to accelerate Otter's user and revenue growth. The candidate will be working with a variety of stakeholders (including the founding team) across the whole organization. The ideal candidate will be extremely curious, detail-oriented, have a strong background in statistics and be obsessed with results. You have experience driving business growth in an analytics role for a SAAS business. You understand the business metrics' definitions, drivers, and implications. You enjoy deriving quantitative understanding of user and customer behaviors across different stages of their user journey (acquisition, activation, engagement, decision to pay, retention and expansion). You are obsessed with details and can easily identify the data discrepancies. You are looking for the opportunity to expand your current scope and own the full user journey analytics. You enjoy making business recommendations using data and data visualizations. You are an experienced analyst looking to grow your responsibility by joining a fast-growing, well-funded technology start-up.Your ImpactPartner with our Marketing teams across growth marketing, revenue marketing, life cycle marketing, marketing analytics to acquire, engage, and convert users via multiple channelsDevelop and maintain marketing metrics such as annual recurring revenue (ARR), life time value (LTV), marketing attribution to evaluate the performance of our marketing effortBuild and deploy statistical models such as user lifetime value, product qualified leads, user segmentationTake a leading role in producing new datasets that unlock business opportunitiesDevelop hypotheses and test them with data, rather than solely or primarily attempt to glean patterns from the data already in front of usWork with data engineers in the entire ETL process and design details in data extraction, cleaning, and aggregation to develop reliable business reports that generate product insightsWe're Looking For Someone Who5+ years of work experience as a Data Scientist in an Internet product environmentBachelor degree in Computer Science, Electric Engineering, or related engineering fieldExperienced in data visualization tools like Tableau or Looker, and Excel spreadsheetData querying language experience in SQLScripting language experience in PythonAdvanced knowledge in MySQL and big data platforms (Snowflake, Hive)Familiar with ETL (Extract, Transform, Load) processesPerforming quantitative analysis including data mining on product data setsAdvanced experience in statistical methods such as experimental design, regression, causal inferenceAbility in translating vague business requests into concrete data sources and stake holders with verified resultsFamiliarity with paid media acquisition, advertisement targeting, or digital marketingMasters degree in Computer Science, Electric Engineering, or related engineering field is a plusAbout Otter.aiWe are in the business of shaping the future of work. Our mission is to make the future of communication more collaborative, accessible, and productive for all.We are growing fast, last year we recorded a total of over 150 million meeting minutes, announced a $50 million Series B and we were included in Business Insider's 10 AI startups that raised the biggest Series A and B list. In addition, Adam Cheyer the cofounder of Siri, Larry Heck the cofounder of Cortana and Greg Holmes, the first head of sales at Zoom, joined us as advisors.Otter.ai is an equal opportunity employer. We proudly celebrate diversity and are dedicated to inclusivity.Otter.ai does not accept unsolicited resumes from 3rd party recruitment agencies without a written agreement in place for permanent placements. Any resume or other candidate information submitted outside of established candidate submission guidelines (including through our website or via email to any Otter.ai employee) and without a written agreement otherwise will be deemed to be our sole property, and no fee will be paid should we hire the candidate. Salary rangeSalary Range: $150,000 to $190,000 USD per year.\n      "
}