{
    "https://www.linkedin.com/jobs/view/lead-data-scientist-content-at-patreon-3575003269?refId=8B7jt77PBASrk1HBD%2BJ1Iw%3D%3D&trackingId=1P6OqnPG4rKy6Kgc33k1GA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Patreon is the best place for creators to build memberships by providing exclusive access to their work and a deeper connection with their communities. We’re building a content and community platform where creators can engage directly with their fans and monetize their creativity, while maintaining full ownership over the work they make and the communities they create.We’re leaders in the membership space with 250,000+ active creators and over $3.5 billion paid directly to creators on our platform. Our team is building tools to optimize the creator-to-fan relationship, including native video, enhanced podcasting features, improved creation tools, and new community experiences. We’re continuing to invest heavily in building the most talented team in the Creator Economy and are looking for a Staff Data Scientist to partner with our Content team and support our mission.About The RoleYou’ll provide data partnership for new product launches by building and executing on launch measurement plans, advising on data modeling for new products, and ensuring we are making data-informed decisions with our new and existing products. You’ll conduct quantitative research to inform product strategy and opportunities, design metrics, and devise learning methods (including experiments) to test hypotheses and learn about new product features. You'll clearly communicate your technical work to the data team, your cross-functional partners, executive leadership, and the rest of the company.You’ll be a cultural and technical leader on the data science team. About YouYou have spent 8+ years helping product teams make great decisions with data and have provided partnership for 0-1 products. You have experience with experimentation and possess a very strong statistical inference skillset. You have solid analytical thinking. You ask the right questions and strive to see beyond the numbers to understand what an analysis represents in terms of real-world applications. You have a bias for using the right tools to get a job done with maximum efficiency. You have experience making tradeoffs between speed and accuracy.You are a SQL expert and have experience in Python or R to perform statistical analyses.You have a track record of building strong relationships with product, engineering, research, and design teammates. You are an expert communicator with a love for clarity. About PatreonPatreon powers creators to do what they love and get paid by the people who love what they do. Our team is passionate about making this mission and our core values come to life every day in our work. Through this work, our Patronauts:Put Creators First | They’re the reason we’re here. When creators win, we win. Build with Craft | We sign our name to every deliverable, just like the creators we serve. Make it Happen | We don’t quit. We learn and deliver. Win Together | We grow as individuals. We win as a team. We hire talented and passionate people from different backgrounds across the organization. If you’re excited about a role but your past experience doesn’t match with every bullet point outlined above, we strongly encourage you to apply anyway. If you’re a creator at heart, are energized by our mission, and share our company values, we’d love to hear from you.Patreon is proud to be an equal opportunity employer. We provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, veteran status, or any other protected class.Patreon offers a competitive benefits package including and not limited to salary, equity plans, healthcare, unlimited paid time off, company holidays and recharge days, commuter benefits, lifestyle stipends, learning and development stipends, patronage, parental leave, and 401k plan with matching.The posted range represents the expected salary range for this job requisition and does not include any other potential components of the compensation package, benefits and perks previously outlined. Ultimately, in determining pay, we'll consider your experience, leveling, location and other job-related factors.The posted range represents the expected salary range for this job requisition and does not include any other potential components of the compensation package, benefits and perks previously outlined. Ultimately, in determining pay, we'll consider your experience, leveling, location and other job-related factors.San Francisco Pay Range$206,000 — $275,500 USD\n      "
}