{
    "https://www.linkedin.com/jobs/view/project-scientist-robotics-institute-at-carnegie-mellon-university-3618105070?refId=V4cSrEECU0o9AhNlfvudlQ%3D%3D&trackingId=hj4nkG0ljMrhiM0Uc0l1Jw%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        The Robotics Institute at Carnegie Mellon University was established in 1979 to conduct basic and applied research in robotics technologies relevant to industrial and societal tasks. Seeking to combine the practical and the theoretical, we have diversified efforts and approaches to robotics science while retaining the original goal of realizing the potential of the robotics field.Carnegie Mellon University’s Robotics Institute is searching for a Project Scientist. This is an excellent opportunity for someone who thrives in an interesting and challenging work environmentJob Functions:Conduct research to quantify the performance of AI systems that are used to assist human operators. Analyze aspects such as task difficulty, AI performance, human performance, and human trust in AI system using datasets from a variety of AI decision support systems. Example application areas include object detection in images and sliding-autonomy teleoperation of robotic vehicleCoordinate with collaborating investigators from a diverse set of AI-related research projects to understand the problems they are addressing, the data sets they are using, and the algorithmic approaches they are using, and the results they are generating. Acquire data sets from these partners, analyze and use that data to support the human-AI quantification research tasks described aboveAggregate results from self-conducted research and collaborating research projects into presentation materials. Present aggregated results to managers and sponsors in presentation (e.g. powerpoint) and written formatsPreferred QualificationsPhD in computer science, data science, or engineering. 5 years of experience doing AI-related research in a university setting.Required SkillsetsAbility to independently lead research activities including collaboration with diverse partners. Ability to parse and analyze datasets in a number of formats, including RGB images, video, generic binary files, and ROS bags. Proficiency in common programming languages, such as C/C++, python, and MATLAB. Proficiency in Linux and Windows operating systems.Proficiency in common office software such as Microsoft Word, Excel, and Powerpoint, and analogous G-Suite tools.Working knowledge of common software development and version control systems such as GitHubNice-to-have SkillsetsWorking knowledge of contemporary AI methods, such as deep neural network tools and architectures, image processing techniques, and machine learning methods.Experience using and developing with AI open-source libraries such as ROS, OpenCV, PyTorch, Keras, etc.Inclusion, collaboration and cultural sensitivity are valued competencies at CMU. Therefore, we are in search of a team member who is able to effectively interact with a varied population of internal and external partners at a high level of integrity. We are looking for someone who shares our values and who will support the mission of the university through their work.CMU’s COVID-19 Vaccination Requirements:  As a condition of employment, Carnegie Mellon University requires all staff and faculty working in the United States to be fully vaccinated, including a booster when eligible, against COVID-19. Prior to commencement of employment, new hires in the United States must provide proof of vaccination or obtain an approved exemption. (Exemptions may be requested for medical reasons or for religious or strong moral or ethical conviction.) Those granted an exemption must comply with all applicable COVID-19 mitigation requirements. The most up-to-date information on CMU's COVID-19 mitigation requirements can be found here: Minimum Requirements to Return to Campus.LocationPittsburgh, PAJob FunctionEngineering, Research and Project ScientistsPosition TypeStaff – RegularFull Time/Part timeFull timePay BasisSalaryMore Information: Please visit “Why Carnegie Mellon” to learn more about becoming part of an institution inspiring innovations that change the world. Click here to view a listing of employee benefitsCarnegie Mellon University is an Equal Opportunity Employer/Disability/Veteran. Statement of Assurance\n"
}