{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-remote-at-curai-health-3575091443?refId=TSA66BqMtmLB7tEBHKoNsA%3D%3D&trackingId=EGWxOmnxbxkfN49u2uOn6A%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Our mission at Curai is to make high-quality healthcare accessible to all. We are fulfilling this audacious mission by building a scalable virtual-first primary care service that provides patients with high-quality care anytime, anywhere, from any device, at a very affordable price, by blending high-touch clinical care and artificial intelligence.Our company is remote-first and we consider candidates across the United States.Machine Learning at CuraiWe are looking for a Senior ML Engineer to join the machine learning team at Curai. Our team is responsible for Curai’s ML/automation technology and drives the strategy: ML as part of the physician care team will drastically reduce the cost and increase the efficiency of providers. Your work will have a tremendous direct impact on both provider and patient-facing ML-augmented applications, thereby providing low-friction, high-quality care to patients of Curai Health.We are primarily a text-based service and NLP is at the core of our ML work. With recent advances in large language models, we are seeing a tremendous acceleration in capabilities. A non-trivial part of our work involves appropriately leveraging and building on top of these models thoughtfully (and with scaffolding) to our use cases and backing them up with a sound automated evaluation. In addition, we use the in-house deidentified data as robust feedback data for continuously improving the ML models.We are excellent collaborators, within our team and across teams with product owners, engineers, and clinicians to deliver automated products for doctors and patients. A successful candidate will own and help engineer end-to-end, AI/ML-powered automated systems in service of better health outcomes at lower costs.Who You AreNone of these individually are hard requirements, but they do describe the type of folks that we think would be most effective and happy at Curai. You…Are a self-starter and have a growth mindsetHave an ownership mentalityEnjoy tackling complex problems in a scientific and data-driven wayThrive in ambiguity and love tackling complex problems that span multiple systemsEnjoy thinking through trade-offs with mindfulness of near-term needs and Curai’s long-term strategyAre collaborative and appreciate working with people with diverse expertiseWhat You’ll DoDesign, build, deploy, and improve machine learning models, including those that are based on large language models. These models are used in our patient and physician-facing product features and developed in collaboration with our clinical innovation, research, engineering, and design teamsDesign offline and online evaluations to test ML product features, and perform data-driven analysis of the results to find actionable insightsEnable rapid and rigorous scientific innovation by a multidisciplinary team of Curai clinicians, engineers, and researchers, through platform, tools, and documentation.Participate in interviewing diverse talent to build and grow a strong ML engineering teamWhat You’ll Need“End-to-end” experience building ML production systems: Along with strong ML fundamentals, you will need exposure to the entire lifecycle of machine learning production systems, such as data processing, modeling, deployment, monitoring, maintenance, and improving the models over time using feedback loopsExperience in natural language processing applications\"Product sense\" or intuition on what to build: With guidance, you will need to be able to translate product intuition into data-driven hypotheses that result in impactful machine learning/engineering solutionsStrong communication skills: This role involves collaboration with product, engineering, clinical, and research teams. Understanding the mental models of the audience and communicating ideas crisply to this diverse set of stakeholders will be a vital part of the role. You should be comfortable leading cross-functional machine learning product initiatives, from conception to successful product outcomes2+ years of industry experience in ML/NLP including building production systemsThe annual base salary range for this position is between $150,000 - $200,000. Stock grants also play a key part in any offer, they increase your overall compensation package significantly based on company success. Please note that the base salary range is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies, and work location.What We OfferCulture: Mission driven talent with great colleagues committed to embodying our values, collaborating closely, and driving performanceWellness: Unlimited PTO, flexible working hours, and remote working optionsBenefits: Excellent medical, dental, vision, flex spending plans, and paid parental leaveFinancial: 401k plan with employer matchingCurai Health is a startup with a small, but world-class team from high tech companies, AI researchers, practicing physicians, to team members from non-traditional career paths and backgrounds. We also have research partnerships with leading universities across the country and access to medical data that facilitates research in this space. We are a highly collaborative, data-driven team, focused on delivering our mission with funding from top-tier Silicon Valley investors including Morningside, General Catalyst, and Khosla Ventures.At Curai Health, we are highly committed to building a diverse and inclusive environment. In keeping with our beliefs and values, no employee or applicant will face discrimination or harassment based on race, color, ancestry, national origin, religion, age, gender, marital domestic partner status, sexual orientation, gender identity, disability status, or veteran status. To promote an equitable and bias-free workplace, we set competitive compensation packages for each position. We are looking for teammates that are mission-driven, embody our core values, and appreciate our transparent approach.\n      "
}