{
    "https://www.linkedin.com/jobs/view/data-scientist-at-nzero-3641795570?refId=Z0DBOKeTQWN2Lb9ZFWXsIg%3D%3D&trackingId=xoYnyyuT6rIovGNkXIoFAQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        We are seeking a talented Data Scientist to join our team at nZero. As a Data Scientist, you will play a crucial role in developing innovative emissions reduction solutions for our customers by leveraging advanced data analytics and methodologies. Your expertise in both environmental and technical fields will contribute to shaping our platform and empowering clients to make informed decisions for a more sustainable future.Key Responsibilities:Utilize your expertise to design, develop, and implement advanced data analytics models and algorithms for the analysis of large-scale environmental and emissions data. Collaborate with cross-functional teams to identify and recommend effective strategies for emissions reduction to benefit our customers. Stay up-to-date with the latest advancements in environmental science, data analytics, and carbon management techniques, and apply this knowledge to enhance our offerings. Present complex data findings clearly, concisely, and visually compellingly to a diverse audience. Proactively identify opportunities to improve and expand the capabilities of our carbon management system. Contribute to developing data-driven tools, dashboards, and reports for internal and external stakeholders. Provide technical expertise and guidance to junior team members when necessary. Qualifications:Preferred: PhD in an environmental or technical field such as Environmental Science, Computer Science, or Environmental Engineering. A Master's degree is highly recommended. A minimum of 3-5 years of experience in a Data Scientist role or a related position, preferably within the environmental or sustainability sector. Strong knowledge of machine learning algorithms, statistical modeling, and data visualization techniques. Proficiency in programming languages such as Python or R, including libraries like pandas and scikit-learn. Excellent problem-solving, analytical, and critical thinking skills. Ability to work both independently and collaboratively in a fast-paced, dynamic startup environment. Exceptional communication and presentation skills, enabling you to effectively convey complex concepts to both technical and non-technical stakeholders. If you are a passionate Data Scientist with a desire to make a meaningful impact on emissions reduction and sustainability, we encourage you to apply for this position. Join our team at nZero and contribute to driving innovation and creating a more sustainable future through data-driven solutions.About nZero:nZero is a near real-time (NRT) carbon data and sustainability platform that gives NGOs, government agencies, and organizations the accurate emissions data they need to reach net zero, communicate their story, and make smart decisions that benefit the health of the planet. Unlike carbon management offerings who rely on third-party data and opaque averages, nZero gathers accurate, first-party, contextual data into a comprehensive view, making it simple for organizations to pinpoint opportunities within their operations to implement carbon reduction actions and spend smarter along the way. nZero's awards and recognitions include the Economic Development Authority of Western Nevada (EDAWN) Existing Industry 2022 \"Leader in Sustainability\" Award, Business Intelligence Group's 2022 Sustainability Product of the Year Award, a place on TIME Magazine's 2022 Best Inventions List in the Sustainability Category, as well as an honorable mention on Fast Company's 2022 World-Changing Ideas List.\n      "
}