{
    "https://www.linkedin.com/jobs/view/data-engineer-analytics-at-meta-3643351502?refId=5QeqOS1dRMV0xhEDmUvIwA%3D%3D&trackingId=4SLMpVmw3Ou1jN3i53iOlA%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Are you passionate about Facebook’s product, analytics and technology? The Analytics, Data Engineering team is looking for fast-moving analytics candidates and data junkies who want to make an impact. Our data warehouse team works very closely with Product Managers, Product Analysts and Internet Marketers to figure out ways to acquire new users, retain existing users and optimize user experience - all of this using massive amounts of data. In this role, you will see a direct link between your work, company growth, and user satisfaction. You will work with some of the brightest minds in the industry, and you'll have the opportunity to solve some of the most challenging business problems on the web and mobile Internet, at a scale that few companies can match.Data Engineer, Analytics Responsibilities:Architect, implement and deploy new data models and data processes in productionPerform data analysis to generate business insightsInterface with Engineers, Product Managers and Product Analysts to understand product goals and data needsBuild data expertise and own data quality for allocated areas of ownershipManage data warehouse plans for a product or a group of productsSupport critical data processes running in productionMinimum Qualifications:Currently has, or is in the process of obtaining, a Bachelors or Masters degree in Computer Science, Mathematics, or related technical fieldProgramming knowledge in Python or JavaKnowledge of SQLKnowledge of database systemsMust obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employmentCurrently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta.Preferred Qualifications:Experience thriving in a fast-paced work environmentCurious, self-driven, analytical and excited to play with dataExperience in collaborating with individuals and organizationsMeta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. We may use your information to maintain the safety and security of Meta, its employees, and others as required or permitted by law. You may view Meta's Pay Transparency Policy, Equal Employment Opportunity is the Law notice, and Notice to Applicants for Employment and Employees by clicking on their corresponding links. Additionally, Meta participates in the E-Verify program in certain locations, as required by law\n      "
}