{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-affinity-co-3641762805?refId=f4T81JglwjXJdCnTEqLSRw%3D%3D&trackingId=dIE1pbz%2Bxws7Z%2F105LZM5g%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Affinity stitches together billions of data points from massive datasets to create a powerful, accurate representation of the world's professional relationship graph. Based on this data, we offer our users the insights and visibility they need to nurture and tap into the opportunities in their team's network.Reporting to the Senior Engineering Manager, Relationship Intelligence and Machine Learning, you'll help create the magic that underlies Affinity's industry-leading relationship intelligence. You'll define how Affinity uses our massive datasets (including email messages, calendar events, and data pulled from around the public internet) to extract actionable information and insights for our users.This is an applied machine learning position and not a research role. The expectation is that the candidate will be a strong contributor to the development of our ML Ops and ML Engineering capabilities, as well as doing modeling work. We value short iterations that deliver value to our customers.What you'll be doing :Take projects from concept to production, including feature engineering, model construction, deployment, and model observability and evaluation. Help define our data roadmap. Which problems are amenable to AI/ML techniques, and which are better solved via simpler non-statistical methods? How might we define and evaluate data quality? Which models and techniques are best suited to our domain? You'll collaborate with our product and engineering teams to help to answer these questions and more. Build Machine Learning data solutions for production, such as Q&A using Deep Learning and NLP techniques, leveraging open source models and tools. Collaborate with the rest of our data pipeline and ML engineering teams to build the robust, high-scale systems that underlie all of our data processing and ML Operations. Qualifications:Don't meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every qualification. At Affinity, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you're excited about this role, but your past experience doesn't perfectly align with the qualifications above, we encourage you to apply anyways. You may be just the right candidate for this or other roles.Required:You have 3+ years of industry experience in software development. You have a minimum of 2 years of experience with applied machine learning engineering in production. You are a builder and care deeply about building systems and products that deliver meaningful value to users quickly and iteratively. You have experience working with large, multi-terabyte datasets, and are comfortable with tools for high-scale data ingestion, transformation, analysis, and prediction. You're excited to work collaboratively within engineering and across functional teams. You're eager to contribute your ideas and experiences to help Affinity continuously improve as a product and as a company. Nice to have:You have experience with NLP techniques and domains, including Named Entity Recognition, and Deep Learning. Experience with Databricks and Delta Lake. Experience working with AWS, Kubernetes. Experience with entity resolution and enrichment-focused data pipelines. How we work:Our culture is a key part of how we operate as well as our hiring process:We iterate quickly. As such, you must be comfortable embracing ambiguity, be able to cut through it, and deliver incremental value to our customers each sprint. We are candid, transparent, and speak our minds while simultaneously caring personally with each person we interact with. We make data driven decisions and make the best decision for the moment based on the information available. Join us in enabling every professional on the planet to succeed by harnessing the power of their relationships.If you'd want to learn more about our values click here.What you'll enjoy at Affinity:We live our values as playmakers, obsessed with learning, caring personally about our colleagues and clients, are radically open-minded, and take pride in everything we do. We pay your medical, dental, and vision insurance with comprehensive PPO and HMO plans. And provide flexible personal & sick days. We want our team to be happy and healthy :) We offer a 401k plan to help you plan for retirement. We provide an annual budget for you to spend on education and offer a comprehensive L&D program – after all, one of our core values is that we're #obsessedwithlearning! We support our employee's overall health and well-being and reimburse monthly for things such as; transportation, Home Internet, Meals, and Wellness memberships/equipment. Virtual team building and socials. Keeping people connected is essential. Please note that the role compensation details below reflect the base salary only and do not include any variable pay, equity, or benefits. This represents the salary range that Affinity believes, in good faith, at the time of this posting, that it will pay for the posted job.A reasonable estimate of the current range is $87,000 to $147,000 USD. Within the range, individual pay is determined by factors such as job-related skills, experience, and relevant education or training.About AffinityWe have raised over $120M and are backed by some of Silicon Valley's best firms, with over 2,700 customers worldwide on our platform. We are proud to have a 4.5 Star Glassdoor rating and recently ranked; Inc.'s Best Workplaces of 2022 and Great Places to Work 2022. Passionate about helping dealmakers in the world's biggest relationship-driven industries to find, manage, and close the most important deals; our Relationship Intelligence platform uses the data exhaust of trillions of interactions between Investment Bankers, Venture Capitalists, Consultants, and other strategic dealmakers with their networks to deliver automated relationship insights that drive over 450,000 deals every month.\n      "
}