{
    "https://www.linkedin.com/jobs/view/data-scientist-at-diagnostic-robotics-3641763549?refId=gePxNpObcBnzpNgZdRapcw%3D%3D&trackingId=98NSuEgzYWzROpIyvTJI3g%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        About the opportunity:We at Diagnostic Robotics imagine a world where the most advanced technologies in the field of artificial intelligence can make healthcare better, cheaper, and more widely available. Diagnostic Robotics' systems are trained on tens of billions of claims data points and nearly 100 million patient visits. We support global and regional health plans, employers groups and providers, by creating seamless, data-driven interactions that integrate seamlessly into major touchpoints along the patient journey. Our goal is to provide high-value decision support while slashing administrative burdens, massively reducing the cost of care, improving patient experiences, and saving lives.As part of our continued global expansion, we are looking for a Full-Cycle Data Scientist to research, develop, maintain, test and evaluate data solutions, ML models and experiments. This person will work with top talent in the industry including data engineers and physicians (domain experts) to solve real world problems with AI-based tools using billions of medical data entries. As part of the Data Science group, we publish literature and our products are used daily by millions of patients.What you'll do:Lead complex projects from scratch, while communicating with different stakeholders Bringing machine learning based solutions to our AI product from research to production. Research, develop healthcare models, and evaluate them on large, complex data sets. Work closely with data engineers and physicians on medical datasets. Creating algorithmic prototypes and turning them into shippable features and models in the fields of: causal machine learning, transfer learning, explainability, fairness, and more. Skills & Experience:M.Sc. in Computer Science, Statistics, Applied Mathematics, Electrical Engineering or related field with publications at top tier machine learning conferences or medical journals. 5+ years of hands-on experience building machine learning solutions to real world problems. Proven technical experience to lead projects from research to production. Strong research capabilities, problem solving and critical thinking skills. Ability to communicate clearly scientific data to different stakeholders. 5+ experience with Python and the Data science stack (Pandas, NumPy, Visualizations packages, Keras, etc.). Experience with data engineering and orchestration tools (e.g. Argo, Kubernetes, etc.) - AdvantageExperience with medical datasets is an advantage - (e.g. EMR, Administrative)Location- East coastWhy you should join our teamWe strive to create a better world by improving healthcare. To help turn our vision into reality, we've recruited a strong, talented and diverse team. We hire the best and brightest we can find and give them the space they need to succeed while also making a real impact. Our US team works remotely from different locations around the country, collaborating with our team in Israel to execute our shared mission. We offer competitive benefits and compensation packages, including benefits such as medical insurance with 100% of the premiums covered by the company, vision and dental insurance, PTO, 401K matching, virtual and in-person team building activities, and continuing education, among others. In addition, we provide a work from home stipend so that our employees can purchase equipment to make their home office comfortable and productive..Diagnostic Robotics is a global company that strives to ensure equal opportunities for all of our employees and promotes the recruitment of diverse talents to our global teams regardless of race, color, religion, sex, national origin, age, disability, or sexual orientation. As part of our company values, we encourage curiosity, diversity, and innovation from all our employees, we value collaboration and prioritize teamwork to ensure we meet our goals.As a rapidly growing company with a passionate mission, we are looking for the brightest and most talented people to join our team. If you're looking for an environment where you'll be challenged, rewarded and where your voice matters, we invite you to apply!\n      "
}