{
    "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-chubb-3629083665?refId=mvNBzp29zD3BRrxE9RaN6w%3D%3D&trackingId=O1zanRAWhntecxk4d8Ogkw%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Chubb is the world’s largest publicly traded property and casualty insurer. With operations in 54 countries, Chubb provides commercial & personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance, and life insurance to a diverse group of clients. Chubb is also defined by its extensive product and service offerings, broad distribution capabilities, exceptional financial strength and local operations globally.This role is aimed at designing, developing, and deploying machine learning solutions to solve complex business problems. The role will need to work in close partnership with multiple stakeholders including Business team, Data Scientist, IT for the solution deployment. The ideal candidate should have a strong background in software engineering and some level of familiarity with machine learning techniques. Additionally, the role will be responsible for defining and designing the infrastructure requirement to support machine learning workloads in a cloud-based environment. The person will work closely with the IT team to ensure that the infrastructure is scalable, reliable, and secure.Collaborate with Data Scientists and IT teams to develop machine learning models and algorithmDesign and write production-level code that meets high standards for machine learning applicationsPerform data formatting and manipulation to ensure data is compatible with machine learning modelsCollect and analyze data from diverse internal and external source systems and assess the effectiveness and accuracy of the dataDevelop and write testing queries to ensure high quality modelsSet-up up CI/CD pipeline for machine learning modelsOptimize machine learning models for high performance and scalabilityExperience with ML models, NLP techniques, and relevant python librariesAbility to run security checks and identify vulnerabilities in the codeImplement and maintain machine learning infrastructure in a cloud-based environmentStay up-to-date with the latest machine learning techniques and technologiesQualificationsBachelor’s or Master’s degree in Data Science, Mathematics, Computer Science, Analytics, or a related field. 3+ years’ experience in deployment of machine learning models Strong programming skills in python and pysparkUnderstanding of data models / relational databasesExperience with Github and MLOps is a mustFamiliarity with continuous integration/continuous deployment (CI/CD) tools such as Jenkins is preferredExcellent problem solving and analytical skillsStrong communication and collaboration skillsUnderstanding of ML concepts, NLP, text analytics, and deep learningExperience working with Azure is a plusIn Jersey City, NJ the pay range for the role is $101,000 to $172,000. The specific offer will depend on an applicant’s skills and other factors. This role may also be eligible to participate in a discretionary annual incentive program. Chubb offers a comprehensive benefits package, more details on which can be found at https://careers.chubb.com/global/en/north-america. This range is specific to Jersey City, NJ and may not be applicable to other locations.EEO StatementAt Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion,and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin,ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law.Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliationagainst any individual who reports discrimination or harassment.354858\n"
}