{
    "https://www.linkedin.com/jobs/view/computer-vision-researcher-at-university-of-california-san-francisco-3620335467?refId=8B7jt77PBASrk1HBD%2BJ1Iw%3D%3D&trackingId=a1Gd7HTuY4x9T0qOgrer4w%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Cardiovascular Research InstPart Time70871BRJob SummaryThe Fahy Laboratory is involved in cutting edge research focused on understanding mechanisms and improving treatment of airway disease, with applications to novel diagnostics and therapeutics. One aspect of the research program requires radiological analysis of chest CT scans of patients with lung disease to identify disease phenotypes and to understand impact on lung function. We aim to develop and validate algorithms to automate analysis of these scans, with the ultimate goal of providing a tool for clinicians to diagnose and select patient specific treatments.Uses professional software engineering and data science concepts, methodologies, and research findings to support projects of moderate scope and complexity. Applies computer and inferential science principles to resolve a variety of analysis and research issues. Performs programming, reflecting an understanding of computer science and AI principles. Works on assignments of moderate scope where data studies and inquiry require a review of a variety of factors. Assists in additional analyses as needed to achieve research objectives.The computer vision researcher will work closely with senior group members to develop and implement quantitative imaging and deep learning algorithms to enable automated analysis of CT scans. The data scientist will perform image processing and data curation of large radiology data sets and will interface with collaborating clinicians including radiologists and pulmonologists to implement algorithms.Overall, the individual employed will have an opportunity to contribute to an exciting research program while being immersed in translational research and in applications of data science in a clinical setting.To see the salary range for this position (we recommend that you make a note of the job code and use that to look up): TCS Non-Academic Titles Search (ucop.edu)Please note: The compensation ranges listed online for roles not covered by a bargaining unit agreement are very wide, however a job offer will typically fall in the range of 80% - 120% of the established mid-point. An offer will take into consideration the experience of the final candidate AND the current salary level of individuals working at UCSF in a similar role.For roles covered by a bargaining unit agreement, there will be specific rules about where a new hire would be placed on the range.To learn more about the benefits of working at UCSF, including total compensation, please visit: https://ucnet.universityofcalifornia.edu/compensation-and-benefits/index.htmlDepartment DescriptionThe Cardiovascular Research Institute (CVRI) performs cutting edge research illuminating cardiovascular and pulmonary biology and disease and trains clinicians and scientists to become future leaders of these fields. The Fahy lab at CVRI studies asthma and other airway diseases in a human centered way, and is focused on uncovering disease mechanisms and improving treatments for these diseases. This particular research program is focused on applications of imaging in understanding and treating airway disease.Required QualificationsBachelor’s degree in Computer / Computational / Data Science, or Engineering with computer / computational / data specialization and/or an equivalent combination of education/experience.2-3 years relevant progressive experience.Self-motivated and works independently and as part of a team.Basic knowledge in deep learning.Working knowledge of HPC / Data Science / CI.Working knowledge of relevant computer programming skills:Scientific scripting language such as Python or MatlabGeneral principles of computer programmingBasic knowledge or ability to learn common tools for data management and analysis including machine learning (i.e. Tensorflow, Torch), GPU toolsets (CUDA), database software (SQL, Mongo, or variants), radiology imaging (DICOM), and general scientific computing.Demonstrated working knowledge of one of the following: Scalable systems, distributed systems, or systems performance.Ability to manage multiple assignments through prioritizing tasks and managing time.Preferred QualificationsMaster’s degree in Computer / Computational / Data Science, or Domain Sciences withcomputer / computational / data specialization preferred.Coursework or a degree in biological sciences preferred.Scientific visualization for communication with interdisciplinary teamsInterpersonal skills in order to work with both technical and non-technical personnel at various levels in the organization, and to iteratively improve data science methodologies working with biomedical domain experts.Basic knowledge with applications of deep learning in radiology or other biomedical fields. About UCSFThe University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences. We bring together the world’s leading experts in nearly every area of health. We are home to five Nobel laureates who have advanced the understanding of cancer, neurodegenerative diseases, aging and stem cells.Pride ValuesUCSF is a diverse community made of people with many skills and talents. We seek candidates whose work experience or community service has prepared them to contribute to our commitment to professionalism, respect, integrity, diversity and excellence – also known as our PRIDE values.In addition to our PRIDE values, UCSF is committed to equity – both in how we deliver care as well as our workforce. We are committed to building a broadly diverse community, nurturing a culture that is welcoming and supportive, and engaging diverse ideas for the provision of culturally competent education, discovery, and patient care. Additional information about UCSF is available at diversity.ucsf.eduJoin us to find a rewarding career contributing to improving healthcare worldwide.Equal Employment OpportunityThe University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information.OrganizationCampusJob Code and Payroll Title004270 CMPTL AND DATA SCI RSCH SPEC 2Job CategoryProfessional (Non-Clinical)Bargaining Unit99 - Policy-Covered (No Bargaining Unit)Employee ClassCareerPercentage50%LocationParnassus Heights (SF)ShiftDaysShift LengthVariableAdditional Shift Details50-100% (Variable); 20-40 hours/week\n      "
}