{
    "https://www.linkedin.com/jobs/view/data-scientist-at-exo-freight-3625992204?refId=saMAeInklVwHXuwmOYbfjA%3D%3D&trackingId=1GYAtsqPR3IyPKcXvLqKpQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card": "\n        Exo Freight provides next-generation technology that is transforming trucking logistics. Every day in the US, there are still hundreds of thousands of truck loads that are booked and coordinated by phone, fax or email. Exo Freight automates the process and adds logistics, banking, and management technology to help shippers like Walmart manage and source trucking capacity, and to help trucking companies manage their fleet and get paid quickly. Our starting point is open deck shipping - a $135 Billion dollar market - which is how you transport large and odd shaped loads.About The Role As a Data Scientist on the Data Science team, you will own the pricing model and an intelligent system designed to comprehend various documents, such as the bill of lading. By closely collaborating with experts in pricing, document intelligence, and machine learning, you will contribute to the development of world-class automated decision-making. Your role will involve making precise and timely pricing predictions, which are crucial to EXO Freight's long-term success and ongoing market leadership.Responsibilities Owning the full Data Science life-cycle from conception to prototyping, testing, deploying, and measuring its overall business impact. Leveraging machine learning, statistical, and econometric time-series techniques to develop an accurate pricing model for freight. Collaborating with cross-functional partners such as engineering, product management, and account managers to build interfaces to your models. Building data-driven decision making with our EXO Freight business stakeholders and to enhance the experience of our external stakeholders. Identifying foundational research areas that align business organizations across EXO Freight and collaborating with leadership on Data Science strategy. Driving strategic initiatives across the broader org as a leader at EXO Freight. Owning team development cycles, managing risk, and bringing stakeholders along for the ride.What You Bring To The Party 2+ years of experience in data science type roles. Highly proficient in Python and SQL. Strong expertise in quantitative research and applied statistical methods. History of driving decision-making across business leadership with strong communication skills, ability to synthesize information and desire to influence. Understanding of Machine Learning techniques and how to apply them. Intuitive sense of how quantitative and technical work aligns closely with business priorities and business value. Thrives in a transparent, agile and collaborative environment. Be really excited with the idea of building something new, for a business tackling freight in an entirely different way. Bachelor's Degree in Engineering or Computer Science or technical equivalent.Perks: Competitive Salary Flexible time offEXO Freight is an equal employment opportunity employer. We evaluate qualified candidates without regard to race, color, religion, gender, age, gender identity, sexual orientation, national origin, disability, age, military or veteran status, disability, or any other legal protected characteristics.\n      "
}