{
    "https://www.linkedin.com/jobs/view/junior-ai-ml-software-developer-at-paradyme-inc-3641248551?refId=v9rDEevrok0LdRXj7hl5LA%3D%3D&trackingId=9vuO%2FSiRTE4W8f6ISPLAdw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card": "\nOverviewParadyme Management is a rapidly growing government technology leader that puts service first, for its customers, its team and the communities it supports. Paradyme harnesses DevSecOps and Agile development processes to deliver exceptional results for digital transformations. With headquarters office in Tysons Corner, VA, Paradyme’s award-winning culture sets it apart through its team’s deep commitment to service and collaboration with its customers, each other and the community. Learn more at www.paradymemanagement.com .ResponsibilitiesParadyme has partnered with an industry leader in enterprise Artificial Intelligence software and is seeking a talented Junior AI/ML Software Developer to help deliver solutions to our customers. Together we’re accelerating our client’s digital transformation through the building and deployment of data-driven, scalable AI solutions.The Junior AI/ML Software Developer will work alongside a team of highly skilled engineers in the development of AI applications. A motivated and qualified candidate will not only have hands on development experience in (JavaScript, Python or Java) but also a willingness to collaborate with teams to solve problems.Paradyme will provide the selected candidate with two weeks of intensive product training along with continuous on the job training and development. People are our greatest asset and the staff on our AI team will benefit from mentorship and professional development opportunities throughout their time with Paradyme. We’re seeking curious and creative technical staff who are excited about delivering quality solutions. Collaborate with other developers, staff and leadership to design solutions that solve customer problems  Design, develop, and maintain technical solutions  Build and improve tools for users to understand and analyze large-scale data  Perform debugging, troubleshooting, modifications and testing of software and solutions  Develop documentation, and collaborate in the development of technical procedures and user support guides Requirements Bachelor’s degree in computer science or related field  Experience with JavaScript, Java, or other object-oriented programming language  Hands-on experience and understanding of object-oriented programming, data structures, algorithms, profiling & optimization  Passion for developing team-oriented solutions to complex engineering problems  Should be eligible to receive a U.S. security clearance. Physical Requirements: These are the essential physical requirements needed to successfully perform the job.Sedentary work.Requires sitting up to 8 hours per day.May require lifting up to 5 pounds unassisted.Fine repetitive motor skills with hands, wrists, and fingers in coordination with eyes.Hearing, speaking, and vision: Adequate to perform job duties and communicate in person, via video, and telephone. Includes reading information from printed sources and computer screens.Other: Work may be performed in an office environment, which may involve frequent contact with staff and the public. Work may be stressful at times.Paradyme Management, Inc. is committed to the full inclusion of all qualified individuals. In keeping with our commitment, Paradyme will take the steps to ensure that people with disabilities are provided reasonable accommodations. Accordingly, if a reasonable accommodation is required to fully participate in the job application or interview process, to perform the essential functions of the position, and/or to receive all other benefits and privileges of employment, please contact Rose Luczak, Director of People Operations at rose.luczak@paradyme.us or at (571) 289-0548 EEO Statement Paradyme is a federal contractor and an EEO and an Affirmative Action Employer. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, pregnancy-related disability, physical or mental disability, genetic information, sexual orientation, marital status, familial status, personal appearance, occupation, citizenship, veteran or military status, gender identity or expression, or any other characteristic protected by federal, state or local law.\n      "
}